1) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/AccessToken/Event/AccessTokenCreatedEvent.php:135    [M] NotIdentical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.18c09bc903bbae31a3fb40fb4e926d5c.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $expiresAt = \DateTimeImmutable::createFromFormat('U', (string) $json->payload->expires_at);
-        $resourceServerId = null !== $json->payload->resource_server_id ? ResourceServerId::create($json->payload->resource_server_id) : null;
+        $resourceServerId = null === $json->payload->resource_server_id ? ResourceServerId::create($json->payload->resource_server_id) : null;
         return new self($accessTokenId, $resourceOwnerId, $clientId, $parameters, $metadatas, $scopes, $expiresAt, $resourceServerId, $recordedOn, $eventId);
     }
     /**
      * @return AccessTokenId
      */
     public function getAccessTokenId() : AccessTokenId

1) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCode.php:51    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.77e974a76628f28cc25cfaeeb710b201.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public static function createEmpty() : self
+    protected static function createEmpty() : self
     {
         return new self();
     }
     /**
      * {@inheritdoc}
      */

2) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCode.php:59    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.bf1bb4a6f06bae77877bf98640611b8e.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public static function getSchema() : string
+    protected static function getSchema() : string
     {
         return 'https://oauth2-framework.spomky-labs.com/schemas/model/authorization-code/1.0/schema';
     }
     /**
      * @param AuthorizationCodeId $authorizationCodeId
      * @param ClientId            $clientId

3) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCode.php:78    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.9e0a5c6af3eec182f51fbd36eb9bd492.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function create(AuthorizationCodeId $authorizationCodeId, ClientId $clientId, UserAccountId $userAccountId, array $queryParameters, string $redirectUri, \DateTimeImmutable $expiresAt, DataBag $parameters, DataBag $metadatas, array $scopes, ?ResourceServerId $resourceServerId)
+    protected function create(AuthorizationCodeId $authorizationCodeId, ClientId $clientId, UserAccountId $userAccountId, array $queryParameters, string $redirectUri, \DateTimeImmutable $expiresAt, DataBag $parameters, DataBag $metadatas, array $scopes, ?ResourceServerId $resourceServerId)
     {
         $clone = clone $this;
         $clone->authorizationCodeId = $authorizationCodeId;
         $clone->clientId = $clientId;
         $clone->resourceOwnerId = $userAccountId;
         $clone->queryParameters = $queryParameters;

4) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCode.php:105    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.998d6f4852989a7bcece4195edca5549.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (null === $this->authorizationCodeId) {
+        if (null !== $this->authorizationCodeId) {
             throw new \RuntimeException('Authorization code not initialized.');
         }
         return $this->authorizationCodeId;
     }
     /**
      * @return array

5) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCode.php:103    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.b759f0d18e3af05af3544f3c7ecfb9b9.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getTokenId() : TokenId
+    protected function getTokenId() : TokenId
     {
         if (null === $this->authorizationCodeId) {
             throw new \RuntimeException('Authorization code not initialized.');
         }
         return $this->authorizationCodeId;
     }

6) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCode.php:115    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.4dda7b8b64437f218bbfa2809367c601.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getQueryParameters() : array
+    protected function getQueryParameters() : array
     {
         return $this->queryParameters;
     }
     /**
      * @return bool
      */

7) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCode.php:123    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.86e9792b547cb99d7a0f42f73cf1d973.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function isUsed() : bool
+    protected function isUsed() : bool
     {
         return $this->used;
     }
     /**
      * @return AuthorizationCode
      */

8) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCode.php:133    [M] TrueValue
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.01b0867d6cf66e8f57a0a3a23e622254.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (true === $this->used) {
+        if (false === $this->used) {
             return $this;
         }
         $clone = clone $this;
         $clone->used = true;
         $event = AuthorizationCodeEvent\AuthorizationCodeMarkedAsUsedEvent::create($clone->getTokenId());
         $clone->record($event);

9) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCode.php:133    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.7f7ddc9c28c7201eb9afd3f7288205e5.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (true === $this->used) {
+        if (true !== $this->used) {
             return $this;
         }
         $clone = clone $this;
         $clone->used = true;
         $event = AuthorizationCodeEvent\AuthorizationCodeMarkedAsUsedEvent::create($clone->getTokenId());
         $clone->record($event);

10) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCode.php:137    [M] TrueValue
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.299e0768952bfd53baac3c1c101fed5e.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $clone = clone $this;
-        $clone->used = true;
+        $clone->used = false;
         $event = AuthorizationCodeEvent\AuthorizationCodeMarkedAsUsedEvent::create($clone->getTokenId());
         $clone->record($event);
         return $clone;
     }
     /**
      * @return AuthorizationCode

11) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCode.php:131    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.b46a1297c1eaed62ac2821bd9ac3a2b3.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function markAsUsed() : self
+    protected function markAsUsed() : self
     {
         if (true === $this->used) {
             return $this;
         }
         $clone = clone $this;
         $clone->used = true;

12) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCode.php:150    [M] TrueValue
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.61452d1db84644236be0ba619cb67ecd.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $clone = clone $this;
-        $clone->revoked = true;
+        $clone->revoked = false;
         $event = AuthorizationCodeEvent\AuthorizationCodeRevokedEvent::create($clone->getTokenId());
         $clone->record($event);
         return $clone;
     }
     /**
      * @return array

13) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCode.php:147    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.2554ac753c73665c3b558af27b0b33b1.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function markAsRevoked() : self
+    protected function markAsRevoked() : self
     {
         $clone = clone $this;
         $clone->revoked = true;
         $event = AuthorizationCodeEvent\AuthorizationCodeRevokedEvent::create($clone->getTokenId());
         $clone->record($event);
         return $clone;

14) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCode.php:160    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.138116bb5cc8197a9a259387f575f0c5.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getQueryParams() : array
+    protected function getQueryParams() : array
     {
         return $this->queryParameters;
     }
     /**
      * @param string $key
      *

16) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCode.php:192    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.202ea7e066804aca5422b098dc398bc8.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getRedirectUri() : string
+    protected function getRedirectUri() : string
     {
         if (null === $this->authorizationCodeId) {
             throw new \RuntimeException('Authorization code not initialized.');
         }
         return $this->redirectUri;
     }

17) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCode.php:219    [M] NotIdentical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.612c5780c53ca86dc0c11537d9add439.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $redirectUri = $json->redirect_uri;
-        $resourceServerId = null !== $json->resource_server_id ? ResourceServerId::create($json->resource_server_id) : null;
+        $resourceServerId = null === $json->resource_server_id ? ResourceServerId::create($json->resource_server_id) : null;
         $used = $json->is_used;
         $expiresAt = \DateTimeImmutable::createFromFormat('U', (string) $json->expires_at);
         $clientId = ClientId::create($json->client_id);
         $parameters = DataBag::create((array) $json->parameters);
         $metadatas = DataBag::create((array) $json->metadatas);
         $scopes = (array) $json->scopes;

18) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCode.php:214    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.51d7b7fbaf61c49e037696204a54c03a.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public static function createFromJson(\stdClass $json) : DomainObject
+    protected static function createFromJson(\stdClass $json) : DomainObject
     {
         $authorizationCodeId = AuthorizationCodeId::create($json->auth_code_id);
         $queryParameters = (array) $json->query_parameters;
         $redirectUri = $json->redirect_uri;
         $resourceServerId = null !== $json->resource_server_id ? ResourceServerId::create($json->resource_server_id) : null;
         $used = $json->is_used;

19) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCode.php:254    [M] Plus
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.5c4310c122c50ca98fb01f70174bb70e.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        $data = parent::jsonSerialize() + ['auth_code_id' => $this->getTokenId()->getValue(), 'query_parameters' => (object) $this->getQueryParameters(), 'redirect_uri' => $this->getRedirectUri(), 'is_used' => $this->isUsed()];
+        $data = parent::jsonSerialize() - ['auth_code_id' => $this->getTokenId()->getValue(), 'query_parameters' => (object) $this->getQueryParameters(), 'redirect_uri' => $this->getRedirectUri(), 'is_used' => $this->isUsed()];
         return $data;
     }
     /**
      * @param Event $event
      *
      * @return AuthorizationCode

20) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCode.php:252    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.6e2ba9b0ade7f07e82737515a814be48.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function jsonSerialize()
+    protected function jsonSerialize()
     {
         $data = parent::jsonSerialize() + ['auth_code_id' => $this->getTokenId()->getValue(), 'query_parameters' => (object) $this->getQueryParameters(), 'redirect_uri' => $this->getRedirectUri(), 'is_used' => $this->isUsed()];
         return $data;
     }
     /**
      * @param Event $event

21) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCode.php:272    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.f91f5ca148b1f831e6c7a8f4ba2b7b9e.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $map = $this->getEventMap();
-        if (!array_key_exists($event->getType(), $map)) {
+        if (array_key_exists($event->getType(), $map)) {
             throw new \RuntimeException('Unsupported event.');
         }
         if (null !== $this->authorizationCodeId && $this->authorizationCodeId->getValue() !== $event->getDomainId()->getValue()) {
             throw new \RuntimeException('Event not applicable for this authorization code.');
         }
         $method = $map[$event->getType()];

22) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCode.php:275    [M] NotIdentical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.6515a21986978b23bdd4a178ad31b35a.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        if (null !== $this->authorizationCodeId && $this->authorizationCodeId->getValue() !== $event->getDomainId()->getValue()) {
+        if (null === $this->authorizationCodeId && $this->authorizationCodeId->getValue() !== $event->getDomainId()->getValue()) {
             throw new \RuntimeException('Event not applicable for this authorization code.');
         }
         $method = $map[$event->getType()];
         return $this->{$method}($event);
     }
     /**

23) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCode.php:275    [M] NotIdentical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.79850020db6e91e7429fea64854b0170.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        if (null !== $this->authorizationCodeId && $this->authorizationCodeId->getValue() !== $event->getDomainId()->getValue()) {
+        if (null !== $this->authorizationCodeId && $this->authorizationCodeId->getValue() === $event->getDomainId()->getValue()) {
             throw new \RuntimeException('Event not applicable for this authorization code.');
         }
         $method = $map[$event->getType()];
         return $this->{$method}($event);
     }
     /**

24) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCode.php:275    [M] LogicalAnd
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.272027cb9e7cb09f38c0a84ef84a9600.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        if (null !== $this->authorizationCodeId && $this->authorizationCodeId->getValue() !== $event->getDomainId()->getValue()) {
+        if (null !== $this->authorizationCodeId || $this->authorizationCodeId->getValue() !== $event->getDomainId()->getValue()) {
             throw new \RuntimeException('Event not applicable for this authorization code.');
         }
         $method = $map[$event->getType()];
         return $this->{$method}($event);
     }
     /**

25) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCode.php:269    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.8cd9e9d81b4917a4f267547e0ac12889.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function apply(Event $event) : self
+    protected function apply(Event $event) : self
     {
         $map = $this->getEventMap();
         if (!array_key_exists($event->getType(), $map)) {
             throw new \RuntimeException('Unsupported event.');
         }
         if (null !== $this->authorizationCodeId && $this->authorizationCodeId->getValue() !== $event->getDomainId()->getValue()) {

26) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCode.php:300    [M] ProtectedVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.6fdc87836a6a0daf90655945e234b443.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    protected function applyAuthorizationCodeCreatedEvent(AuthorizationCodeEvent\AuthorizationCodeCreatedEvent $event) : self
+    private function applyAuthorizationCodeCreatedEvent(AuthorizationCodeEvent\AuthorizationCodeCreatedEvent $event) : self
     {
         $clone = clone $this;
         $clone->authorizationCodeId = $event->getAuthorizationCodeId();
         $clone->clientId = $event->getClientId();
         $clone->resourceOwnerId = $event->getUserAccountId();
         $clone->queryParameters = $event->getQueryParameters();

28) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCode.php:323    [M] ProtectedVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.9391e7fe41d0612a3e384cfbb6bed9f6.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    protected function applyAuthorizationCodeMarkedAsUsedEvent(AuthorizationCodeEvent\AuthorizationCodeMarkedAsUsedEvent $event) : self
+    private function applyAuthorizationCodeMarkedAsUsedEvent(AuthorizationCodeEvent\AuthorizationCodeMarkedAsUsedEvent $event) : self
     {
         $clone = clone $this;
         $clone->used = true;
         return $clone;
     }
     /**

30) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCode.php:336    [M] ProtectedVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.95ec8d541b35e30e916c300eeb15d5cd.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    protected function applyAuthorizationCodeRevokedEvent(AuthorizationCodeEvent\AuthorizationCodeRevokedEvent $event) : self
+    private function applyAuthorizationCodeRevokedEvent(AuthorizationCodeEvent\AuthorizationCodeRevokedEvent $event) : self
     {
         $clone = clone $this;
         $clone->revoked = true;
         return $clone;
     }
 }

31) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCodeGrantType.php:50    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.9825af5ac3685be30857a7c02269f5d4.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getAssociatedResponseTypes() : array
+    protected function getAssociatedResponseTypes() : array
     {
         return ['code'];
     }
     /**
      * {@inheritdoc}
      */

32) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCodeGrantType.php:58    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.8c38aa1dca8d46de22757106bcb14999.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getGrantType() : string
+    protected function getGrantType() : string
     {
         return 'authorization_code';
     }
     /**
      * {@inheritdoc}
      */

33) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCodeGrantType.php:72    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.84f9ea515eb4bac3c797aba3895680c0.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $diff = array_diff($requiredParameters, array_keys($parameters));
-        if (!empty($diff)) {
+        if (empty($diff)) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, sprintf('Missing grant type parameter(s): %s.', implode(', ', $diff)));
         }
     }
     /**
      * {@inheritdoc}
      */

34) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCodeGrantType.php:66    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.89e19fe892327869d544bfe7f01b4a02.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function checkTokenRequest(ServerRequestInterface $request)
+    protected function checkTokenRequest(ServerRequestInterface $request)
     {
         $parameters = $request->getParsedBody() ?? [];
         $requiredParameters = ['code', 'redirect_uri'];
         $diff = array_diff($requiredParameters, array_keys($parameters));
         if (!empty($diff)) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, sprintf('Missing grant type parameter(s): %s.', implode(', ', $diff)));

35) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCodeGrantType.php:85    [M] TrueValue
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.ed608d28458f20a1c71cb2cc4ddf5cac.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $authorizationCode = $this->getAuthorizationCode($parameters['code']);
-        if (true === $authorizationCode->isUsed() || true === $authorizationCode->isRevoked()) {
+        if (false === $authorizationCode->isUsed() || true === $authorizationCode->isRevoked()) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_GRANT, 'The parameter "code" is invalid.');
         }
         $grantTypeData = $grantTypeData->withAvailableScopes($authorizationCode->getScopes());
         return $grantTypeData;
     }
     /**

36) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCodeGrantType.php:85    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.27ff160c4177062978120fd4413fbbaa.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $authorizationCode = $this->getAuthorizationCode($parameters['code']);
-        if (true === $authorizationCode->isUsed() || true === $authorizationCode->isRevoked()) {
+        if (true !== $authorizationCode->isUsed() || true === $authorizationCode->isRevoked()) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_GRANT, 'The parameter "code" is invalid.');
         }
         $grantTypeData = $grantTypeData->withAvailableScopes($authorizationCode->getScopes());
         return $grantTypeData;
     }
     /**

37) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCodeGrantType.php:85    [M] TrueValue
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.c7a746197735ef9ef226b780085e755a.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $authorizationCode = $this->getAuthorizationCode($parameters['code']);
-        if (true === $authorizationCode->isUsed() || true === $authorizationCode->isRevoked()) {
+        if (true === $authorizationCode->isUsed() || false === $authorizationCode->isRevoked()) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_GRANT, 'The parameter "code" is invalid.');
         }
         $grantTypeData = $grantTypeData->withAvailableScopes($authorizationCode->getScopes());
         return $grantTypeData;
     }
     /**
