38) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCodeGrantType.php:85    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.243f2741b4bb91d02f1c11b6405f4b82.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $authorizationCode = $this->getAuthorizationCode($parameters['code']);
-        if (true === $authorizationCode->isUsed() || true === $authorizationCode->isRevoked()) {
+        if (true === $authorizationCode->isUsed() || true !== $authorizationCode->isRevoked()) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_GRANT, 'The parameter "code" is invalid.');
         }
         $grantTypeData = $grantTypeData->withAvailableScopes($authorizationCode->getScopes());
         return $grantTypeData;
     }
     /**

39) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCodeGrantType.php:85    [M] LogicalOr
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.31f9a015eda48b88fba8adf0934ebe89.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $authorizationCode = $this->getAuthorizationCode($parameters['code']);
-        if (true === $authorizationCode->isUsed() || true === $authorizationCode->isRevoked()) {
+        if (true === $authorizationCode->isUsed() && true === $authorizationCode->isRevoked()) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_GRANT, 'The parameter "code" is invalid.');
         }
         $grantTypeData = $grantTypeData->withAvailableScopes($authorizationCode->getScopes());
         return $grantTypeData;
     }
     /**

40) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCodeGrantType.php:80    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.b11fdb00f09da1899b0444ee71a8cd16.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function prepareTokenResponse(ServerRequestInterface $request, GrantTypeData $grantTypeData) : GrantTypeData
+    protected function prepareTokenResponse(ServerRequestInterface $request, GrantTypeData $grantTypeData) : GrantTypeData
     {
         $parameters = $request->getParsedBody() ?? [];
         $authorizationCode = $this->getAuthorizationCode($parameters['code']);
         if (true === $authorizationCode->isUsed() || true === $authorizationCode->isRevoked()) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_GRANT, 'The parameter "code" is invalid.');
         }

41) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCodeGrantType.php:96    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.f813a32250890a1aa6da04f11e7107b5.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function grant(ServerRequestInterface $request, GrantTypeData $grantTypeData) : GrantTypeData
+    protected function grant(ServerRequestInterface $request, GrantTypeData $grantTypeData) : GrantTypeData
     {
         $parameters = $request->getParsedBody() ?? [];
         $authorizationCode = $this->getAuthorizationCode($parameters['code']);
         $this->checkClient($grantTypeData->getClient(), $parameters);
         $this->checkAuthorizationCode($authorizationCode, $grantTypeData->getClient());
         $this->checkPKCE($authorizationCode, $parameters);

42) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCodeGrantType.php:130    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.66e2f70718852c0ac0d4726fbd641247.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $authorizationCode = $this->authorizationCodeRepository->find(AuthorizationCodeId::create($code));
-        if (!$authorizationCode instanceof AuthorizationCode) {
+        if ($authorizationCode instanceof AuthorizationCode) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_GRANT, 'Code does not exist or is invalid for the client.');
         }
         return $authorizationCode;
     }
     /**
      * @param Client $client

43) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCodeGrantType.php:145    [M] TrueValue
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.390bb24e5d3ef7d92ded7817067ac96b.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (true === $client->isPublic()) {
+        if (false === $client->isPublic()) {
             if (!array_key_exists('client_id', $parameters) || $client->getPublicId()->getValue() !== $parameters['client_id']) {
                 throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, 'The "client_id" parameter is required for non-confidential clients.');
             }
         }
     }
     /**

44) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCodeGrantType.php:145    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.b1afea3384945f9da6c6c3437bdd11f5.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (true === $client->isPublic()) {
+        if (true !== $client->isPublic()) {
             if (!array_key_exists('client_id', $parameters) || $client->getPublicId()->getValue() !== $parameters['client_id']) {
                 throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, 'The "client_id" parameter is required for non-confidential clients.');
             }
         }
     }
     /**

45) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCodeGrantType.php:161    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.6f1c6de48a92dbc8559c50093c2dc964.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $params = $authorizationCode->getQueryParams();
-        if (!array_key_exists('code_challenge', $params)) {
+        if (array_key_exists('code_challenge', $params)) {
             return;
         }
         $code_challenge = $params['code_challenge'];
         $code_challenge_method = array_key_exists('code_challenge_method', $params) ? $params['code_challenge_method'] : 'plain';
         try {
             if (!array_key_exists('code_verifier', $parameters)) {

46) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCodeGrantType.php:169    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.32b7cd251c21db86c8f3822ed7a85f90.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         try {
-            if (!array_key_exists('code_verifier', $parameters)) {
+            if (array_key_exists('code_verifier', $parameters)) {
                 throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_GRANT, 'The parameter "code_verifier" is missing or invalid.');
             }
             $code_verifier = $parameters['code_verifier'];
             $method = $this->pkceMethodManager->get($code_challenge_method);
         } catch (\InvalidArgumentException $e) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, $e->getMessage());

47) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCodeGrantType.php:178    [M] FalseValue
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.20972d8be40686cabcb1efd7624e8338.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        if (false === $method->isChallengeVerified($code_verifier, $code_challenge)) {
+        if (true === $method->isChallengeVerified($code_verifier, $code_challenge)) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_GRANT, 'The parameter "code_verifier" is invalid or invalid.');
         }
     }
     /**
      * @param AuthorizationCode $authorizationCode
      * @param string            $redirectUri

48) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCodeGrantType.php:178    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.f2b4a61d4a5d96fa6780e535dd1cfb1a.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        if (false === $method->isChallengeVerified($code_verifier, $code_challenge)) {
+        if (false !== $method->isChallengeVerified($code_verifier, $code_challenge)) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_GRANT, 'The parameter "code_verifier" is invalid or invalid.');
         }
     }
     /**
      * @param AuthorizationCode $authorizationCode
      * @param string            $redirectUri

49) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCodeGrantType.php:191    [M] NotIdentical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.e83281e15096e37c23f44a300ded36b5.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if ($redirectUri !== $authorizationCode->getRedirectUri()) {
+        if ($redirectUri === $authorizationCode->getRedirectUri()) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, 'The parameter "redirect_uri" is invalid.');
         }
     }
     /**
      * @param AuthorizationCode $authorizationCode
      * @param Client            $client

50) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCodeGrantType.php:204    [M] NotIdentical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.23a454b5d188d2bdbfa022bb4e689c3f.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if ($client->getPublicId()->getValue() !== $authorizationCode->getClientId()->getValue()) {
+        if ($client->getPublicId()->getValue() === $authorizationCode->getClientId()->getValue()) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_GRANT, 'Code does not exist or is invalid for the client.');
         }
         if ($authorizationCode->hasExpired()) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_GRANT, 'The authorization code has expired.');
         }
     }

51) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCodeId.php:25    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.53c19ec78d587ec47b54e7b01e865844.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public static function create(string $value) : self
+    protected static function create(string $value) : self
     {
         return new self($value);
     }
 }

52) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCodeResponseType.php:64    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.30279bfc1b5d526b7c1ec91038e28e60.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getAssociatedGrantTypes() : array
+    protected function getAssociatedGrantTypes() : array
     {
         return ['authorization_code'];
     }
     /**
      * {@inheritdoc}
      */

53) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCodeResponseType.php:72    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.679fcc639e67ab2c58d69a79e632ab5c.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getResponseType() : string
+    protected function getResponseType() : string
     {
         return 'code';
     }
     /**
      * {@inheritdoc}
      */

54) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCodeResponseType.php:80    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.14c5e6f1472c553fa67f54e761480a7d.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getResponseMode() : string
+    protected function getResponseMode() : string
     {
         return self::RESPONSE_TYPE_MODE_QUERY;
     }
     /**
      * {@inheritdoc}
      */

55) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCodeResponseType.php:92    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.99ee27b0522615558cc04c6eeaf9e2af.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $queryParams = $authorization->getQueryParams();
-        if (!array_key_exists('code_challenge', $queryParams)) {
+        if (array_key_exists('code_challenge', $queryParams)) {
             if (true === $this->pkceForPublicClientsEnforced && $authorization->getClient()->isPublic()) {
                 throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, 'Non-confidential clients must set a proof key (PKCE) for code exchange.');
             }
         } else {
             $codeChallengeMethod = array_key_exists('code_challenge_method', $queryParams) ? $queryParams['code_challenge_method'] : 'plain';
             if (!$this->pkceMethodManager->has($codeChallengeMethod)) {

56) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCodeResponseType.php:98    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.c05fe90a8574203f1a895e5bc523b051.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             $codeChallengeMethod = array_key_exists('code_challenge_method', $queryParams) ? $queryParams['code_challenge_method'] : 'plain';
-            if (!$this->pkceMethodManager->has($codeChallengeMethod)) {
+            if ($this->pkceMethodManager->has($codeChallengeMethod)) {
                 throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, sprintf('The challenge method "%s" is not supported.', $codeChallengeMethod));
             }
         }
         $authorizationCode = AuthorizationCode::createEmpty();
         $this->authorizationCodeRepository->save($authorizationCode);

58) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCodeResponseType.php:88    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.5912a0c9fa2f7e0ffbe759db9e837b4e.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function process(Authorization $authorization, callable $next) : Authorization
+    protected function process(Authorization $authorization, callable $next) : Authorization
     {
         $queryParams = $authorization->getQueryParams();
         if (!array_key_exists('code_challenge', $queryParams)) {
             if (true === $this->pkceForPublicClientsEnforced && $authorization->getClient()->isPublic()) {
                 throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, 'Non-confidential clients must set a proof key (PKCE) for code exchange.');
             }

59) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCodeTypeHint.php:40    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.2b52a87190f987b1e020243fe744ff78.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function hint() : string
+    protected function hint() : string
     {
         return 'auth_code';
     }
     /**
      * {@inheritdoc}
      */

60) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCodeTypeHint.php:48    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.bd715c6dfaf19761863175ca6021d8ac.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function find(string $token) : ?Token
+    protected function find(string $token) : ?Token
     {
         $id = AuthorizationCodeId::create($token);
         return $this->authorizationCodeRepository->find($id);
     }
     /**
      * {@inheritdoc}

61) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCodeTypeHint.php:60    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.7a2d4eccbeed846ce2c30a5be6f07c61.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (!$token instanceof AuthorizationCode) {
+        if ($token instanceof AuthorizationCode) {
             throw new \InvalidArgumentException('The token is not a valid authorization code.');
         }
         if ($token->isRevoked()) {
             return;
         }
         $token = $token->markAsRevoked();

62) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCodeTypeHint.php:58    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.ba5be44fad8a425abc0d0dd051369b43.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function revoke(Token $token)
+    protected function revoke(Token $token)
     {
         if (!$token instanceof AuthorizationCode) {
             throw new \InvalidArgumentException('The token is not a valid authorization code.');
         }
         if ($token->isRevoked()) {
             return;

64) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCodeTypeHint.php:86    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.95958b62381120d31fa5f722ec84ee74.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        $result = ['active' => !$token->hasExpired(), 'client_id' => $token->getClientId(), 'exp' => $token->getExpiresAt()->getTimestamp()];
+        $result = ['active' => $token->hasExpired(), 'client_id' => $token->getClientId(), 'exp' => $token->getExpiresAt()->getTimestamp()];
         if (!empty($token->getScopes())) {
             $result['scp'] = $token->getScopes();
         }
         return $result;
     }
 }

65) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCodeTypeHint.php:91    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.251eee74212fa4071a91487c46e4d308.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $result = ['active' => !$token->hasExpired(), 'client_id' => $token->getClientId(), 'exp' => $token->getExpiresAt()->getTimestamp()];
-        if (!empty($token->getScopes())) {
+        if (empty($token->getScopes())) {
             $result['scp'] = $token->getScopes();
         }
         return $result;
     }
 }

66) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCodeTypeHint.php:74    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.e63f763bd937b5ddd96e7979680be47e.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function introspect(Token $token) : array
+    protected function introspect(Token $token) : array
     {
         if (!$token instanceof AuthorizationCode) {
             throw new \InvalidArgumentException('The token is not a valid authorization code.');
         }
         if ($token->isRevoked()) {
             return ['active' => false];

67) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/Command/CreateAuthorizationCodeCommand.php:88    [M] ProtectedVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.d07169bdcf9159c936a8accf63fa094d.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    protected function __construct(AuthorizationCodeId $authorizationCodeId, ClientId $clientId, UserAccountId $userAccountId, array $queryParameters, string $redirectUri, \DateTimeImmutable $expiresAt, DataBag $parameters, DataBag $metadatas, array $scopes, ?ResourceServerId $resourceServerId)
+    private function __construct(AuthorizationCodeId $authorizationCodeId, ClientId $clientId, UserAccountId $userAccountId, array $queryParameters, string $redirectUri, \DateTimeImmutable $expiresAt, DataBag $parameters, DataBag $metadatas, array $scopes, ?ResourceServerId $resourceServerId)
     {
         $this->authorizationCodeId = $authorizationCodeId;
         $this->clientId = $clientId;
         $this->userAccountId = $userAccountId;
         $this->queryParameters = $queryParameters;
         $this->redirectUri = $redirectUri;

69) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/Command/CreateAuthorizationCodeCommand.php:124    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.88e93df33615391ec1c2fa521a77d909.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getClientId() : ClientId
+    protected function getClientId() : ClientId
     {
         return $this->clientId;
     }
     /**
      * @return UserAccountId
      */

70) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/Command/CreateAuthorizationCodeCommand.php:132    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.1467e8500e93096c020a9d938be9502c.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getUserAccountId() : UserAccountId
+    protected function getUserAccountId() : UserAccountId
     {
         return $this->userAccountId;
     }
     /**
      * @return array
      */

73) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/Command/CreateAuthorizationCodeCommand.php:156    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.fa96d2588827e9ab5e06cb85bc553bcc.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getParameters() : DataBag
+    protected function getParameters() : DataBag
     {
         return $this->parameters;
     }
     /**
      * @return DataBag
      */

74) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/Command/CreateAuthorizationCodeCommand.php:164    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.12e69a1536edbd1ef1722b10072c2807.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getMetadatas() : DataBag
+    protected function getMetadatas() : DataBag
     {
         return $this->metadatas;
     }
     /**
      * @return array
      */

75) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/Command/CreateAuthorizationCodeCommand.php:172    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.9867ababd319834105124b1fa5fafcf1.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getScopes() : array
+    protected function getScopes() : array
     {
         return $this->scopes;
     }
     /**
      * @return null|ResourceServerId
      */

76) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/Command/CreateAuthorizationCodeCommand.php:180    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.5a53c891c22ac630950ef14674efa7bd.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getResourceServerId() : ?ResourceServerId
+    protected function getResourceServerId() : ?ResourceServerId
     {
         return $this->resourceServerId;
     }
     /**
      * @return AuthorizationCodeId
      */

77) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/Command/CreateAuthorizationCodeCommand.php:188    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.43c9aea183c214c90c44a1c78dc8bab6.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getAuthorizationCodeId() : AuthorizationCodeId
+    protected function getAuthorizationCodeId() : AuthorizationCodeId
     {
         return $this->authorizationCodeId;
     }
     /**
      * @return \DateTimeImmutable
      */

78) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/Command/CreateAuthorizationCodeCommand.php:196    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.fc5fd861b4ee817da2f6ee1e43ca1358.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getExpiresAt() : \DateTimeImmutable
+    protected function getExpiresAt() : \DateTimeImmutable
     {
         return $this->expiresAt;
     }
 }
