79) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/Command/CreateAuthorizationCodeCommandHandler.php:42    [M] NotIdentical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.5ab30d174b7aea3d5b7b58ba547edca3.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $authorizationCode = $this->authorizationCodeRepository->find($command->getAuthorizationCodeId());
-        if (null !== $authorizationCode) {
+        if (null === $authorizationCode) {
             throw new \InvalidArgumentException(sprintf('The authorization code with ID "%s" already exists.', $command->getAuthorizationCodeId()->getValue()));
         }
         $authorizationCode = AuthorizationCode::createEmpty();
         $this->authorizationCodeRepository->save($authorizationCode);
     }

80) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/Command/CreateAuthorizationCodeCommandHandler.php:39    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.2e75c127ed6d48e28265d1d79789bb26.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function handle(CreateAuthorizationCodeCommand $command)
+    protected function handle(CreateAuthorizationCodeCommand $command)
     {
         $authorizationCode = $this->authorizationCodeRepository->find($command->getAuthorizationCodeId());
         if (null !== $authorizationCode) {
             throw new \InvalidArgumentException(sprintf('The authorization code with ID "%s" already exists.', $command->getAuthorizationCodeId()->getValue()));
         }
         $authorizationCode = AuthorizationCode::createEmpty();

81) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/Command/MarkAuthorizationCodeAsUsedCommand.php:30    [M] ProtectedVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.f3b2c237b7adc39d2e9a81362f184451.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    protected function __construct(AuthorizationCodeId $authorizationCodeId)
+    private function __construct(AuthorizationCodeId $authorizationCodeId)
     {
         $this->authorizationCodeId = $authorizationCodeId;
     }
     /**
      * @param AuthorizationCodeId $authorizationCodeId
      *

82) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/Command/MarkAuthorizationCodeAsUsedCommand.php:40    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.65a03560463a51e81e6debe08e22882a.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public static function create(AuthorizationCodeId $authorizationCodeId) : self
+    protected static function create(AuthorizationCodeId $authorizationCodeId) : self
     {
         return new self($authorizationCodeId);
     }
     /**
      * @return AuthorizationCodeId
      */

84) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/Command/MarkAuthorizationCodeAsUsedCommandHandler.php:42    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.b1f94007bc9d2379dc544f8084a1e17c.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $authorizationCode = $this->authorizationCodeRepository->find($authorizationCodeId);
-        if (null === $authorizationCode) {
+        if (null !== $authorizationCode) {
             throw new \InvalidArgumentException(sprintf('Unable to find the authorization code with ID "%s".', $command->getAuthorizationCodeId()->getValue()));
         }
         $authorizationCode = $authorizationCode->markAsUsed();
         $this->authorizationCodeRepository->save($authorizationCode);
     }
 }

85) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/Command/MarkAuthorizationCodeAsUsedCommandHandler.php:38    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.070db93c3c5328592b89250ad01959c2.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function handle(MarkAuthorizationCodeAsUsedCommand $command)
+    protected function handle(MarkAuthorizationCodeAsUsedCommand $command)
     {
         $authorizationCodeId = $command->getAuthorizationCodeId();
         $authorizationCode = $this->authorizationCodeRepository->find($authorizationCodeId);
         if (null === $authorizationCode) {
             throw new \InvalidArgumentException(sprintf('Unable to find the authorization code with ID "%s".', $command->getAuthorizationCodeId()->getValue()));
         }

90) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/Command/RevokeAuthorizationCodeCommandHandler.php:38    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.33d176cf11be7a4399202158eb3c8dfe.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function handle(RevokeAuthorizationCodeCommand $command)
+    protected function handle(RevokeAuthorizationCodeCommand $command)
     {
         $authorizationCodeId = $command->getAuthorizationCodeId();
         $authorizationCode = $this->authorizationCodeRepository->find($authorizationCodeId);
         if (null === $authorizationCode) {
             throw new \InvalidArgumentException(sprintf('Unable to find the authorization code with ID "%s".', $command->getAuthorizationCodeId()->getValue()));
         }

103) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/Event/AuthorizationCodeCreatedEvent.php:258    [M] NotIdentical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.d5a334329027673e8405729bc94bcc46.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $queryParameters = (array) $json->payload->query_parameters;
-        $resourceServerId = null !== $json->payload->resource_server_id ? ResourceServerId::create($json->payload->resource_server_id) : null;
+        $resourceServerId = null === $json->payload->resource_server_id ? ResourceServerId::create($json->payload->resource_server_id) : null;
         return new self($authorizationCodeId, $clientId, $userAccountId, $queryParameters, $redirectUri, $expiresAt, $parameters, $metadatas, $scopes, $resourceServerId, $recordedOn, $eventId);
     }
 }

105) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/Event/AuthorizationCodeMarkedAsUsedEvent.php:36    [M] ProtectedVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.c5631b9e245bd27bbc4d7da58a84d5e8.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    protected function __construct(AuthorizationCodeId $authorizationCodeId, ?\DateTimeImmutable $recordedOn, ?EventId $eventId)
+    private function __construct(AuthorizationCodeId $authorizationCodeId, ?\DateTimeImmutable $recordedOn, ?EventId $eventId)
     {
         parent::__construct($recordedOn, $eventId);
         $this->authorizationCodeId = $authorizationCodeId;
     }
     /**
      * {@inheritdoc}

108) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/Event/AuthorizationCodeMarkedAsUsedEvent.php:71    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.9d389bee672eeebe52152cd23feeebf8.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getDomainId() : Id
+    protected function getDomainId() : Id
     {
         return $this->getAuthorizationCodeId();
     }
     /**
      * {@inheritdoc}
      */

115) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/PKCEMethod/PKCEMethodManager.php:28    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.6856fc3428f571a1bdf939f9e4f8f901.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function add(PKCEMethod $method) : self
+    protected function add(PKCEMethod $method) : self
     {
         $this->pkceMethods[$method->name()] = $method;
         return $this;
     }
     /**
      * @param string $method

116) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/PKCEMethod/PKCEMethodManager.php:40    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.46cca3ef88ce59211ce90817a33c854d.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function has(string $method) : bool
+    protected function has(string $method) : bool
     {
         return array_key_exists($method, $this->pkceMethods);
     }
     /**
      * @param string $method
      *

117) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/PKCEMethod/PKCEMethodManager.php:52    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.19065a2c266d906cb38bbfdff1d476d5.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function get(string $method) : PKCEMethod
+    protected function get(string $method) : PKCEMethod
     {
         return $this->pkceMethods[$method];
     }
     /**
      * @return string[]
      */

118) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/PKCEMethod/PKCEMethodManager.php:60    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.1ae6fddf37407729c5ce8cca08ff8896.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function names() : array
+    protected function names() : array
     {
         return array_keys($this->pkceMethods);
     }
 }

119) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/PKCEMethod/Plain.php:21    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.011bd713a0506c359ff9b89f401767fc.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function name() : string
+    protected function name() : string
     {
         return 'plain';
     }
     /**
      * {@inheritdoc}
      */

120) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/PKCEMethod/Plain.php:29    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.788649b79e0d49bffa34e589fb89d67a.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function isChallengeVerified(string $codeVerifier, string $codeChallenge) : bool
+    protected function isChallengeVerified(string $codeVerifier, string $codeChallenge) : bool
     {
         return hash_equals($codeChallenge, $codeVerifier);
     }
 }

122) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/PKCEMethod/S256.php:33    [M] TrueValue
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.adecdcfcd8547a8d76e0cb41dcbdb8d3.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        return hash_equals($codeChallenge, Base64Url::encode(hash('sha256', $codeVerifier, true)));
+        return hash_equals($codeChallenge, Base64Url::encode(hash('sha256', $codeVerifier, false)));
     }
 }

124) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:117    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.9375307c24f33d8c78ea2b0cf5d49f31.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public static function create(Client $client, array $queryParameters) : self
+    protected static function create(Client $client, array $queryParameters) : self
     {
         return new self($client, $queryParameters);
     }
     /**
      * @return array
      */

126) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:157    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.4959d7fdf0879d63d28b35afc273f659.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getClient() : Client
+    protected function getClient() : Client
     {
         return $this->client;
     }
     /**
      * @param TokenType $tokenType
      *

127) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:167    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.7891fb0a2ad32f30368350c851c51290.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function withTokenType(TokenType $tokenType) : self
+    protected function withTokenType(TokenType $tokenType) : self
     {
         $clone = clone $this;
         $clone->tokenType = $tokenType;
         return $clone;
     }
     /**

128) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:178    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.6bbbf2b782e2fd291bf4339de1f27481.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getTokenType() : ?TokenType
+    protected function getTokenType() : ?TokenType
     {
         return $this->tokenType;
     }
     /**
      * @param ResponseType[] $responseTypes
      *

129) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:230    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.f3a7f5dbca46154dd07d64f059d7a088.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function withRedirectUri(string $redirectUri) : self
+    protected function withRedirectUri(string $redirectUri) : self
     {
         $clone = clone $this;
         $clone->redirectUri = $redirectUri;
         return $clone;
     }
     /**

130) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:241    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.eb9a51cc1a2efcffc10c5b8ab3870ed9.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getRedirectUri() : ?string
+    protected function getRedirectUri() : ?string
     {
         return $this->redirectUri;
     }
     /**
      * @param UserAccount $userAccount
      * @param bool        $isFullyAuthenticated

131) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:252    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.0abf3f54c084a76637b1746386855b81.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function withUserAccount(UserAccount $userAccount, bool $isFullyAuthenticated) : self
+    protected function withUserAccount(UserAccount $userAccount, bool $isFullyAuthenticated) : self
     {
         $clone = clone $this;
         $clone->userAccount = $userAccount;
         $clone->userAccountFullyAuthenticated = $isFullyAuthenticated;
         return $clone;
     }

132) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:264    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.acc104a1ddb3a84550212a7661acc100.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getUserAccount() : ?UserAccount
+    protected function getUserAccount() : ?UserAccount
     {
         return $this->userAccount;
     }
     /**
      * @param string $responseParameter
      * @param mixed  $value

133) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:275    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.eacf0971ef7e81d3f46b1b8a16a64e72.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function withResponseParameter(string $responseParameter, $value) : self
+    protected function withResponseParameter(string $responseParameter, $value) : self
     {
         $clone = clone $this;
         $clone->responseParameters[$responseParameter] = $value;
         return $clone;
     }
     /**

134) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:286    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.03a9c7b13c9317db4a744eed045e6eda.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getResponseParameters() : array
+    protected function getResponseParameters() : array
     {
         return $this->responseParameters;
     }
     /**
      * @param string $param
      *

135) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:298    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.4cd67eb30bb3f2d8c66576be8312876f.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (!$this->hasResponseParameter($param)) {
+        if ($this->hasResponseParameter($param)) {
             throw new \InvalidArgumentException(sprintf('Invalid response parameter "%s".', $param));
         }
         return $this->getResponseParameters()[$param];
     }
     /**
      * @param string $param

136) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:296    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.c1153e0098573b5fa12fe557685ef17b.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getResponseParameter(string $param)
+    protected function getResponseParameter(string $param)
     {
         if (!$this->hasResponseParameter($param)) {
             throw new \InvalidArgumentException(sprintf('Invalid response parameter "%s".', $param));
         }
         return $this->getResponseParameters()[$param];
     }

137) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:310    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.51c69deeafb616c11c29d7cf5a74b0b2.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function hasResponseParameter(string $param) : bool
+    protected function hasResponseParameter(string $param) : bool
     {
         return array_key_exists($param, $this->getResponseParameters());
     }
     /**
      * @param string $responseHeader
      * @param mixed  $value

139) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:517    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.81ef33d8f84a729e0acb2b719558ab4a.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getResourceServer() : ?ResourceServer
+    protected function getResourceServer() : ?ResourceServer
     {
         return $this->resourceServer;
     }
     /**
      * @param ResourceServer $resourceServer
      *

140) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ResponseTypeManager.php:28    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.89d19a498fc1bb3f53bb1ed473864190.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function add(ResponseType $responseType) : self
+    protected function add(ResponseType $responseType) : self
     {
         $this->responseTypes[$responseType->getResponseType()] = $responseType;
         return $this;
     }
     /**
      * @param string $name

141) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ResponseTypeManager.php:54    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.bad7d7c10db8d7ed1a0ca3257f6d1a5e.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (!$this->isSupported($names)) {
+        if ($this->isSupported($names)) {
             throw new \InvalidArgumentException(sprintf('The response type "%s" is not supported.', $names));
         }
         $responseTypes = explode(' ', $names);
         $types = [];
         foreach ($responseTypes as $responseType) {
             $type = $this->responseTypes[$responseType];

142) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ResponseTypeManager.php:60    [M] Foreach_
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.bf783e784cec307436956ae90cb84ff5.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $types = [];
-        foreach ($responseTypes as $responseType) {
+        foreach (array() as $responseType) {
             $type = $this->responseTypes[$responseType];
             $types[] = $type;
         }
         return $types;
     }
     /**

143) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ResponseTypeManager.php:52    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.6fdf5ee41e47d58f286fd5f0d1e50857.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function find(string $names) : array
+    protected function find(string $names) : array
     {
         if (!$this->isSupported($names)) {
             throw new \InvalidArgumentException(sprintf('The response type "%s" is not supported.', $names));
         }
         $responseTypes = explode(' ', $names);
         $types = [];

144) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ResponseTypeManager.php:81    [M] LogicalAnd
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.e67a5ed4d031e4137c3e55678218615d.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             }
-            if (in_array('code', $types) && in_array('token', $types)) {
+            if (in_array('code', $types) || in_array('token', $types)) {
                 $types[] = 'code id_token token';
             }
         }
         if (in_array('code', $types) && in_array('token', $types)) {
             $types[] = 'code token';
         }

146) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ResponseTypeManager.php:71    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.d095829e3b08b37e406eb542e5c585f7.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function all() : array
+    protected function all() : array
     {
         $types = array_keys($this->responseTypes);
         if (in_array('id_token', $types)) {
             if (in_array('code', $types)) {
                 $types[] = 'code id_token';
             }

147) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ResponseTypeManager.php:97    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.687e02b7bcecdff87739ad18817f3525.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function isSupported(string $responseType) : bool
+    protected function isSupported(string $responseType) : bool
     {
         return in_array($responseType, $this->all());
     }
 }

148) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/BearerTokenType/BearerToken.php:61    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.d14be1ee82ae628ebca8fd6fd0fd66db.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function isTokenFromAuthorizationHeaderAllowed() : bool
+    protected function isTokenFromAuthorizationHeaderAllowed() : bool
     {
         return $this->tokenFromAuthorizationHeaderAllowed;
     }
     /**
      * @return bool
      */

149) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/BearerTokenType/BearerToken.php:69    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.6b3fb2234b19a65ec7a1a68a04634348.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function isTokenFromRequestBodyAllowed() : bool
+    protected function isTokenFromRequestBodyAllowed() : bool
     {
         return $this->tokenFromRequestBodyAllowed;
     }
     /**
      * @return bool
      */
