150) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/BearerTokenType/BearerToken.php:77    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.2348a2b5a70116e0d12e8c67116322b8.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function isTokenFromQueryStringAllowed() : bool
+    protected function isTokenFromQueryStringAllowed() : bool
     {
         return $this->tokenFromQueryStringAllowed;
     }
     /**
      * {@inheritdoc}
      */

152) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/BearerTokenType/BearerToken.php:93    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.480c9c8507ecc15ab0a07d50466be9a0.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getScheme() : string
+    protected function getScheme() : string
     {
         return sprintf('%s realm="%s"', $this->name(), $this->realm);
     }
     /**
      * {@inheritdoc}
      */

153) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/BearerTokenType/BearerToken.php:101    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.73f8be111beda21d96ee8ea0ddb3778d.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getInformation() : array
+    protected function getInformation() : array
     {
         return ['token_type' => $this->name()];
     }
     /**
      * {@inheritdoc}
      */

154) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/BearerTokenType/BearerToken.php:120    [M] TrueValue
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.4ab958a3278ebf458ff53914e92659b7.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         foreach ($methods as $test => $method) {
-            if (true === $this->{$test}() && null !== ($token = $this->{$method}($request))) {
+            if (false === $this->{$test}() && null !== ($token = $this->{$method}($request))) {
                 return $token;
             }
         }
         return null;
     }
     /**

155) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/BearerTokenType/BearerToken.php:120    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.286e682cf1a02ec2d4971c8ffe3888e5.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         foreach ($methods as $test => $method) {
-            if (true === $this->{$test}() && null !== ($token = $this->{$method}($request))) {
+            if (true !== $this->{$test}() && null !== ($token = $this->{$method}($request))) {
                 return $token;
             }
         }
         return null;
     }
     /**

156) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/BearerTokenType/BearerToken.php:120    [M] NotIdentical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.509a2d08847f70e3545bb880ca44b129.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         foreach ($methods as $test => $method) {
-            if (true === $this->{$test}() && null !== ($token = $this->{$method}($request))) {
+            if (true === $this->{$test}() && null === ($token = $this->{$method}($request))) {
                 return $token;
             }
         }
         return null;
     }
     /**

157) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/BearerTokenType/BearerToken.php:120    [M] LogicalAnd
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.3dc9c830d7cb0965ef9c587ff2e02cb2.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         foreach ($methods as $test => $method) {
-            if (true === $this->{$test}() && null !== ($token = $this->{$method}($request))) {
+            if (true === $this->{$test}() || null !== ($token = $this->{$method}($request))) {
                 return $token;
             }
         }
         return null;
     }
     /**

158) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/BearerTokenType/BearerToken.php:119    [M] Foreach_
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.c1b74f7868be8826515b28cf050b6c2c.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $methods = ['isTokenFromAuthorizationHeaderAllowed' => 'getTokenFromAuthorizationHeaders', 'isTokenFromQueryStringAllowed' => 'getTokenFromQuery', 'isTokenFromRequestBodyAllowed' => 'getTokenFromRequestBody'];
-        foreach ($methods as $test => $method) {
+        foreach (array() as $test => $method) {
             if (true === $this->{$test}() && null !== ($token = $this->{$method}($request))) {
                 return $token;
             }
         }
         return null;
     }

159) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/BearerTokenType/BearerToken.php:111    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.fd75a6799a125a78bfab41e10c9dda65.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function findToken(ServerRequestInterface $request, array &$additionalCredentialValues) : ?string
+    protected function findToken(ServerRequestInterface $request, array &$additionalCredentialValues) : ?string
     {
         $methods = ['isTokenFromAuthorizationHeaderAllowed' => 'getTokenFromAuthorizationHeaders', 'isTokenFromQueryStringAllowed' => 'getTokenFromQuery', 'isTokenFromRequestBodyAllowed' => 'getTokenFromRequestBody'];
         foreach ($methods as $test => $method) {
             if (true === $this->{$test}() && null !== ($token = $this->{$method}($request))) {
                 return $token;
             }

160) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/BearerTokenType/BearerToken.php:133    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.e4092b350a90f64ca4be501c488ff2d6.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (!$accessToken->hasParameter('token_type')) {
+        if ($accessToken->hasParameter('token_type')) {
             return false;
         }
         return $accessToken->getParameter('token_type') === $this->name();
     }
     /**
      * Get the token from the authorization header.

161) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/BearerTokenType/BearerToken.php:137    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.66108a7b7a548ff9f08c8e4108d2a8fe.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        return $accessToken->getParameter('token_type') === $this->name();
+        return $accessToken->getParameter('token_type') !== $this->name();
     }
     /**
      * Get the token from the authorization header.
      *
      * @param ServerRequestInterface $request
      *

162) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/BearerTokenType/BearerToken.php:131    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.1c854185b675eecc4cb6a4e5c9729e48.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function isTokenRequestValid(AccessToken $accessToken, ServerRequestInterface $request, array $additionalCredentialValues) : bool
+    protected function isTokenRequestValid(AccessToken $accessToken, ServerRequestInterface $request, array $additionalCredentialValues) : bool
     {
         if (!$accessToken->hasParameter('token_type')) {
             return false;
         }
         return $accessToken->getParameter('token_type') === $this->name();
     }

163) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/BearerTokenType/BearerToken.php:152    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.495e9c402c909576ceb9fafb14b3f72b.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         foreach ($authorization_headers as $authorization_header) {
-            if (1 === preg_match('/' . preg_quote('Bearer', '/') . '\\s([a-zA-Z0-9\\-_\\+~\\/\\.]+)/', $authorization_header, $matches)) {
+            if (0 === preg_match('/' . preg_quote('Bearer', '/') . '\\s([a-zA-Z0-9\\-_\\+~\\/\\.]+)/', $authorization_header, $matches)) {
                 return $matches[1];
             }
         }
         return null;
     }
     /**

164) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/BearerTokenType/BearerToken.php:152    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.47528f629793309af2b70ad378bc41d3.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         foreach ($authorization_headers as $authorization_header) {
-            if (1 === preg_match('/' . preg_quote('Bearer', '/') . '\\s([a-zA-Z0-9\\-_\\+~\\/\\.]+)/', $authorization_header, $matches)) {
+            if (1 !== preg_match('/' . preg_quote('Bearer', '/') . '\\s([a-zA-Z0-9\\-_\\+~\\/\\.]+)/', $authorization_header, $matches)) {
                 return $matches[1];
             }
         }
         return null;
     }
     /**

165) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/BearerTokenType/BearerToken.php:153    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.b5378b1e9ef867dd992d55c4b1db24a5.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             if (1 === preg_match('/' . preg_quote('Bearer', '/') . '\\s([a-zA-Z0-9\\-_\\+~\\/\\.]+)/', $authorization_header, $matches)) {
-                return $matches[1];
+                return $matches[0];
             }
         }
         return null;
     }
     /**
      * Get the token from the request body.

166) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/BearerTokenType/BearerToken.php:151    [M] Foreach_
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.d1f2f9eca47b90e8e30d1e846c37168a.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $authorization_headers = $request->getHeader('AUTHORIZATION');
-        foreach ($authorization_headers as $authorization_header) {
+        foreach (array() as $authorization_header) {
             if (1 === preg_match('/' . preg_quote('Bearer', '/') . '\\s([a-zA-Z0-9\\-_\\+~\\/\\.]+)/', $authorization_header, $matches)) {
                 return $matches[1];
             }
         }
         return null;
     }

167) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/BearerTokenType/BearerToken.php:147    [M] ProtectedVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.1f0c7e73e11988d82cd87d5203b90137.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    protected function getTokenFromAuthorizationHeaders(ServerRequestInterface $request) : ?string
+    private function getTokenFromAuthorizationHeaders(ServerRequestInterface $request) : ?string
     {
         $authorization_headers = $request->getHeader('AUTHORIZATION');
         foreach ($authorization_headers as $authorization_header) {
             if (1 === preg_match('/' . preg_quote('Bearer', '/') . '\\s([a-zA-Z0-9\\-_\\+~\\/\\.]+)/', $authorization_header, $matches)) {
                 return $matches[1];
             }

168) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/BearerTokenType/BearerToken.php:181    [M] ProtectedVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.4bda0b13c2327430a464b0cce12b514b.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    protected function getTokenFromQuery(ServerRequestInterface $request) : ?string
+    private function getTokenFromQuery(ServerRequestInterface $request) : ?string
     {
         $query_params = $request->getQueryParams();
         return $this->getAccessTokenFromParameters($query_params);
     }
     /**
      * @param array $params

169) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/BearerTokenType/BearerToken.php:193    [M] ProtectedVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.7bceac9ace0d3d2e5a52fc82975a585c.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    protected function getAccessTokenFromParameters(array $params) : ?string
+    private function getAccessTokenFromParameters(array $params) : ?string
     {
         return array_key_exists('access_token', $params) ? $params['access_token'] : null;
     }
 }

170) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/ClientConfigurationEndpoint/ClientConfigurationDeleteEndpoint.php:64    [M] Foreach_
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.4a4fa1703594429230a3b49860d9a56c.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $headers = ['Cache-Control' => 'no-cache, no-store, max-age=0, must-revalidate, private', 'Pragma' => 'no-cache'];
-        foreach ($headers as $k => $v) {
+        foreach (array() as $k => $v) {
             $response = $response->withHeader($k, $v);
         }
         return $response;
     }
 }

171) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/ClientConfigurationEndpoint/ClientConfigurationDeleteEndpoint.php:52    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.bbc66c0e007ab1a098735827096a2310.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function process(ServerRequestInterface $request, RequestHandlerInterface $next) : ResponseInterface
+    protected function process(ServerRequestInterface $request, RequestHandlerInterface $next) : ResponseInterface
     {
         /**
          * @var Client
          */
         $client = $request->getAttribute('client');
         $id = $client->getPublicId();

173) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/ClientConfigurationEndpoint/ClientConfigurationEndpoint.php:98    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.95fb0c1e7857ed9f92e8c33cacd36ae9.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             $client = $request->getAttribute('client');
-            if (!$client instanceof Client) {
+            if ($client instanceof Client) {
                 throw new \RuntimeException('Invalid client or invalid registration access token.');
             }
             if (!$client->has('registration_access_token')) {
                 throw new \RuntimeException('Invalid client or invalid registration access token.');
             }
             $values = [];

174) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/ClientConfigurationEndpoint/ClientConfigurationEndpoint.php:101    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.211b63f257554e6a3730182e2d1f1b3e.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             }
-            if (!$client->has('registration_access_token')) {
+            if ($client->has('registration_access_token')) {
                 throw new \RuntimeException('Invalid client or invalid registration access token.');
             }
             $values = [];
             $token = $this->bearerToken->findToken($request, $values);
             if (null === $token) {
                 throw new \RuntimeException('Invalid client or invalid registration access token.');

175) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/ClientConfigurationEndpoint/ClientConfigurationEndpoint.php:106    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.e763b5d126525b1b6ce02a24cd42d7d9.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             $token = $this->bearerToken->findToken($request, $values);
-            if (null === $token) {
+            if (null !== $token) {
                 throw new \RuntimeException('Invalid client or invalid registration access token.');
             }
             if (!hash_equals($client->get('registration_access_token'), $token)) {
                 throw new \InvalidArgumentException('Invalid client or invalid registration access token.');
             }
         } catch (\InvalidArgumentException $e) {

176) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/ClientConfigurationEndpoint/ClientConfigurationEndpoint.php:109    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.dc11039bae58f2e5d42654db03d110eb.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             }
-            if (!hash_equals($client->get('registration_access_token'), $token)) {
+            if (hash_equals($client->get('registration_access_token'), $token)) {
                 throw new \InvalidArgumentException('Invalid client or invalid registration access token.');
             }
         } catch (\InvalidArgumentException $e) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, $e->getMessage(), [], $e);
         }
     }

177) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/ClientConfigurationEndpoint/ClientConfigurationGetEndpoint.php:46    [M] BitwiseOr
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.6256012a1532fdca6228516457f0b24c.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $response = $this->responseFactory->createResponse();
-        $response->getBody()->write(json_encode($client->all(), JSON_UNESCAPED_UNICODE | JSON_UNESCAPED_SLASHES));
+        $response->getBody()->write(json_encode($client->all(), JSON_UNESCAPED_UNICODE & JSON_UNESCAPED_SLASHES));
         $headers = ['Content-Type' => 'application/json; charset=UTF-8', 'Cache-Control' => 'no-cache, no-store, max-age=0, must-revalidate, private', 'Pragma' => 'no-cache'];
         foreach ($headers as $k => $v) {
             $response = $response->withHeader($k, $v);
         }
         return $response;
     }

178) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/ClientConfigurationEndpoint/ClientConfigurationGetEndpoint.php:48    [M] Foreach_
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.89ccb0fad7e8f6e1ae1dda71670cc0b2.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $headers = ['Content-Type' => 'application/json; charset=UTF-8', 'Cache-Control' => 'no-cache, no-store, max-age=0, must-revalidate, private', 'Pragma' => 'no-cache'];
-        foreach ($headers as $k => $v) {
+        foreach (array() as $k => $v) {
             $response = $response->withHeader($k, $v);
         }
         return $response;
     }
 }

188) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/ClientCredentialsGrant/ClientCredentialsGrantType.php:89    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.5357052e1537fc244dcf248ee65fd123.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function isRefreshTokenIssuedWithAccessToken()
+    protected function isRefreshTokenIssuedWithAccessToken()
     {
         return $this->issueRefreshTokenWithAccessToken;
     }
 }

189) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/ClientRegistrationEndpoint/ClientRegistrationEndpoint.php:80    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.2e65a722e99cd39268e89ea9dc9296e6.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             $client = $this->clientRepository->find($clientId);
-            if (null === $client) {
+            if (null !== $client) {
                 throw new \Exception('Unable to create or retrieve the client.');
             }
             return $this->createResponse($client);
         } catch (\Exception $e) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, $e->getMessage(), [], $e);
         }

190) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/ClientRegistrationEndpoint/ClientRegistrationEndpoint.php:64    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.4e33dc3bb0e7ea2239f75e18e741f800.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function process(ServerRequestInterface $request, RequestHandlerInterface $handler = null) : ResponseInterface
+    protected function process(ServerRequestInterface $request, RequestHandlerInterface $handler = null) : ResponseInterface
     {
         $this->checkRequest($request);
         $initialAccessToken = $request->getAttribute('initial_access_token');
         try {
             if ($initialAccessToken instanceof InitialAccessToken) {
                 $userAccountId = $initialAccessToken->getUserAccountId();

191) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/ClientRegistrationEndpoint/ClientRegistrationEndpoint.php:97    [M] NotIdentical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.21923d0eb8eea9842a062d58402d3eab.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if ('POST' !== $request->getMethod()) {
+        if ('POST' === $request->getMethod()) {
             throw new OAuth2Exception(405, OAuth2Exception::ERROR_INVALID_REQUEST, 'Unsupported method.');
         }
     }
     /**
      * @param Client $client
      *

192) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/ClientRegistrationEndpoint/ClientRegistrationEndpoint.php:110    [M] Foreach_
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.6357ea755662770dc4ddb7a700a4dc38.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $response = $this->responseFactory->createResponse(201);
-        foreach (['Content-Type' => 'application/json', 'Cache-Control' => 'no-store', 'Pragma' => 'no-cache'] as $k => $v) {
+        foreach (array() as $k => $v) {
             $response = $response->withHeader($k, $v);
         }
         $response->getBody()->write(json_encode($client->all(), JSON_UNESCAPED_UNICODE | JSON_UNESCAPED_SLASHES));
         return $response;
     }
 }

193) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/ClientRegistrationEndpoint/ClientRegistrationEndpoint.php:113    [M] BitwiseOr
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.0192ab7a640c0c307d0dfb39058a4009.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        $response->getBody()->write(json_encode($client->all(), JSON_UNESCAPED_UNICODE | JSON_UNESCAPED_SLASHES));
+        $response->getBody()->write(json_encode($client->all(), JSON_UNESCAPED_UNICODE & JSON_UNESCAPED_SLASHES));
         return $response;
     }
 }

194) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/ClientRegistrationEndpoint/Command/CreateInitialAccessTokenCommand.php:43    [M] ProtectedVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.9d750e00a84c216191135cfed939a4fe.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    protected function __construct(InitialAccessTokenId $initialAccessTokenId, ?UserAccountId $userAccountId, ?\DateTimeImmutable $expiresAt)
+    private function __construct(InitialAccessTokenId $initialAccessTokenId, ?UserAccountId $userAccountId, ?\DateTimeImmutable $expiresAt)
     {
         $this->initialAccessTokenId = $initialAccessTokenId;
         $this->userAccountId = $userAccountId;
         $this->expiresAt = $expiresAt;
     }
     /**

195) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/ClientRegistrationEndpoint/Command/CreateInitialAccessTokenCommand.php:57    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.a36cd20b036fab527462ae4586f95663.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public static function create(InitialAccessTokenId $initialAccessTokenId, ?UserAccountId $userAccountId, ?\DateTimeImmutable $expiresAt) : self
+    protected static function create(InitialAccessTokenId $initialAccessTokenId, ?UserAccountId $userAccountId, ?\DateTimeImmutable $expiresAt) : self
     {
         return new self($initialAccessTokenId, $userAccountId, $expiresAt);
     }
     /**
      * @return InitialAccessTokenId
      */

196) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/ClientRegistrationEndpoint/Command/CreateInitialAccessTokenCommand.php:65    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.bf3ea7f76169e6beff1ffb5192d04632.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getInitialAccessTokenId() : InitialAccessTokenId
+    protected function getInitialAccessTokenId() : InitialAccessTokenId
     {
         return $this->initialAccessTokenId;
     }
     /**
      * @return null|UserAccountId
      */
