197) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/ClientRegistrationEndpoint/Command/CreateInitialAccessTokenCommand.php:73    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.13a433faf9632171a75b232ace2b8177.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getUserAccountId() : ?UserAccountId
+    protected function getUserAccountId() : ?UserAccountId
     {
         return $this->userAccountId;
     }
     /**
      * @return null|\DateTimeImmutable
      */

198) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/ClientRegistrationEndpoint/Command/CreateInitialAccessTokenCommand.php:81    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.03e6580197186c908354fb6045dd2a97.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getExpiresAt() : ?\DateTimeImmutable
+    protected function getExpiresAt() : ?\DateTimeImmutable
     {
         return $this->expiresAt;
     }
 }

199) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/ClientRegistrationEndpoint/Command/CreateInitialAccessTokenCommandHandler.php:39    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.8e1d6f6ee31033789dcee06e63ff2cf0.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function handle(CreateInitialAccessTokenCommand $command)
+    protected function handle(CreateInitialAccessTokenCommand $command)
     {
         $initialAccessToken = InitialAccessToken::createEmpty();
         $initialAccessToken = $initialAccessToken->create($command->getInitialAccessTokenId(), $command->getUserAccountId(), $command->getExpiresAt());
         $this->initialAccessTokenManager->save($initialAccessToken);
     }
 }

200) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/ClientRegistrationEndpoint/Command/RevokeInitialAccessTokenCommand.php:30    [M] ProtectedVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.c68ea4be716fbfd6de0785466aa59f23.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    protected function __construct(InitialAccessTokenId $initialAccessTokenId)
+    private function __construct(InitialAccessTokenId $initialAccessTokenId)
     {
         $this->initialAccessTokenId = $initialAccessTokenId;
     }
     /**
      * @param InitialAccessTokenId $initialAccessTokenId
      *

201) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/ClientRegistrationEndpoint/Command/RevokeInitialAccessTokenCommand.php:40    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.1b50436de48da90c70c76e5fe9cb7a2c.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public static function create(InitialAccessTokenId $initialAccessTokenId) : self
+    protected static function create(InitialAccessTokenId $initialAccessTokenId) : self
     {
         return new self($initialAccessTokenId);
     }
     /**
      * @return InitialAccessTokenId
      */

203) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/ClientRegistrationEndpoint/Command/RevokeInitialAccessTokenCommandHandler.php:42    [M] NotIdentical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.ded1d177478dfa5603d80db8ad8498ea.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $accessToken = $this->initialAccessTokenRepository->find($accessTokenId);
-        if (null !== $accessToken) {
+        if (null === $accessToken) {
             $accessToken = $accessToken->markAsRevoked();
             $this->initialAccessTokenRepository->save($accessToken);
         }
     }
 }

204) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/ClientRegistrationEndpoint/Command/RevokeInitialAccessTokenCommandHandler.php:38    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.3346350f5df234f5f032feeb34777e01.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function handle(RevokeInitialAccessTokenCommand $command)
+    protected function handle(RevokeInitialAccessTokenCommand $command)
     {
         $accessTokenId = $command->getInitialAccessTokenId();
         $accessToken = $this->initialAccessTokenRepository->find($accessTokenId);
         if (null !== $accessToken) {
             $accessToken = $accessToken->markAsRevoked();
             $this->initialAccessTokenRepository->save($accessToken);

205) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/ClientRegistrationEndpoint/Event/InitialAccessTokenCreatedEvent.php:49    [M] ProtectedVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.b56b6fa31a44bc1567614163469eee29.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    protected function __construct(InitialAccessTokenId $initialAccessTokenId, UserAccountId $userAccountId, ?\DateTimeImmutable $expiresAt, ?\DateTimeImmutable $recordedOn, ?EventId $eventId)
+    private function __construct(InitialAccessTokenId $initialAccessTokenId, UserAccountId $userAccountId, ?\DateTimeImmutable $expiresAt, ?\DateTimeImmutable $recordedOn, ?EventId $eventId)
     {
         parent::__construct($recordedOn, $eventId);
         $this->initialAccessTokenId = $initialAccessTokenId;
         $this->expiresAt = $expiresAt;
         $this->userAccountId = $userAccountId;
     }

206) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/ClientRegistrationEndpoint/Event/InitialAccessTokenCreatedEvent.php:72    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.e0d94689ed1289f75a11ce86d0f3f7e3.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public static function create(InitialAccessTokenId $initialAccessTokenId, UserAccountId $userAccountId, ?\DateTimeImmutable $expiresAt) : self
+    protected static function create(InitialAccessTokenId $initialAccessTokenId, UserAccountId $userAccountId, ?\DateTimeImmutable $expiresAt) : self
     {
         return new self($initialAccessTokenId, $userAccountId, $expiresAt, null, null);
     }
     /**
      * @return InitialAccessTokenId
      */

210) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/ClientRegistrationEndpoint/Event/InitialAccessTokenCreatedEvent.php:129    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.3385166200d326204a72c8ede92a482a.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $recordedOn = \DateTimeImmutable::createFromFormat('U', (string) $json->recorded_on);
-        $userAccountId = null === $json->payload->user_account_id ? null : UserAccountId::create($json->payload->user_account_id);
+        $userAccountId = null !== $json->payload->user_account_id ? null : UserAccountId::create($json->payload->user_account_id);
         $expiresAt = null === $json->payload->expires_at ? null : \DateTimeImmutable::createFromFormat('U', (string) $json->payload->expires_at);
         return new self($initialAccessTokenId, $userAccountId, $expiresAt, $recordedOn, $eventId);
     }
 }

211) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/ClientRegistrationEndpoint/Event/InitialAccessTokenCreatedEvent.php:130    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.bed9b3eeca8dd584ea81b6895a3c8860.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $userAccountId = null === $json->payload->user_account_id ? null : UserAccountId::create($json->payload->user_account_id);
-        $expiresAt = null === $json->payload->expires_at ? null : \DateTimeImmutable::createFromFormat('U', (string) $json->payload->expires_at);
+        $expiresAt = null !== $json->payload->expires_at ? null : \DateTimeImmutable::createFromFormat('U', (string) $json->payload->expires_at);
         return new self($initialAccessTokenId, $userAccountId, $expiresAt, $recordedOn, $eventId);
     }
 }

213) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/ClientRegistrationEndpoint/Event/InitialAccessTokenRevokedEvent.php:36    [M] ProtectedVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.8f7068f0219541a9673b0d33f7c5e275.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    protected function __construct(InitialAccessTokenId $initialAccessTokenId, ?\DateTimeImmutable $recordedOn, ?EventId $eventId)
+    private function __construct(InitialAccessTokenId $initialAccessTokenId, ?\DateTimeImmutable $recordedOn, ?EventId $eventId)
     {
         parent::__construct($recordedOn, $eventId);
         $this->initialAccessTokenId = $initialAccessTokenId;
     }
     /**
      * {@inheritdoc}

219) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/ClientRegistrationEndpoint/InitialAccessToken.php:62    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.d53f0b0d3457dbdba3cee453fa831aeb.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function create(InitialAccessTokenId $initialAccessTokenId, UserAccountId $userAccountId, ?\DateTimeImmutable $expiresAt) : self
+    protected function create(InitialAccessTokenId $initialAccessTokenId, UserAccountId $userAccountId, ?\DateTimeImmutable $expiresAt) : self
     {
         $clone = clone $this;
         $clone->initialAccessTokenId = $initialAccessTokenId;
         $clone->expiresAt = $expiresAt;
         $clone->userAccountId = $userAccountId;
         $event = InitialAccessTokenEvent\InitialAccessTokenCreatedEvent::create($initialAccessTokenId, $userAccountId, $expiresAt);

220) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/ClientRegistrationEndpoint/InitialAccessToken.php:80    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.77becdfe8a4fce60fd34b2c725c594a9.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (null === $this->initialAccessTokenId) {
+        if (null !== $this->initialAccessTokenId) {
             throw new \LogicException('Initial Access Token not initialized.');
         }
         return $this->initialAccessTokenId;
     }
     /**
      * @return UserAccountId

221) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/ClientRegistrationEndpoint/InitialAccessToken.php:78    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.7fcb9f676ae8af44ff9d51ec14800ba4.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getTokenId() : InitialAccessTokenId
+    protected function getTokenId() : InitialAccessTokenId
     {
         if (null === $this->initialAccessTokenId) {
             throw new \LogicException('Initial Access Token not initialized.');
         }
         return $this->initialAccessTokenId;
     }

222) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/ClientRegistrationEndpoint/InitialAccessToken.php:92    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.2ed6701899aa778ee4d691ffa22102b2.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (null === $this->userAccountId) {
+        if (null !== $this->userAccountId) {
             throw new \LogicException('Initial Access Token not initialized.');
         }
         return $this->userAccountId;
     }
     /**
      * @return \DateTimeImmutable|null

225) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/ClientRegistrationEndpoint/InitialAccessToken.php:118    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.fd97fee596457aa1f7f3207d4226ac98.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function isRevoked() : bool
+    protected function isRevoked() : bool
     {
         return $this->revoked;
     }
     /**
      * @return InitialAccessToken
      */

232) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/ClientRegistrationEndpoint/InitialAccessToken.php:191    [M] NotIdentical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.005b1844700631c5df9a940409a6347e.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        if (null !== $this->initialAccessTokenId && $this->initialAccessTokenId->getValue() !== $event->getDomainId()->getValue()) {
+        if (null === $this->initialAccessTokenId && $this->initialAccessTokenId->getValue() !== $event->getDomainId()->getValue()) {
             throw new \InvalidArgumentException('Event not applicable for this initial access token.');
         }
         $method = $map[$event->getType()];
         return $this->{$method}($event);
     }
     /**

233) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/ClientRegistrationEndpoint/InitialAccessToken.php:191    [M] NotIdentical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.36ce3c8ae6f0b8e0e80995c64d6f0837.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        if (null !== $this->initialAccessTokenId && $this->initialAccessTokenId->getValue() !== $event->getDomainId()->getValue()) {
+        if (null !== $this->initialAccessTokenId && $this->initialAccessTokenId->getValue() === $event->getDomainId()->getValue()) {
             throw new \InvalidArgumentException('Event not applicable for this initial access token.');
         }
         $method = $map[$event->getType()];
         return $this->{$method}($event);
     }
     /**

234) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/ClientRegistrationEndpoint/InitialAccessToken.php:191    [M] LogicalAnd
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.67cdc323b81183f5e3ece94ae2d5352b.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        if (null !== $this->initialAccessTokenId && $this->initialAccessTokenId->getValue() !== $event->getDomainId()->getValue()) {
+        if (null !== $this->initialAccessTokenId || $this->initialAccessTokenId->getValue() !== $event->getDomainId()->getValue()) {
             throw new \InvalidArgumentException('Event not applicable for this initial access token.');
         }
         $method = $map[$event->getType()];
         return $this->{$method}($event);
     }
     /**

236) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/ClientRegistrationEndpoint/InitialAccessToken.php:215    [M] ProtectedVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.f45e2c51c5e5000e55d53f6961204c09.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    protected function applyInitialAccessTokenCreatedEvent(InitialAccessTokenEvent\InitialAccessTokenCreatedEvent $event) : self
+    private function applyInitialAccessTokenCreatedEvent(InitialAccessTokenEvent\InitialAccessTokenCreatedEvent $event) : self
     {
         $clone = clone $this;
         $clone->initialAccessTokenId = $event->getInitialAccessTokenId();
         $clone->expiresAt = $event->getExpiresAt();
         $clone->userAccountId = $event->getUserAccountId();
         return $clone;

238) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/ClientRegistrationEndpoint/InitialAccessToken.php:230    [M] ProtectedVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.5bb3cf87065cd3e7983fc93e4fdaa1be.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    protected function applyInitialAccessTokenRevokedEvent(InitialAccessTokenEvent\InitialAccessTokenRevokedEvent $event) : self
+    private function applyInitialAccessTokenRevokedEvent(InitialAccessTokenEvent\InitialAccessTokenRevokedEvent $event) : self
     {
         $clone = clone $this;
         $clone->revoked = true;
         return $clone;
     }
 }

242) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/AccessToken/AccessToken.php:61    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.ecf2277360a036f9c4968c4509b46141.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function create(AccessTokenId $accessTokenId, ResourceOwnerId $resourceOwnerId, ClientId $clientId, DataBag $parameters, DataBag $metadatas, array $scopes, \DateTimeImmutable $expiresAt, ?ResourceServerId $resourceServerId)
+    protected function create(AccessTokenId $accessTokenId, ResourceOwnerId $resourceOwnerId, ClientId $clientId, DataBag $parameters, DataBag $metadatas, array $scopes, \DateTimeImmutable $expiresAt, ?ResourceServerId $resourceServerId)
     {
         $clone = clone $this;
         $clone->accessTokenId = $accessTokenId;
         $clone->resourceOwnerId = $resourceOwnerId;
         $clone->clientId = $clientId;
         $clone->parameters = $parameters;

243) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/AccessToken/AccessToken.php:84    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.eba9a9132875ba20c01ef23b9eebcc0a.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (null === $this->accessTokenId) {
+        if (null !== $this->accessTokenId) {
             throw new \RuntimeException('Access token not initialized.');
         }
         return $this->accessTokenId;
     }
     /**
      * @return AccessToken

247) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/AccessToken/AccessToken.php:109    [M] Plus
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.a837562878a8c355884900e00f7e7ae5.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        $data = parent::jsonSerialize() + ['access_token_id' => $this->getTokenId()->getValue()];
+        $data = parent::jsonSerialize() - ['access_token_id' => $this->getTokenId()->getValue()];
         return $data;
     }
     /**
      * {@inheritdoc}
      */
     public static function createFromJson(\stdClass $json) : DomainObject

249) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/AccessToken/AccessToken.php:122    [M] NotIdentical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.bf9d878f3b2c69e28a59d6306982c8d0.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $accessTokenId = AccessTokenId::create($json->access_token_id);
-        $resourceServerId = null !== $json->resource_server_id ? ResourceServerId::create($json->resource_server_id) : null;
+        $resourceServerId = null === $json->resource_server_id ? ResourceServerId::create($json->resource_server_id) : null;
         $expiresAt = \DateTimeImmutable::createFromFormat('U', (string) $json->expires_at);
         $clientId = ClientId::create($json->client_id);
         $parameters = DataBag::create((array) $json->parameters);
         $metadatas = DataBag::create((array) $json->metadatas);
         $scopes = (array) $json->scopes;
         $revoked = $json->is_revoked;

250) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/AccessToken/AccessToken.php:131    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.2f6d4dca43369b4b37300f48512a4d32.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $resourceOwnerClass = $json->resource_owner_class;
-        if (!method_exists($resourceOwnerClass, 'create')) {
+        if (method_exists($resourceOwnerClass, 'create')) {
             throw new \InvalidArgumentException('Invalid resource owner.');
         }
         $resourceOwnerId = $resourceOwnerClass::create($json->resource_owner_id);
         $accessToken = new self();
         $accessToken->accessTokenId = $accessTokenId;
         $accessToken->resourceServerId = $resourceServerId;

252) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/AccessToken/AccessToken.php:159    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.1f2bcd34b5124198db15dccb88e1dd44.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $data['expires_in'] = $this->getExpiresIn();
-        if (!empty($this->getScopes())) {
+        if (empty($this->getScopes())) {
             $data['scope'] = implode(' ', $this->getScopes());
         }
         return $data;
     }
     /**
      * @param Event $event

253) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/AccessToken/AccessToken.php:154    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.d67e83748790e61b66710b50d7439232.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getResponseData() : array
+    protected function getResponseData() : array
     {
         $data = $this->getParameters()->all();
         $data['access_token'] = $this->getTokenId()->getValue();
         $data['expires_in'] = $this->getExpiresIn();
         if (!empty($this->getScopes())) {
             $data['scope'] = implode(' ', $this->getScopes());

255) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/AccessToken/AccessToken.php:177    [M] NotIdentical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.72fd29d7d9d8ed06da9791ce0646ce05.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        if (null !== $this->clientId && $this->accessTokenId->getValue() !== $event->getDomainId()->getValue()) {
+        if (null === $this->clientId && $this->accessTokenId->getValue() !== $event->getDomainId()->getValue()) {
             throw new \InvalidArgumentException('Event not applicable for this access token.');
         }
         $method = $map[$event->getType()];
         return $this->{$method}($event);
     }
     /**

256) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/AccessToken/AccessToken.php:177    [M] NotIdentical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.0315b056a87de707b0751db5ed629b6b.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        if (null !== $this->clientId && $this->accessTokenId->getValue() !== $event->getDomainId()->getValue()) {
+        if (null !== $this->clientId && $this->accessTokenId->getValue() === $event->getDomainId()->getValue()) {
             throw new \InvalidArgumentException('Event not applicable for this access token.');
         }
         $method = $map[$event->getType()];
         return $this->{$method}($event);
     }
     /**

257) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/AccessToken/AccessToken.php:177    [M] LogicalAnd
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.3f6bdc4823fd4db612316388cf96324a.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        if (null !== $this->clientId && $this->accessTokenId->getValue() !== $event->getDomainId()->getValue()) {
+        if (null !== $this->clientId || $this->accessTokenId->getValue() !== $event->getDomainId()->getValue()) {
             throw new \InvalidArgumentException('Event not applicable for this access token.');
         }
         $method = $map[$event->getType()];
         return $this->{$method}($event);
     }
     /**

259) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/AccessToken/AccessToken.php:201    [M] ProtectedVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.a22a8d61070772f8a3ddc7c5d0d12d3b.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    protected function applyAccessTokenCreatedEvent(AccessTokenEvent\AccessTokenCreatedEvent $event) : self
+    private function applyAccessTokenCreatedEvent(AccessTokenEvent\AccessTokenCreatedEvent $event) : self
     {
         $clone = clone $this;
         $clone->accessTokenId = $event->getAccessTokenId();
         $clone->resourceOwnerId = $event->getResourceOwnerId();
         $clone->clientId = $event->getClientId();
         $clone->parameters = $event->getParameters();

261) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/AccessToken/AccessToken.php:219    [M] ProtectedVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.30768c6cf1f5c3a7a1b0d2efcf4a0f8d.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    protected function applyAccessTokenRevokedEvent() : self
+    private function applyAccessTokenRevokedEvent() : self
     {
         $clone = clone $this;
         $clone->revoked = true;
         return $clone;
     }
 }

262) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/AccessToken/AccessTokenHandlerManager.php:28    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.2c522729479140b10741ae6962ccb5dc.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function add(AccessTokenHandler $accessTokenHandler) : self
+    protected function add(AccessTokenHandler $accessTokenHandler) : self
     {
         $this->accessTokenHandlers[] = $accessTokenHandler;
         return $this;
     }
     /**
      * @param AccessTokenId $token
