263) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/AccessToken/AccessTokenHandlerManager.php:44    [M] NotIdentical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.991846c6cc1c267e99650e4e27837131.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             $accessToken = $accessTokenHandler->find($token);
-            if (null !== $accessToken) {
+            if (null === $accessToken) {
                 return $accessToken;
             }
         }
         return null;
     }
 }

264) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/AccessToken/AccessTokenHandlerManager.php:42    [M] Foreach_
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.6c4f33620b42b585f7c63c3022e6994c.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        foreach ($this->accessTokenHandlers as $accessTokenHandler) {
+        foreach (array() as $accessTokenHandler) {
             $accessToken = $accessTokenHandler->find($token);
             if (null !== $accessToken) {
                 return $accessToken;
             }
         }
         return null;

265) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/AccessToken/AccessTokenHandlerManager.php:40    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.1a013b0aa1baa135445e0b07c7ec98ee.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function find(AccessTokenId $token) : ?AccessToken
+    protected function find(AccessTokenId $token) : ?AccessToken
     {
         foreach ($this->accessTokenHandlers as $accessTokenHandler) {
             $accessToken = $accessTokenHandler->find($token);
             if (null !== $accessToken) {
                 return $accessToken;
             }

269) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/AccessToken/AccessTokenTypeHint.php:60    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.e6899b6f2f6abe2f14aa474f3e861335.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (!$token instanceof AccessToken || true === $token->isRevoked()) {
+        if ($token instanceof AccessToken || true === $token->isRevoked()) {
             return;
         }
         $token = $token->markAsRevoked();
         $this->accessTokenRepository->save($token);
     }
     /**

270) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/AccessToken/AccessTokenTypeHint.php:60    [M] TrueValue
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.b50cf9c6365fb966a89bad3fa96eb7b7.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (!$token instanceof AccessToken || true === $token->isRevoked()) {
+        if (!$token instanceof AccessToken || false === $token->isRevoked()) {
             return;
         }
         $token = $token->markAsRevoked();
         $this->accessTokenRepository->save($token);
     }
     /**

271) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/AccessToken/AccessTokenTypeHint.php:60    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.04e88499d282345a9afa3143d5ea9ee8.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (!$token instanceof AccessToken || true === $token->isRevoked()) {
+        if (!$token instanceof AccessToken || true !== $token->isRevoked()) {
             return;
         }
         $token = $token->markAsRevoked();
         $this->accessTokenRepository->save($token);
     }
     /**

272) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/AccessToken/AccessTokenTypeHint.php:60    [M] LogicalOr
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.5aa891ce5c6aa3bdae7c36433158d62d.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (!$token instanceof AccessToken || true === $token->isRevoked()) {
+        if (!$token instanceof AccessToken && true === $token->isRevoked()) {
             return;
         }
         $token = $token->markAsRevoked();
         $this->accessTokenRepository->save($token);
     }
     /**

278) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/AccessToken/AccessTokenTypeHint.php:79    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.75459e96ce4b87b5080b83a8094b69d6.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        $values = ['active' => !$token->hasExpired(), 'client_id' => $token->getClientId(), 'resource_owner' => $token->getResourceOwnerId(), 'expires_in' => $token->getExpiresIn()];
+        $values = ['active' => $token->hasExpired(), 'client_id' => $token->getClientId(), 'resource_owner' => $token->getResourceOwnerId(), 'expires_in' => $token->getExpiresIn()];
         if (!empty($token->getScopes())) {
             $values['scope'] = implode(' ', $token->getScopes());
         }
         return $values + $token->getParameters()->all();
     }
 }

279) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/AccessToken/AccessTokenTypeHint.php:84    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.a7be1c60028f96be5a31cdbd01fd13dc.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $values = ['active' => !$token->hasExpired(), 'client_id' => $token->getClientId(), 'resource_owner' => $token->getResourceOwnerId(), 'expires_in' => $token->getExpiresIn()];
-        if (!empty($token->getScopes())) {
+        if (empty($token->getScopes())) {
             $values['scope'] = implode(' ', $token->getScopes());
         }
         return $values + $token->getParameters()->all();
     }
 }

280) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/AccessToken/AccessTokenTypeHint.php:88    [M] Plus
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.66c797eb4889aaa8853d99addb452849.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        return $values + $token->getParameters()->all();
+        return $values - $token->getParameters()->all();
     }
 }

282) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/AccessToken/Command/CreateAccessTokenCommand.php:76    [M] ProtectedVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.2345628e5eca17d3123b4177daddbd26.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    protected function __construct(AccessTokenId $accessTokenId, ClientId $clientId, UserAccountId $userAccountId, \DateTimeImmutable $expiresAt, DataBag $parameters, DataBag $metadatas, array $scopes, ?ResourceServerId $resourceServerId)
+    private function __construct(AccessTokenId $accessTokenId, ClientId $clientId, UserAccountId $userAccountId, \DateTimeImmutable $expiresAt, DataBag $parameters, DataBag $metadatas, array $scopes, ?ResourceServerId $resourceServerId)
     {
         $this->accessTokenId = $accessTokenId;
         $this->clientId = $clientId;
         $this->userAccountId = $userAccountId;
         $this->expiresAt = $expiresAt;
         $this->parameters = $parameters;

283) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/AccessToken/Command/CreateAccessTokenCommand.php:100    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.364b9eb19827aa904ce46e7c35842265.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public static function create(AccessTokenId $accessTokenId, ClientId $clientId, UserAccountId $userAccountId, \DateTimeImmutable $expiresAt, DataBag $parameters, DataBag $metadatas, array $scopes, ?ResourceServerId $resourceServerId) : self
+    protected static function create(AccessTokenId $accessTokenId, ClientId $clientId, UserAccountId $userAccountId, \DateTimeImmutable $expiresAt, DataBag $parameters, DataBag $metadatas, array $scopes, ?ResourceServerId $resourceServerId) : self
     {
         return new self($accessTokenId, $clientId, $userAccountId, $expiresAt, $parameters, $metadatas, $scopes, $resourceServerId);
     }
     /**
      * @return ClientId
      */

290) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/AccessToken/Command/CreateAccessTokenCommand.php:156    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.8ecc0adf459d465dfefd579e41264ab2.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getAccessTokenId() : AccessTokenId
+    protected function getAccessTokenId() : AccessTokenId
     {
         return $this->accessTokenId;
     }
     /**
      * @return \DateTimeImmutable
      */

292) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/AccessToken/Command/CreateAccessTokenCommandHandler.php:42    [M] NotIdentical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.fee68cb087702d2d209a980deee859ea.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $accessToken = $this->accessTokenRepository->find($command->getAccessTokenId());
-        if (null !== $accessToken) {
+        if (null === $accessToken) {
             throw new \InvalidArgumentException(sprintf('The access token with ID "%s" already exists.', $command->getAccessTokenId()->getValue()));
         }
         $accessToken = AccessToken::createEmpty();
         $accessToken = $accessToken->create($command->getAccessTokenId(), $command->getUserAccountId(), $command->getClientId(), $command->getParameters(), $command->getMetadatas(), $command->getScopes(), $command->getExpiresAt(), $command->getResourceServerId());
         $this->accessTokenRepository->save($accessToken);
     }

293) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/AccessToken/Command/CreateAccessTokenCommandHandler.php:39    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.bac46bfce8984b16bbbd15c4350fcf7b.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function handle(CreateAccessTokenCommand $command)
+    protected function handle(CreateAccessTokenCommand $command)
     {
         $accessToken = $this->accessTokenRepository->find($command->getAccessTokenId());
         if (null !== $accessToken) {
             throw new \InvalidArgumentException(sprintf('The access token with ID "%s" already exists.', $command->getAccessTokenId()->getValue()));
         }
         $accessToken = AccessToken::createEmpty();

294) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/AccessToken/Command/RevokeAccessTokenCommand.php:30    [M] ProtectedVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.f73e904d64e372ca64c5205540ed3bec.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    protected function __construct(AccessTokenId $accessTokenId)
+    private function __construct(AccessTokenId $accessTokenId)
     {
         $this->accessTokenId = $accessTokenId;
     }
     /**
      * @param AccessTokenId $accessTokenId
      *

295) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/AccessToken/Command/RevokeAccessTokenCommand.php:40    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.4dc4b4f1e04f7fb149986ce65a917965.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public static function create(AccessTokenId $accessTokenId) : self
+    protected static function create(AccessTokenId $accessTokenId) : self
     {
         return new self($accessTokenId);
     }
     /**
      * @return AccessTokenId
      */

297) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/AccessToken/Command/RevokeAccessTokenCommandHandler.php:42    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.ada19e52fb32640a63915bae53081f3a.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $accessToken = $this->accessTokenRepository->find($accessTokenId);
-        if (null === $accessToken) {
+        if (null !== $accessToken) {
             throw new \InvalidArgumentException(sprintf('Unable to find the access token with ID "%s".', $command->getAccessTokenId()->getValue()));
         }
         $accessToken = $accessToken->markAsRevoked();
         $this->accessTokenRepository->save($accessToken);
     }
 }

298) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/AccessToken/Command/RevokeAccessTokenCommandHandler.php:38    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.8db712f3b35fc5e4eef5dc7de45253a8.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function handle(RevokeAccessTokenCommand $command)
+    protected function handle(RevokeAccessTokenCommand $command)
     {
         $accessTokenId = $command->getAccessTokenId();
         $accessToken = $this->accessTokenRepository->find($accessTokenId);
         if (null === $accessToken) {
             throw new \InvalidArgumentException(sprintf('Unable to find the access token with ID "%s".', $command->getAccessTokenId()->getValue()));
         }

299) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/AccessToken/Event/AccessTokenCreatedEvent.php:82    [M] ProtectedVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.a118a57820b9776b3120b1b0158d002f.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    protected function __construct(AccessTokenId $accessTokenId, ResourceOwnerId $resourceOwnerId, ClientId $clientId, DataBag $parameters, DataBag $metadatas, array $scopes, \DateTimeImmutable $expiresAt, ?ResourceServerId $resourceServerId, ?\DateTimeImmutable $recordedOn, ?EventId $eventId)
+    private function __construct(AccessTokenId $accessTokenId, ResourceOwnerId $resourceOwnerId, ClientId $clientId, DataBag $parameters, DataBag $metadatas, array $scopes, \DateTimeImmutable $expiresAt, ?ResourceServerId $resourceServerId, ?\DateTimeImmutable $recordedOn, ?EventId $eventId)
     {
         parent::__construct($recordedOn, $eventId);
         $this->accessTokenId = $accessTokenId;
         $this->resourceOwnerId = $resourceOwnerId;
         $this->clientId = $clientId;
         $this->parameters = $parameters;

300) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/AccessToken/Event/AccessTokenCreatedEvent.php:115    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.ecfb9dd65e32de5c168a5529f2898cad.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public static function create(AccessTokenId $accessTokenId, ResourceOwnerId $resourceOwnerId, ClientId $clientId, DataBag $parameters, DataBag $metadatas, array $scopes, \DateTimeImmutable $expiresAt, ?ResourceServerId $resourceServerId) : self
+    protected static function create(AccessTokenId $accessTokenId, ResourceOwnerId $resourceOwnerId, ClientId $clientId, DataBag $parameters, DataBag $metadatas, array $scopes, \DateTimeImmutable $expiresAt, ?ResourceServerId $resourceServerId) : self
     {
         return new self($accessTokenId, $resourceOwnerId, $clientId, $parameters, $metadatas, $scopes, $expiresAt, $resourceServerId, null, null);
     }
     /**
      * {@inheritdoc}
      */

304) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/AccessToken/Event/AccessTokenCreatedEvent.php:159    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.29663b5fbdf7d314842aa8a7be894cdb.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getResourceOwnerId() : ResourceOwnerId
+    protected function getResourceOwnerId() : ResourceOwnerId
     {
         return $this->resourceOwnerId;
     }
     /**
      * @return ClientId
      */

310) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/AccessToken/Event/AccessTokenRevokedEvent.php:36    [M] ProtectedVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.8c482d53ae28c5a951710612197a0a82.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    protected function __construct(AccessTokenId $accessTokenId, ?\DateTimeImmutable $recordedOn, ?EventId $eventId)
+    private function __construct(AccessTokenId $accessTokenId, ?\DateTimeImmutable $recordedOn, ?EventId $eventId)
     {
         parent::__construct($recordedOn, $eventId);
         $this->accessTokenId = $accessTokenId;
     }
     /**
      * {@inheritdoc}

317) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Client.php:90    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.92d782e7a4eb505dd5a0c9cbb3e08d50.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function create(ClientId $clientId, DataBag $parameters, ?UserAccountId $ownerId) : self
+    protected function create(ClientId $clientId, DataBag $parameters, ?UserAccountId $ownerId) : self
     {
         $clone = clone $this;
         $clone->clientId = $clientId;
         $clone->parameters = $parameters;
         $clone->ownerId = $ownerId;
         $event = ClientEvent\ClientCreatedEvent::create($clone->clientId, $parameters, $ownerId);

318) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Client.php:106    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.49bc6a8f1df5238ed7e99d1c8d54e2be.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getOwnerId() : ?UserAccountId
+    protected function getOwnerId() : ?UserAccountId
     {
         return $this->ownerId;
     }
     /**
      * @param UserAccountId $ownerId
      *

319) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Client.php:118    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.365750b6f86c97c654d358aa4ad98fd5.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if ($this->getOwnerId()->getValue() === $ownerId->getValue()) {
+        if ($this->getOwnerId()->getValue() !== $ownerId->getValue()) {
             return $this;
         }
         $clone = clone $this;
         $clone->ownerId = $ownerId;
         $event = ClientEvent\ClientOwnerChangedEvent::create($clone->getPublicId(), $ownerId);
         $clone->record($event);

320) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Client.php:116    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.bcd2a914b8cc8310f26b9137da64ae79.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function withOwnerId(UserAccountId $ownerId) : self
+    protected function withOwnerId(UserAccountId $ownerId) : self
     {
         if ($this->getOwnerId()->getValue() === $ownerId->getValue()) {
             return $this;
         }
         $clone = clone $this;
         $clone->ownerId = $ownerId;

321) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Client.php:135    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.abfcfcf0cf184838dcbc336fb33c72b4.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function withParameters(DataBag $parameters) : self
+    protected function withParameters(DataBag $parameters) : self
     {
         $clone = clone $this;
         $clone->parameters = $parameters;
         $event = ClientEvent\ClientParametersUpdatedEvent::create($clone->getPublicId(), $parameters);
         $clone->record($event);
         return $clone;

322) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Client.php:151    [M] TrueValue
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.bff97bcb116dd6a0700df89bb69ee035.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $clone = clone $this;
-        $clone->deleted = true;
+        $clone->deleted = false;
         $event = ClientEvent\ClientDeletedEvent::create($clone->getPublicId());
         $clone->record($event);
         return $clone;
     }
     /**
      * @return bool

323) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Client.php:148    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.de59833b936ae38ffac1390ebe5da393.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function markAsDeleted() : self
+    protected function markAsDeleted() : self
     {
         $clone = clone $this;
         $clone->deleted = true;
         $event = ClientEvent\ClientDeletedEvent::create($clone->getPublicId());
         $clone->record($event);
         return $clone;

324) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Client.php:161    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.045fa4b67d6ec751a78ad6339c8d37c1.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function isDeleted() : bool
+    protected function isDeleted() : bool
     {
         return $this->deleted;
     }
     /**
      * @param string $grant_type
      *

325) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Client.php:219    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.248a694d1cbf6f4b4d54d1694e097ffa.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        return 'none' === $this->getTokenEndpointAuthenticationMethod();
+        return 'none' !== $this->getTokenEndpointAuthenticationMethod();
     }
     /**
      * @return string
      */
     public function getTokenEndpointAuthenticationMethod() : string
     {

326) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Client.php:217    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.e1d0bd79c5c9f079f3da9cee398cf0c5.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function isPublic() : bool
+    protected function isPublic() : bool
     {
         return 'none' === $this->getTokenEndpointAuthenticationMethod();
     }
     /**
      * @return string
      */

327) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Client.php:225    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.e4a39cbe2eddf6c08a0aea8f3b715daa.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getTokenEndpointAuthenticationMethod() : string
+    protected function getTokenEndpointAuthenticationMethod() : string
     {
         if ($this->has('token_endpoint_auth_method')) {
             return $this->get('token_endpoint_auth_method');
         }
         return 'client_secret_basic';
     }

328) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Client.php:263    [M] LogicalOr
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.a526b64127717346bf0718aed245c697.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        return $this->has('jwks') || $this->has('jwks_uri') || $this->has('client_secret');
+        return $this->has('jwks') && $this->has('jwks_uri') || $this->has('client_secret');
     }
     /**
      * @return JWKSet
      */
     public function getPublicKeySet() : JWKSet
     {

329) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Client.php:263    [M] LogicalOr
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.17d669c73b088a86f3c6d7bab9cf41df.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        return $this->has('jwks') || $this->has('jwks_uri') || $this->has('client_secret');
+        return ($this->has('jwks') || $this->has('jwks_uri')) && $this->has('client_secret');
     }
     /**
      * @return JWKSet
      */
     public function getPublicKeySet() : JWKSet
     {

330) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Client.php:261    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.ccb17a024f0a88fcb854c5e5a15feac5.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function hasPublicKeySet() : bool
+    protected function hasPublicKeySet() : bool
     {
         return $this->has('jwks') || $this->has('jwks_uri') || $this->has('client_secret');
     }
     /**
      * @return JWKSet
      */
