331) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Client.php:271    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.79a0e33d15967dee4c73c5c65cbb5443.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (!$this->hasPublicKeySet()) {
+        if ($this->hasPublicKeySet()) {
             throw new \LogicException('The client has no public key set');
         }
         $jwkset = null;
         if ($this->has('jwks')) {
             $jwkset = JWKSet::createFromJson($this->get('jwks'));
         }

332) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Client.php:269    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.c999eb31ce530ec95b2b08fde98cce4a.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getPublicKeySet() : JWKSet
+    protected function getPublicKeySet() : JWKSet
     {
         if (!$this->hasPublicKeySet()) {
             throw new \LogicException('The client has no public key set');
         }
         $jwkset = null;
         if ($this->has('jwks')) {

333) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Client.php:307    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.4e36e8f3f2d021e2e8a1c3b0c3e8777f.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (null === $this->clientId) {
+        if (null !== $this->clientId) {
             throw new \RuntimeException('Client not initialized.');
         }
         return $this->clientId;
     }
     /**
      * {@inheritdoc}

334) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Client.php:305    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.890b166d149b0e6be1481c06afed4e77.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getPublicId() : ResourceOwnerId
+    protected function getPublicId() : ResourceOwnerId
     {
         if (null === $this->clientId) {
             throw new \RuntimeException('Client not initialized.');
         }
         return $this->clientId;
     }

335) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Client.php:317    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.243cdcc8386bda369b2194b2476d57b5.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function has(string $key) : bool
+    protected function has(string $key) : bool
     {
         return $this->parameters->has($key);
     }
     /**
      * {@inheritdoc}
      */

336) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Client.php:327    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.864bfb056563becf5375c350c3162dc4.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (!$this->has($key)) {
+        if ($this->has($key)) {
             throw new \InvalidArgumentException(sprintf('Configuration value with key "%s" does not exist.', $key));
         }
         return $this->parameters->get($key);
     }
     /**
      * @return array

337) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Client.php:325    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.8978c373dd0acc055ffc1a36cab31a16.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function get(string $key)
+    protected function get(string $key)
     {
         if (!$this->has($key)) {
             throw new \InvalidArgumentException(sprintf('Configuration value with key "%s" does not exist.', $key));
         }
         return $this->parameters->get($key);
     }

340) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Client.php:368    [M] NotIdentical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.87483cc14113f3c16d4387f73ba0abd6.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $clientId = ClientId::create($json->client_id);
-        $ownerId = null !== $json->owner_id ? UserAccountId::create($json->owner_id) : null;
+        $ownerId = null === $json->owner_id ? UserAccountId::create($json->owner_id) : null;
         $parameters = DataBag::create((array) $json->parameters);
         $deleted = $json->is_deleted;
         $client = new self();
         $client->clientId = $clientId;
         $client->ownerId = $ownerId;
         $client->parameters = $parameters;

343) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Client.php:392    [M] NotIdentical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.f1b2c4a6a5400f61045f523fb44db081.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        if (null !== $this->clientId && $this->clientId->getValue() !== $event->getDomainId()->getValue()) {
+        if (null === $this->clientId && $this->clientId->getValue() !== $event->getDomainId()->getValue()) {
             throw new \InvalidArgumentException('Event not applicable for this client.');
         }
         $method = $map[$event->getType()];
         return $this->{$method}($event);
     }
     /**

344) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Client.php:392    [M] NotIdentical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.5c8f11f2a1bffd437001f4f698ce40a6.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        if (null !== $this->clientId && $this->clientId->getValue() !== $event->getDomainId()->getValue()) {
+        if (null !== $this->clientId && $this->clientId->getValue() === $event->getDomainId()->getValue()) {
             throw new \InvalidArgumentException('Event not applicable for this client.');
         }
         $method = $map[$event->getType()];
         return $this->{$method}($event);
     }
     /**

345) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Client.php:392    [M] LogicalAnd
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.d6814332a14564912ed04382ef146ab7.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        if (null !== $this->clientId && $this->clientId->getValue() !== $event->getDomainId()->getValue()) {
+        if (null !== $this->clientId || $this->clientId->getValue() !== $event->getDomainId()->getValue()) {
             throw new \InvalidArgumentException('Event not applicable for this client.');
         }
         $method = $map[$event->getType()];
         return $this->{$method}($event);
     }
     /**

347) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Client.php:418    [M] ProtectedVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.92fcf23873d2b1699ab7c3ffb407c5f6.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    protected function applyClientCreatedEvent(ClientEvent\ClientCreatedEvent $event) : self
+    private function applyClientCreatedEvent(ClientEvent\ClientCreatedEvent $event) : self
     {
         $clone = clone $this;
         $clone->clientId = $event->getClientId();
         $clone->ownerId = $event->getOwnerId();
         $clone->parameters = $event->getParameters();
         return $clone;

348) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Client.php:433    [M] ProtectedVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.9d40ea52521bcbe2191c600d7da08bb4.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    protected function applyClientOwnerChangedEvent(ClientEvent\ClientOwnerChangedEvent $event) : self
+    private function applyClientOwnerChangedEvent(ClientEvent\ClientOwnerChangedEvent $event) : self
     {
         $clone = clone $this;
         $clone->ownerId = $event->getNewOwnerId();
         return $clone;
     }
     /**

350) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Client.php:446    [M] ProtectedVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.a80b6a1c6305521a8e105f2b8cad4821.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    protected function applyClientDeletedEvent(ClientEvent\ClientDeletedEvent $event) : self
+    private function applyClientDeletedEvent(ClientEvent\ClientDeletedEvent $event) : self
     {
         $clone = clone $this;
         $clone->deleted = true;
         return $clone;
     }
     /**

351) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Client.php:459    [M] ProtectedVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.83c3297e631f6ab510514dfb5061739c.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    protected function applyClientParametersUpdatedEvent(ClientEvent\ClientParametersUpdatedEvent $event) : self
+    private function applyClientParametersUpdatedEvent(ClientEvent\ClientParametersUpdatedEvent $event) : self
     {
         $clone = clone $this;
         $clone->parameters = $event->getParameters();
         return $clone;
     }
 }

353) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Command/ChangeOwnerCommand.php:37    [M] ProtectedVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.f77577d0128d83d8b23d63c8270fba1c.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    protected function __construct(ClientId $clientId, UserAccountId $userAccountId)
+    private function __construct(ClientId $clientId, UserAccountId $userAccountId)
     {
         $this->clientId = $clientId;
         $this->userAccountId = $userAccountId;
     }
     /**
      * @param ClientId      $clientId

354) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Command/ChangeOwnerCommand.php:49    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.f8ebb136f9224224ff58e05f3bad987d.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public static function create(ClientId $clientId, UserAccountId $userAccountId) : self
+    protected static function create(ClientId $clientId, UserAccountId $userAccountId) : self
     {
         return new self($clientId, $userAccountId);
     }
     /**
      * @return ClientId
      */

356) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Command/ChangeOwnerCommand.php:65    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.9cfe49916470ac9c5de55d1e8801224c.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getNewOwnerId() : UserAccountId
+    protected function getNewOwnerId() : UserAccountId
     {
         return $this->userAccountId;
     }
 }

357) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Command/ChangeOwnerCommandHandler.php:41    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.0a62e4c8beac873760269ccb2b89ae20.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $client = $this->clientRepository->find($command->getClientId());
-        if (null === $client) {
+        if (null !== $client) {
             throw new \InvalidArgumentException(sprintf('The client with ID "%s" does not exists.', $command->getClientId()->getValue()));
         }
         $owner = $command->getNewOwnerId();
         $client = $client->withOwnerId($owner);
         $this->clientRepository->save($client);
     }

358) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Command/ChangeOwnerCommandHandler.php:38    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.6829a37dbc45722a410e5f05844fd70d.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function handle(ChangeOwnerCommand $command)
+    protected function handle(ChangeOwnerCommand $command)
     {
         $client = $this->clientRepository->find($command->getClientId());
         if (null === $client) {
             throw new \InvalidArgumentException(sprintf('The client with ID "%s" does not exists.', $command->getClientId()->getValue()));
         }
         $owner = $command->getNewOwnerId();

359) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Command/CreateClientCommand.php:44    [M] ProtectedVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.1fedcfd1045762044129b6a9696b3d15.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    protected function __construct(ClientId $clientId, ?UserAccountId $userAccountId, DataBag $parameters)
+    private function __construct(ClientId $clientId, ?UserAccountId $userAccountId, DataBag $parameters)
     {
         $this->clientId = $clientId;
         $this->parameters = $parameters;
         $this->userAccountId = $userAccountId;
     }
     /**

360) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Command/CreateClientCommand.php:58    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.10848a62538157ead98543ea2da09cda.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public static function create(ClientId $clientId, ?UserAccountId $userAccountId, DataBag $parameters) : self
+    protected static function create(ClientId $clientId, ?UserAccountId $userAccountId, DataBag $parameters) : self
     {
         return new self($clientId, $userAccountId, $parameters);
     }
     /**
      * @return ClientId
      */

364) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Command/CreateClientCommandHandler.php:51    [M] NotIdentical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.1d725b95307a46e3675a58ea4f44c50c.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $client = $this->clientRepository->find($clientId);
-        if (null !== $client) {
+        if (null === $client) {
             throw new \InvalidArgumentException(sprintf('The client with ID "%s" already exists.', $clientId->getValue()));
         }
         $parameters = $command->getParameters();
         $userAccountId = $command->getUserAccountId();
         $validatedParameters = $this->ruleManager->handle($clientId, $parameters, $userAccountId);
         $client = Client::createEmpty();

365) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Command/CreateClientCommandHandler.php:47    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.1b7a7e4543dfc082e9cc20548fc8cd76.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function handle(CreateClientCommand $command)
+    protected function handle(CreateClientCommand $command)
     {
         $clientId = $command->getClientId();
         $client = $this->clientRepository->find($clientId);
         if (null !== $client) {
             throw new \InvalidArgumentException(sprintf('The client with ID "%s" already exists.', $clientId->getValue()));
         }

366) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Command/DeleteClientCommand.php:40    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.0b076a9143ed550eaba13539c28487d2.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public static function create(ClientId $clientId) : self
+    protected static function create(ClientId $clientId) : self
     {
         return new self($clientId);
     }
     /**
      * @return ClientId
      */

368) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Command/DeleteClientCommandHandler.php:42    [M] NotIdentical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.f0e9fea1dd59b48b8ae26cca95d94427.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $client = $this->clientRepository->find($clientId);
-        if (null !== $client && !$client->isDeleted()) {
+        if (null === $client && !$client->isDeleted()) {
             $client = $client->markAsDeleted();
             $this->clientRepository->save($client);
         }
     }
 }

369) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Command/DeleteClientCommandHandler.php:42    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.47f37f59b420228d2188ce5c60a63bbf.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $client = $this->clientRepository->find($clientId);
-        if (null !== $client && !$client->isDeleted()) {
+        if (null !== $client && $client->isDeleted()) {
             $client = $client->markAsDeleted();
             $this->clientRepository->save($client);
         }
     }
 }

370) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Command/DeleteClientCommandHandler.php:42    [M] LogicalAnd
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.e05bc4200e087d247ab2ff02e4d534de.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $client = $this->clientRepository->find($clientId);
-        if (null !== $client && !$client->isDeleted()) {
+        if (null !== $client || !$client->isDeleted()) {
             $client = $client->markAsDeleted();
             $this->clientRepository->save($client);
         }
     }
 }

371) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Command/DeleteClientCommandHandler.php:38    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.09fb0e408ae158bf414fbbeb7ea9e378.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function handle(DeleteClientCommand $command)
+    protected function handle(DeleteClientCommand $command)
     {
         $clientId = $command->getClientId();
         $client = $this->clientRepository->find($clientId);
         if (null !== $client && !$client->isDeleted()) {
             $client = $client->markAsDeleted();
             $this->clientRepository->save($client);

372) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Command/UpdateClientCommand.php:37    [M] ProtectedVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.06801907246cd237bd256786d9485f2f.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    protected function __construct(ClientId $clientId, DataBag $parameters)
+    private function __construct(ClientId $clientId, DataBag $parameters)
     {
         $this->clientId = $clientId;
         $this->parameters = $parameters;
     }
     /**
      * @param ClientId $clientId

373) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Command/UpdateClientCommand.php:49    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.0b1bd20b73a973bb7b6ab5e1529f9c2d.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public static function create(ClientId $clientId, DataBag $parameters) : self
+    protected static function create(ClientId $clientId, DataBag $parameters) : self
     {
         return new self($clientId, $parameters);
     }
     /**
      * @return ClientId
      */

377) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Command/UpdateClientCommandHandler.php:46    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.ac10ad45068f995bff584351cbfc2883.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function handle(UpdateClientCommand $command)
+    protected function handle(UpdateClientCommand $command)
     {
         $client = $this->clientRepository->find($command->getClientId());
         if (null === $client) {
             throw new \InvalidArgumentException(sprintf('The client with ID "%s" does not exists.', $command->getClientId()->getValue()));
         }
         $parameters = $command->getParameters();

378) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Event/ClientCreatedEvent.php:50    [M] ProtectedVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.fd6666c79cfe32efd54d94a9e518738f.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    protected function __construct(ClientId $clientId, DataBag $parameters, ?UserAccountId $userAccountId, ?\DateTimeImmutable $recordedOn, ?EventId $eventId)
+    private function __construct(ClientId $clientId, DataBag $parameters, ?UserAccountId $userAccountId, ?\DateTimeImmutable $recordedOn, ?EventId $eventId)
     {
         parent::__construct($recordedOn, $eventId);
         $this->clientId = $clientId;
         $this->parameters = $parameters;
         $this->userAccountId = $userAccountId;
     }

379) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Event/ClientCreatedEvent.php:65    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.4277b78b909c819afa46a13124712a2d.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public static function create(ClientId $clientId, DataBag $parameters, ?UserAccountId $userAccountId) : self
+    protected static function create(ClientId $clientId, DataBag $parameters, ?UserAccountId $userAccountId) : self
     {
         return new self($clientId, $parameters, $userAccountId, null, null);
     }
     /**
      * {@inheritdoc}
      */

385) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Event/ClientDeletedEvent.php:36    [M] ProtectedVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.af139abd3ede024909b9b77f8d8948a9.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    protected function __construct(ClientId $clientId, ?\DateTimeImmutable $recordedOn, ?EventId $eventId)
+    private function __construct(ClientId $clientId, ?\DateTimeImmutable $recordedOn, ?EventId $eventId)
     {
         parent::__construct($recordedOn, $eventId);
         $this->clientId = $clientId;
     }
     /**
      * {@inheritdoc}

390) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Event/ClientOwnerChangedEvent.php:43    [M] ProtectedVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.695fda5805a81fb2a40022c471628d91.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    protected function __construct(ClientId $clientId, UserAccountId $newOwnerId, ?\DateTimeImmutable $recordedOn, ?EventId $eventId)
+    private function __construct(ClientId $clientId, UserAccountId $newOwnerId, ?\DateTimeImmutable $recordedOn, ?EventId $eventId)
     {
         parent::__construct($recordedOn, $eventId);
         $this->clientId = $clientId;
         $this->newOwnerId = $newOwnerId;
     }
     /**

391) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Event/ClientOwnerChangedEvent.php:64    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.a9110308c32fb6a46d1dd70d8f65784a.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public static function create(ClientId $clientId, UserAccountId $newOwnerId) : self
+    protected static function create(ClientId $clientId, UserAccountId $newOwnerId) : self
     {
         return new self($clientId, $newOwnerId, null, null);
     }
     /**
      * {@inheritdoc}
      */

392) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Event/ClientOwnerChangedEvent.php:77    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.5491095b22579bafd0494624c33a3ca8.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $recordedOn = \DateTimeImmutable::createFromFormat('U', (string) $json->recorded_on);
-        $userAccountId = null === $json->payload->new_owner_id ? null : UserAccountId::create($json->payload->new_owner_id);
+        $userAccountId = null !== $json->payload->new_owner_id ? null : UserAccountId::create($json->payload->new_owner_id);
         return new self($clientId, $userAccountId, $recordedOn, $eventId);
     }
     /**
      * {@inheritdoc}
      */
     public function getDomainId() : Id
