397) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Event/ClientParametersUpdatedEvent.php:43    [M] ProtectedVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.9a2389a34945629f9e954b48933e187a.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    protected function __construct(ClientId $clientId, DataBag $parameters, ?\DateTimeImmutable $recordedOn, ?EventId $eventId)
+    private function __construct(ClientId $clientId, DataBag $parameters, ?\DateTimeImmutable $recordedOn, ?EventId $eventId)
     {
         parent::__construct($recordedOn, $eventId);
         $this->clientId = $clientId;
         $this->parameters = $parameters;
     }
     /**

403) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/AbstractInternationalizedRule.php:31    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.dbb4482aea4374208b84f2bd018b6fbf.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         foreach ($requestedParameters->all() as $k => $v) {
-            if ($base === $k) {
+            if ($base !== $k) {
                 $closure($k, $v);
                 $result[$k] = $v;
                 continue;
             }
             $sub = mb_substr($k, 0, mb_strlen($base, '8bit') + 1, '8bit');
             if (sprintf('%s#', $base) === $sub && !empty(mb_substr($k, mb_strlen($base, '8bit') + 1, null, '8bit'))) {

404) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/AbstractInternationalizedRule.php:35    [M] Continue_
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.852eed8bf49d440967b2239989c33e4c.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
                 $result[$k] = $v;
-                continue;
+                break;
             }
             $sub = mb_substr($k, 0, mb_strlen($base, '8bit') + 1, '8bit');
             if (sprintf('%s#', $base) === $sub && !empty(mb_substr($k, mb_strlen($base, '8bit') + 1, null, '8bit'))) {
                 if (null !== $closure) {
                     $closure($k, $v);
                 }

405) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/AbstractInternationalizedRule.php:38    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.516aba0f8873ee8caa4d7a01168cb36b.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             }
-            $sub = mb_substr($k, 0, mb_strlen($base, '8bit') + 1, '8bit');
+            $sub = mb_substr($k, 1, mb_strlen($base, '8bit') + 1, '8bit');
             if (sprintf('%s#', $base) === $sub && !empty(mb_substr($k, mb_strlen($base, '8bit') + 1, null, '8bit'))) {
                 if (null !== $closure) {
                     $closure($k, $v);
                 }
                 $result[$k] = $v;
                 continue;

406) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/AbstractInternationalizedRule.php:38    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.d6616c9d5c8198c48c97c5d363d6aa52.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             }
-            $sub = mb_substr($k, 0, mb_strlen($base, '8bit') + 1, '8bit');
+            $sub = mb_substr($k, 0, mb_strlen($base, '8bit') + 0, '8bit');
             if (sprintf('%s#', $base) === $sub && !empty(mb_substr($k, mb_strlen($base, '8bit') + 1, null, '8bit'))) {
                 if (null !== $closure) {
                     $closure($k, $v);
                 }
                 $result[$k] = $v;
                 continue;

407) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/AbstractInternationalizedRule.php:38    [M] Plus
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.f730087727229320adbcc2e482af66fe.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             }
-            $sub = mb_substr($k, 0, mb_strlen($base, '8bit') + 1, '8bit');
+            $sub = mb_substr($k, 0, mb_strlen($base, '8bit') - 1, '8bit');
             if (sprintf('%s#', $base) === $sub && !empty(mb_substr($k, mb_strlen($base, '8bit') + 1, null, '8bit'))) {
                 if (null !== $closure) {
                     $closure($k, $v);
                 }
                 $result[$k] = $v;
                 continue;

408) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/AbstractInternationalizedRule.php:39    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.210599490117850f013acce6a793cee8.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             $sub = mb_substr($k, 0, mb_strlen($base, '8bit') + 1, '8bit');
-            if (sprintf('%s#', $base) === $sub && !empty(mb_substr($k, mb_strlen($base, '8bit') + 1, null, '8bit'))) {
+            if (sprintf('%s#', $base) !== $sub && !empty(mb_substr($k, mb_strlen($base, '8bit') + 1, null, '8bit'))) {
                 if (null !== $closure) {
                     $closure($k, $v);
                 }
                 $result[$k] = $v;
                 continue;
             }

409) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/AbstractInternationalizedRule.php:39    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.4e74f576e9618c16f2fcf952bab7dee4.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             $sub = mb_substr($k, 0, mb_strlen($base, '8bit') + 1, '8bit');
-            if (sprintf('%s#', $base) === $sub && !empty(mb_substr($k, mb_strlen($base, '8bit') + 1, null, '8bit'))) {
+            if (sprintf('%s#', $base) === $sub && !empty(mb_substr($k, mb_strlen($base, '8bit') + 0, null, '8bit'))) {
                 if (null !== $closure) {
                     $closure($k, $v);
                 }
                 $result[$k] = $v;
                 continue;
             }

410) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/AbstractInternationalizedRule.php:39    [M] Plus
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.8d222adf306584410aca8c2701760058.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             $sub = mb_substr($k, 0, mb_strlen($base, '8bit') + 1, '8bit');
-            if (sprintf('%s#', $base) === $sub && !empty(mb_substr($k, mb_strlen($base, '8bit') + 1, null, '8bit'))) {
+            if (sprintf('%s#', $base) === $sub && !empty(mb_substr($k, mb_strlen($base, '8bit') - 1, null, '8bit'))) {
                 if (null !== $closure) {
                     $closure($k, $v);
                 }
                 $result[$k] = $v;
                 continue;
             }

411) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/AbstractInternationalizedRule.php:39    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.e4cb9f8b70711d063f003ff845edffd3.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             $sub = mb_substr($k, 0, mb_strlen($base, '8bit') + 1, '8bit');
-            if (sprintf('%s#', $base) === $sub && !empty(mb_substr($k, mb_strlen($base, '8bit') + 1, null, '8bit'))) {
+            if (sprintf('%s#', $base) === $sub && empty(mb_substr($k, mb_strlen($base, '8bit') + 1, null, '8bit'))) {
                 if (null !== $closure) {
                     $closure($k, $v);
                 }
                 $result[$k] = $v;
                 continue;
             }

412) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/AbstractInternationalizedRule.php:39    [M] LogicalAnd
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.126b64dd24e081471091f1710a653661.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             $sub = mb_substr($k, 0, mb_strlen($base, '8bit') + 1, '8bit');
-            if (sprintf('%s#', $base) === $sub && !empty(mb_substr($k, mb_strlen($base, '8bit') + 1, null, '8bit'))) {
+            if (sprintf('%s#', $base) === $sub || !empty(mb_substr($k, mb_strlen($base, '8bit') + 1, null, '8bit'))) {
                 if (null !== $closure) {
                     $closure($k, $v);
                 }
                 $result[$k] = $v;
                 continue;
             }

413) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/AbstractInternationalizedRule.php:40    [M] NotIdentical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.af7a8084a2d2da0a554a2cd9385bbf5e.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             if (sprintf('%s#', $base) === $sub && !empty(mb_substr($k, mb_strlen($base, '8bit') + 1, null, '8bit'))) {
-                if (null !== $closure) {
+                if (null === $closure) {
                     $closure($k, $v);
                 }
                 $result[$k] = $v;
                 continue;
             }
         }

415) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/AbstractInternationalizedRule.php:30    [M] Foreach_
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.c94ff50a8bd451d8e9c84ebc36e49802.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $result = [];
-        foreach ($requestedParameters->all() as $k => $v) {
+        foreach (array() as $k => $v) {
             if ($base === $k) {
                 $closure($k, $v);
                 $result[$k] = $v;
                 continue;
             }
             $sub = mb_substr($k, 0, mb_strlen($base, '8bit') + 1, '8bit');

416) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/AbstractInternationalizedRule.php:27    [M] ProtectedVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.f0ef246a40d4b17e19ef489c586017c4.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    protected function getInternationalizedParameters(DataBag $requestedParameters, string $base, ?\Closure $closure) : array
+    private function getInternationalizedParameters(DataBag $requestedParameters, string $base, ?\Closure $closure) : array
     {
         $result = [];
         foreach ($requestedParameters->all() as $k => $v) {
             if ($base === $k) {
                 $closure($k, $v);
                 $result[$k] = $v;

417) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/ApplicationTypeParametersRule.php:28    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.e1ae4e5340157c8fc3319f0bf71a2b9e.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             $application_type = $commandParameters->get('application_type');
-            if (!in_array($application_type, ['native', 'web'])) {
+            if (in_array($application_type, ['native', 'web'])) {
                 throw new \InvalidArgumentException('The parameter "application_type" must be either "native" or "web".');
             }
             $validatedParameters = $validatedParameters->with('application_type', $application_type);
         } else {
             $validatedParameters = $validatedParameters->with('application_type', 'web');
         }

418) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/ApplicationTypeParametersRule.php:24    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.7e3701af046ee879fc7a41a301c806a2.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function handle(ClientId $clientId, DataBag $commandParameters, DataBag $validatedParameters, callable $next) : DataBag
+    protected function handle(ClientId $clientId, DataBag $commandParameters, DataBag $validatedParameters, callable $next) : DataBag
     {
         if ($commandParameters->has('application_type')) {
             $application_type = $commandParameters->get('application_type');
             if (!in_array($application_type, ['native', 'web'])) {
                 throw new \InvalidArgumentException('The parameter "application_type" must be either "native" or "web".');
             }

421) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/CommonParametersRule.php:28    [M] Foreach_
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.0655d2857f417d66cc0fd3d1ecb72461.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             $id = $this->getInternationalizedParameters($commandParameters, $parameter, $closure);
-            foreach ($id as $k => $v) {
+            foreach (array() as $k => $v) {
                 $validatedParameters = $validatedParameters->with($k, $v);
             }
         }
         return $next($clientId, $commandParameters, $validatedParameters);
     }
     /**

422) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/CommonParametersRule.php:26    [M] Foreach_
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.cd26dc0bd865504e37ffecc21e8bcc56.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        foreach ($this->getSupportedParameters() as $parameter => $closure) {
+        foreach (array() as $parameter => $closure) {
             $id = $this->getInternationalizedParameters($commandParameters, $parameter, $closure);
             foreach ($id as $k => $v) {
                 $validatedParameters = $validatedParameters->with($k, $v);
             }
         }
         return $next($clientId, $commandParameters, $validatedParameters);

424) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/CommonParametersRule.php:57    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.c9f43a9f75d5fedbb02f2ae3e3dcd46c.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         return function ($k, $v) {
-            if (!filter_var($v, FILTER_VALIDATE_URL)) {
+            if (filter_var($v, FILTER_VALIDATE_URL)) {
                 throw new \InvalidArgumentException(sprintf('The parameter with key "%s" is not a valid URL.', $k));
             }
         };
     }
 }

425) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/ContactsParametersRule.php:28    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.deeed5a29e46bfbf340f1905b81b3dee.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             $contacts = $commandParameters->get('contacts');
-            if (!is_array($contacts)) {
+            if (is_array($contacts)) {
                 throw new \InvalidArgumentException('The parameter "contacts" must be a list of e-mail addresses.');
             }
             foreach ($contacts as $contact) {
                 if (!filter_var($contact, FILTER_VALIDATE_EMAIL)) {
                     throw new \InvalidArgumentException('The parameter "contacts" must be a list of e-mail addresses.');
                 }

426) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/ContactsParametersRule.php:32    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.5a922fe158589c41086f61d878533d61.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             foreach ($contacts as $contact) {
-                if (!filter_var($contact, FILTER_VALIDATE_EMAIL)) {
+                if (filter_var($contact, FILTER_VALIDATE_EMAIL)) {
                     throw new \InvalidArgumentException('The parameter "contacts" must be a list of e-mail addresses.');
                 }
             }
             $validatedParameters = $validatedParameters->with('contacts', $contacts);
         }
         return $next($clientId, $commandParameters, $validatedParameters);

427) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/ContactsParametersRule.php:31    [M] Foreach_
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.38177ded424bbfa31a0a360edc0835fb.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             }
-            foreach ($contacts as $contact) {
+            foreach (array() as $contact) {
                 if (!filter_var($contact, FILTER_VALIDATE_EMAIL)) {
                     throw new \InvalidArgumentException('The parameter "contacts" must be a list of e-mail addresses.');
                 }
             }
             $validatedParameters = $validatedParameters->with('contacts', $contacts);
         }

429) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/GrantTypesRule.php:42    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.39e07370712f8ab89469a95d22703113.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (!$commandParameters->has('grant_types')) {
+        if ($commandParameters->has('grant_types')) {
             $commandParameters = $commandParameters->with('grant_types', []);
         }
         $this->checkGrantTypes($commandParameters);
         $validatedParameters = $validatedParameters->with('grant_types', $commandParameters->get('grant_types'));
         $validatedParameters = $next($clientId, $commandParameters, $validatedParameters);
         $this->checkResponseTypes($validatedParameters);

431) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/GrantTypesRule.php:60    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.a807a86abd17a3471fa7c3b882360337.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (!is_array($parameters->get('grant_types'))) {
+        if (is_array($parameters->get('grant_types'))) {
             throw new \InvalidArgumentException('The parameter "grant_types" must be an array of strings.');
         }
         foreach ($parameters->get('grant_types') as $grant_type) {
             if (!is_string($grant_type)) {
                 throw new \InvalidArgumentException('The parameter "grant_types" must be an array of strings.');
             }

432) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/GrantTypesRule.php:64    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.b8ab917ed424292bcc3a56523aa39d1a.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         foreach ($parameters->get('grant_types') as $grant_type) {
-            if (!is_string($grant_type)) {
+            if (is_string($grant_type)) {
                 throw new \InvalidArgumentException('The parameter "grant_types" must be an array of strings.');
             }
             if (!$this->grantTypeManager->has($grant_type)) {
                 throw new \InvalidArgumentException(sprintf('The grant_type "%s" is not supported by this server.', $grant_type));
             }
         }

433) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/GrantTypesRule.php:67    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.9231440a75d092e854d57986ea5f79e0.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             }
-            if (!$this->grantTypeManager->has($grant_type)) {
+            if ($this->grantTypeManager->has($grant_type)) {
                 throw new \InvalidArgumentException(sprintf('The grant_type "%s" is not supported by this server.', $grant_type));
             }
         }
     }
     /**
      * @param DataBag $parameters

434) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/GrantTypesRule.php:63    [M] Foreach_
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.4eafdc08b711c3dd2f374122c7cdb36a.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        foreach ($parameters->get('grant_types') as $grant_type) {
+        foreach (array() as $grant_type) {
             if (!is_string($grant_type)) {
                 throw new \InvalidArgumentException('The parameter "grant_types" must be an array of strings.');
             }
             if (!$this->grantTypeManager->has($grant_type)) {
                 throw new \InvalidArgumentException(sprintf('The grant_type "%s" is not supported by this server.', $grant_type));
             }

435) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/GrantTypesRule.php:84    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.450d2157119036808029bdbe1f0cc13a.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             $diff = array_diff($type->getAssociatedResponseTypes(), $responseTypes);
-            if (!empty($diff)) {
+            if (empty($diff)) {
                 throw new \InvalidArgumentException(sprintf('The grant type "%s" requires the following response type(s): %s.', $grantType, implode(', ', $diff)));
             }
         }
     }
 }

436) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/GrantTypesRule.php:81    [M] Foreach_
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.a2b2555c39f51b1c04c166530d8cd4f6.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $responseTypes = $parameters->has('response_types') ? $parameters->get('response_types') : [];
-        foreach ($parameters->get('grant_types') as $grantType) {
+        foreach (array() as $grantType) {
             $type = $this->grantTypeManager->get($grantType);
             $diff = array_diff($type->getAssociatedResponseTypes(), $responseTypes);
             if (!empty($diff)) {
                 throw new \InvalidArgumentException(sprintf('The grant type "%s" requires the following response type(s): %s.', $grantType, implode(', ', $diff)));
             }
         }

437) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/IdTokenAlgorithmsRule.php:55    [M] LogicalAnd
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.7b5148e05630d55cdb277a939b77bd5a.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        if ($commandParameters->has('id_token_encrypted_response_alg') && $commandParameters->has('id_token_encrypted_response_enc') && null !== $this->jweBuilder) {
+        if (($commandParameters->has('id_token_encrypted_response_alg') || $commandParameters->has('id_token_encrypted_response_enc')) && null !== $this->jweBuilder) {
             $this->checkAlgorithms('id_token_encrypted_response_alg', $commandParameters, $this->jweBuilder->getKeyEncryptionAlgorithmManager()->list());
             $this->checkAlgorithms('id_token_encrypted_response_enc', $commandParameters, $this->jweBuilder->getContentEncryptionAlgorithmManager()->list());
             $validatedParameters = $validatedParameters->with('id_token_encrypted_response_alg', $commandParameters->get('id_token_encrypted_response_alg'));
             $validatedParameters = $validatedParameters->with('id_token_encrypted_response_enc', $commandParameters->get('id_token_encrypted_response_enc'));
         }
         return $next($clientId, $commandParameters, $validatedParameters);

438) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/IdTokenAlgorithmsRule.php:55    [M] NotIdentical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.48f89627ef8ab8491f4b5a27588a7c89.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        if ($commandParameters->has('id_token_encrypted_response_alg') && $commandParameters->has('id_token_encrypted_response_enc') && null !== $this->jweBuilder) {
+        if ($commandParameters->has('id_token_encrypted_response_alg') && $commandParameters->has('id_token_encrypted_response_enc') && null === $this->jweBuilder) {
             $this->checkAlgorithms('id_token_encrypted_response_alg', $commandParameters, $this->jweBuilder->getKeyEncryptionAlgorithmManager()->list());
             $this->checkAlgorithms('id_token_encrypted_response_enc', $commandParameters, $this->jweBuilder->getContentEncryptionAlgorithmManager()->list());
             $validatedParameters = $validatedParameters->with('id_token_encrypted_response_alg', $commandParameters->get('id_token_encrypted_response_alg'));
             $validatedParameters = $validatedParameters->with('id_token_encrypted_response_enc', $commandParameters->get('id_token_encrypted_response_enc'));
         }
         return $next($clientId, $commandParameters, $validatedParameters);
