439) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/IdTokenAlgorithmsRule.php:55    [M] LogicalAnd
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.de0d995a367987dc5467a61fee686766.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        if ($commandParameters->has('id_token_encrypted_response_alg') && $commandParameters->has('id_token_encrypted_response_enc') && null !== $this->jweBuilder) {
+        if ($commandParameters->has('id_token_encrypted_response_alg') && $commandParameters->has('id_token_encrypted_response_enc') || null !== $this->jweBuilder) {
             $this->checkAlgorithms('id_token_encrypted_response_alg', $commandParameters, $this->jweBuilder->getKeyEncryptionAlgorithmManager()->list());
             $this->checkAlgorithms('id_token_encrypted_response_enc', $commandParameters, $this->jweBuilder->getContentEncryptionAlgorithmManager()->list());
             $validatedParameters = $validatedParameters->with('id_token_encrypted_response_alg', $commandParameters->get('id_token_encrypted_response_alg'));
             $validatedParameters = $validatedParameters->with('id_token_encrypted_response_enc', $commandParameters->get('id_token_encrypted_response_enc'));
         }
         return $next($clientId, $commandParameters, $validatedParameters);

441) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/IdTokenAlgorithmsRule.php:73    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.1080ad92bf3e101c4d2adf2c235ec693.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $algorithm = $commandParameters->get($parameter);
-        if (!is_string($algorithm) || !in_array($algorithm, $allowedAlgorithms)) {
+        if (is_string($algorithm) || !in_array($algorithm, $allowedAlgorithms)) {
             throw new \InvalidArgumentException(sprintf('The parameter "%s" must be an algorithm supported by this server. Please choose one of the following value(s): %s', $parameter, implode(', ', $allowedAlgorithms)));
         }
     }
 }

442) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/IdTokenAlgorithmsRule.php:73    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.585ab7080ff159a254069e226b14f451.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $algorithm = $commandParameters->get($parameter);
-        if (!is_string($algorithm) || !in_array($algorithm, $allowedAlgorithms)) {
+        if (!is_string($algorithm) || in_array($algorithm, $allowedAlgorithms)) {
             throw new \InvalidArgumentException(sprintf('The parameter "%s" must be an algorithm supported by this server. Please choose one of the following value(s): %s', $parameter, implode(', ', $allowedAlgorithms)));
         }
     }
 }

443) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/IdTokenAlgorithmsRule.php:73    [M] LogicalOr
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.506f97d5c37399fcb363c9b1dd7919e1.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $algorithm = $commandParameters->get($parameter);
-        if (!is_string($algorithm) || !in_array($algorithm, $allowedAlgorithms)) {
+        if (!is_string($algorithm) && !in_array($algorithm, $allowedAlgorithms)) {
             throw new \InvalidArgumentException(sprintf('The parameter "%s" must be an algorithm supported by this server. Please choose one of the following value(s): %s', $parameter, implode(', ', $allowedAlgorithms)));
         }
     }
 }

444) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/RedirectionUriRule.php:27    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.8d344af157d17b0accdf6c11d9ac93c6.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $validatedParameters = $next($clientId, $commandParameters, $validatedParameters);
-        if (!$validatedParameters->has('response_types') || empty($validatedParameters->get('response_types'))) {
+        if ($validatedParameters->has('response_types') || empty($validatedParameters->get('response_types'))) {
             return $validatedParameters;
         }
         if (!$commandParameters->has('redirect_uris')) {
             throw new \InvalidArgumentException('The parameter "redirect_uris" is mandatory when response types are used.');
         }
         $redirectUris = $commandParameters->get('redirect_uris');

445) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/RedirectionUriRule.php:27    [M] LogicalOr
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.6601bdb0fb89f51557b825c6114927c6.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $validatedParameters = $next($clientId, $commandParameters, $validatedParameters);
-        if (!$validatedParameters->has('response_types') || empty($validatedParameters->get('response_types'))) {
+        if (!$validatedParameters->has('response_types') && empty($validatedParameters->get('response_types'))) {
             return $validatedParameters;
         }
         if (!$commandParameters->has('redirect_uris')) {
             throw new \InvalidArgumentException('The parameter "redirect_uris" is mandatory when response types are used.');
         }
         $redirectUris = $commandParameters->get('redirect_uris');

446) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/RedirectionUriRule.php:30    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.9975065a417cfdd514e65478239b1ce8.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        if (!$commandParameters->has('redirect_uris')) {
+        if ($commandParameters->has('redirect_uris')) {
             throw new \InvalidArgumentException('The parameter "redirect_uris" is mandatory when response types are used.');
         }
         $redirectUris = $commandParameters->get('redirect_uris');
         $application_type = $validatedParameters->has('application_type') ? $validatedParameters->get('application_type') : 'web';
         $response_types = $validatedParameters->has('response_types') ? $validatedParameters->get('response_types') : [];
         $uses_implicit_grant_type = false;

447) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/RedirectionUriRule.php:36    [M] FalseValue
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.268e2453be53cd031bf1b9077a8e1d6d.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $response_types = $validatedParameters->has('response_types') ? $validatedParameters->get('response_types') : [];
-        $uses_implicit_grant_type = false;
+        $uses_implicit_grant_type = true;
         foreach ($response_types as $response_type) {
             $types = explode(' ', $response_type);
             if (in_array('token', $types)) {
                 $uses_implicit_grant_type = true;
                 break;
             }

448) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/RedirectionUriRule.php:40    [M] TrueValue
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.5e2f7d32ed317155e8acff260c8f3ec4.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             if (in_array('token', $types)) {
-                $uses_implicit_grant_type = true;
+                $uses_implicit_grant_type = false;
                 break;
             }
         }
         $this->checkAllUris($redirectUris, $application_type, $uses_implicit_grant_type);
         $validatedParameters = $validatedParameters->with('redirect_uris', $redirectUris);
         return $validatedParameters;

449) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/RedirectionUriRule.php:42    [M] Break_
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.5b59c4ec9b01e5029d46d5de6c9ca679.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
                 $uses_implicit_grant_type = true;
-                break;
+                continue;
             }
         }
         $this->checkAllUris($redirectUris, $application_type, $uses_implicit_grant_type);
         $validatedParameters = $validatedParameters->with('redirect_uris', $redirectUris);
         return $validatedParameters;
     }

450) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/RedirectionUriRule.php:37    [M] Foreach_
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.c6fbb93d66ad55d51b12966ad46d98b1.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $uses_implicit_grant_type = false;
-        foreach ($response_types as $response_type) {
+        foreach (array() as $response_type) {
             $types = explode(' ', $response_type);
             if (in_array('token', $types)) {
                 $uses_implicit_grant_type = true;
                 break;
             }
         }

452) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/RedirectionUriRule.php:58    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.0aefd167d710a349d04a211ad1cb2fed.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (!is_array($value)) {
+        if (is_array($value)) {
             throw new \InvalidArgumentException('The parameter "redirect_uris" must be a list of URI or URN.');
         }
         foreach ($value as $redirectUri) {
             if (!is_string($redirectUri)) {
                 throw new \InvalidArgumentException('The parameter "redirect_uris" must be a list of URI or URN.');
             }

453) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/RedirectionUriRule.php:62    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.dad9e188acbc751d00eb8bffcc3d8b35.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         foreach ($value as $redirectUri) {
-            if (!is_string($redirectUri)) {
+            if (is_string($redirectUri)) {
                 throw new \InvalidArgumentException('The parameter "redirect_uris" must be a list of URI or URN.');
             }
             $this->checkUri($redirectUri, $application_type, $uses_implicit_grant_type);
         }
     }
     /**

454) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/RedirectionUriRule.php:61    [M] Foreach_
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.4a8eaebbc1dce0ff0ee3ad2b8a43c03d.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        foreach ($value as $redirectUri) {
+        foreach (array() as $redirectUri) {
             if (!is_string($redirectUri)) {
                 throw new \InvalidArgumentException('The parameter "redirect_uris" must be a list of URI or URN.');
             }
             $this->checkUri($redirectUri, $application_type, $uses_implicit_grant_type);
         }
     }

455) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/RedirectionUriRule.php:76    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.8becf8f213bc61a9a8bf3ea9dbbe9d42.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if ('urn:' === mb_substr($uri, 0, 4, '8bit')) {
+        if ('urn:' === mb_substr($uri, 1, 4, '8bit')) {
             $this->checkUrn($uri);
         } else {
             $this->checkUrl($uri, $application_type, $uses_implicit_grant_type);
         }
     }
     /**

456) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/RedirectionUriRule.php:76    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.8d20833c217e89de3a1281b59c6c659c.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if ('urn:' === mb_substr($uri, 0, 4, '8bit')) {
+        if ('urn:' !== mb_substr($uri, 0, 4, '8bit')) {
             $this->checkUrn($uri);
         } else {
             $this->checkUrl($uri, $application_type, $uses_implicit_grant_type);
         }
     }
     /**

457) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/RedirectionUriRule.php:91    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.586a24972c45e254473812d2d7141372.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         // If URI is not a valid URI, return false
-        if (!filter_var($url, FILTER_VALIDATE_URL)) {
+        if (filter_var($url, FILTER_VALIDATE_URL)) {
             throw new \InvalidArgumentException('The parameter "redirect_uris" must be a list of URI or URN.');
         }
         $parsed = parse_url($url);
         // Checks for path traversal (e.g. http://foo.bar/redirect/../bad/url)
         if (isset($parsed['path'])) {
             $path = urldecode($parsed['path']);

458) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/RedirectionUriRule.php:108    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.675c223a3ee64a6bd3a20c41c25b618d.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        if ('web' === $application_type && true === $uses_implicit_grant_type) {
+        if ('web' !== $application_type && true === $uses_implicit_grant_type) {
             if ('localhost' === $parsed['host']) {
                 throw new \InvalidArgumentException('The host "localhost" is not allowed for web applications that use the Implicit Grant Type.');
             }
             if ('https' !== $parsed['scheme']) {
                 throw new \InvalidArgumentException('The parameter "redirect_uris" must only contain URIs with the HTTPS scheme for web applications that use the Implicit Grant Type.');
             }

459) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/RedirectionUriRule.php:108    [M] TrueValue
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.9b418ff4b777dbb9d570b2fdf66d5ca8.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        if ('web' === $application_type && true === $uses_implicit_grant_type) {
+        if ('web' === $application_type && false === $uses_implicit_grant_type) {
             if ('localhost' === $parsed['host']) {
                 throw new \InvalidArgumentException('The host "localhost" is not allowed for web applications that use the Implicit Grant Type.');
             }
             if ('https' !== $parsed['scheme']) {
                 throw new \InvalidArgumentException('The parameter "redirect_uris" must only contain URIs with the HTTPS scheme for web applications that use the Implicit Grant Type.');
             }

460) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/RedirectionUriRule.php:108    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.cd2a258861c56408eb5382e6339910f9.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        if ('web' === $application_type && true === $uses_implicit_grant_type) {
+        if ('web' === $application_type && true !== $uses_implicit_grant_type) {
             if ('localhost' === $parsed['host']) {
                 throw new \InvalidArgumentException('The host "localhost" is not allowed for web applications that use the Implicit Grant Type.');
             }
             if ('https' !== $parsed['scheme']) {
                 throw new \InvalidArgumentException('The parameter "redirect_uris" must only contain URIs with the HTTPS scheme for web applications that use the Implicit Grant Type.');
             }

461) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/RedirectionUriRule.php:108    [M] LogicalAnd
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.f7368c2ae9e57264b02d295be649ed18.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        if ('web' === $application_type && true === $uses_implicit_grant_type) {
+        if ('web' === $application_type || true === $uses_implicit_grant_type) {
             if ('localhost' === $parsed['host']) {
                 throw new \InvalidArgumentException('The host "localhost" is not allowed for web applications that use the Implicit Grant Type.');
             }
             if ('https' !== $parsed['scheme']) {
                 throw new \InvalidArgumentException('The parameter "redirect_uris" must only contain URIs with the HTTPS scheme for web applications that use the Implicit Grant Type.');
             }

462) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/RedirectionUriRule.php:109    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.905e874793ff3c58a794afedfd0c3f8c.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         if ('web' === $application_type && true === $uses_implicit_grant_type) {
-            if ('localhost' === $parsed['host']) {
+            if ('localhost' !== $parsed['host']) {
                 throw new \InvalidArgumentException('The host "localhost" is not allowed for web applications that use the Implicit Grant Type.');
             }
             if ('https' !== $parsed['scheme']) {
                 throw new \InvalidArgumentException('The parameter "redirect_uris" must only contain URIs with the HTTPS scheme for web applications that use the Implicit Grant Type.');
             }
         }

463) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/RedirectionUriRule.php:112    [M] NotIdentical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.4a2858313b2efc3d3b6169d6da08579a.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             }
-            if ('https' !== $parsed['scheme']) {
+            if ('https' === $parsed['scheme']) {
                 throw new \InvalidArgumentException('The parameter "redirect_uris" must only contain URIs with the HTTPS scheme for web applications that use the Implicit Grant Type.');
             }
         }
     }
     /**
      * @param string $urn

464) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/RedirectionUriRule.php:88    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.cc8947bb56f4d39c2f12ce7a993172bf.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function checkUrl(string $url, string $application_type, bool $uses_implicit_grant_type)
+    protected function checkUrl(string $url, string $application_type, bool $uses_implicit_grant_type)
     {
         // If URI is not a valid URI, return false
         if (!filter_var($url, FILTER_VALIDATE_URL)) {
             throw new \InvalidArgumentException('The parameter "redirect_uris" must be a list of URI or URN.');
         }
         $parsed = parse_url($url);

465) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/RedirectionUriRule.php:123    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.5d2f0c9f306bb1e0259a295b52a7dd0d.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (1 !== preg_match('/^urn:[a-z0-9][a-z0-9-]{0,31}:([a-z0-9()+,-.:=@;$_!*\']|%(0[1-9a-f]|[1-9a-f][0-9a-f]))+$/i', $urn)) {
+        if (0 !== preg_match('/^urn:[a-z0-9][a-z0-9-]{0,31}:([a-z0-9()+,-.:=@;$_!*\']|%(0[1-9a-f]|[1-9a-f][0-9a-f]))+$/i', $urn)) {
             throw new \InvalidArgumentException('The parameter "redirect_uris" must be a list of URI or URN.');
         }
     }
 }

466) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/RedirectionUriRule.php:123    [M] NotIdentical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.541daa4a824f7b2c7a07fae3bcca20ac.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (1 !== preg_match('/^urn:[a-z0-9][a-z0-9-]{0,31}:([a-z0-9()+,-.:=@;$_!*\']|%(0[1-9a-f]|[1-9a-f][0-9a-f]))+$/i', $urn)) {
+        if (1 === preg_match('/^urn:[a-z0-9][a-z0-9-]{0,31}:([a-z0-9()+,-.:=@;$_!*\']|%(0[1-9a-f]|[1-9a-f][0-9a-f]))+$/i', $urn)) {
             throw new \InvalidArgumentException('The parameter "redirect_uris" must be a list of URI or URN.');
         }
     }
 }

471) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/RequestUriRule.php:47    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.3e7536e7cc22d05768920c1ac21fd8c5.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         foreach ($value as $redirectUri) {
-            if (!is_string($redirectUri) || !filter_var($redirectUri, FILTER_VALIDATE_URL)) {
+            if (is_string($redirectUri) || !filter_var($redirectUri, FILTER_VALIDATE_URL)) {
                 throw new \InvalidArgumentException('The parameter "request_uris" must be a list of URI.');
             }
         }
     }
 }

472) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/RequestUriRule.php:47    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.e77fefa1b09973d58e5d501e13a8fa70.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         foreach ($value as $redirectUri) {
-            if (!is_string($redirectUri) || !filter_var($redirectUri, FILTER_VALIDATE_URL)) {
+            if (!is_string($redirectUri) || filter_var($redirectUri, FILTER_VALIDATE_URL)) {
                 throw new \InvalidArgumentException('The parameter "request_uris" must be a list of URI.');
             }
         }
     }
 }

473) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/RequestUriRule.php:47    [M] LogicalOr
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.a9d1602925ef386979213694b46dd7dc.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         foreach ($value as $redirectUri) {
-            if (!is_string($redirectUri) || !filter_var($redirectUri, FILTER_VALIDATE_URL)) {
+            if (!is_string($redirectUri) && !filter_var($redirectUri, FILTER_VALIDATE_URL)) {
                 throw new \InvalidArgumentException('The parameter "request_uris" must be a list of URI.');
             }
         }
     }
 }

475) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/ResponseTypesRule.php:42    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.6760cf2b8b1b810da1f7a3511c676d89.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (!$commandParameters->has('response_types')) {
+        if ($commandParameters->has('response_types')) {
             $commandParameters = $commandParameters->with('response_types', []);
         }
         $this->checkResponseTypes($commandParameters);
         $validatedParameters = $validatedParameters->with('response_types', $commandParameters->get('response_types'));
         $validatedParameters = $next($clientId, $commandParameters, $validatedParameters);
         $this->checkGrantTypes($validatedParameters);

477) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/ResponseTypesRule.php:61    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.9578c26318ece245996faea4a851d9cf.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (!is_array($parameters->get('response_types'))) {
+        if (is_array($parameters->get('response_types'))) {
             throw new \InvalidArgumentException('The parameter "response_types" must be an array of strings.');
         }
         foreach ($parameters->get('response_types') as $grant_type) {
             if (!is_string($grant_type)) {
                 throw new \InvalidArgumentException('The parameter "response_types" must be an array of strings.');
             }

478) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/ResponseTypesRule.php:65    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.12f1c447493c4209b5dc13462a97b547.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         foreach ($parameters->get('response_types') as $grant_type) {
-            if (!is_string($grant_type)) {
+            if (is_string($grant_type)) {
                 throw new \InvalidArgumentException('The parameter "response_types" must be an array of strings.');
             }
         }
     }
     /**
      * @param DataBag $parameters

479) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/ResponseTypesRule.php:64    [M] Foreach_
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.470802a4fc40e71947c666fd8dffa921.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        foreach ($parameters->get('response_types') as $grant_type) {
+        foreach (array() as $grant_type) {
             if (!is_string($grant_type)) {
                 throw new \InvalidArgumentException('The parameter "response_types" must be an array of strings.');
             }
         }
     }
     /**
