480) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/ResponseTypesRule.php:83    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.b27598df01decb2f8aea1f6dc7bae0d0.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
                 $diff = array_diff($type->getAssociatedGrantTypes(), $grantTypes);
-                if (!empty($diff)) {
+                if (empty($diff)) {
                     throw new \InvalidArgumentException(sprintf('The response type "%s" requires the following grant type(s): %s.', $responseType, implode(', ', $diff)));
                 }
             }
         }
     }
 }

481) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/ResponseTypesRule.php:81    [M] Foreach_
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.394d13aeba48f52a6901a45d1ea2e4cb.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             $types = $this->responseTypeManager->find($responseType);
-            foreach ($types as $type) {
+            foreach (array() as $type) {
                 $diff = array_diff($type->getAssociatedGrantTypes(), $grantTypes);
                 if (!empty($diff)) {
                     throw new \InvalidArgumentException(sprintf('The response type "%s" requires the following grant type(s): %s.', $responseType, implode(', ', $diff)));
                 }
             }
         }

482) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/ResponseTypesRule.php:79    [M] Foreach_
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.b975673e8bbabd47987fdbbcd98f013a.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $grantTypes = $parameters->has('grant_types') ? $parameters->get('grant_types') : [];
-        foreach ($parameters->get('response_types') as $responseType) {
+        foreach (array() as $responseType) {
             $types = $this->responseTypeManager->find($responseType);
             foreach ($types as $type) {
                 $diff = array_diff($type->getAssociatedGrantTypes(), $grantTypes);
                 if (!empty($diff)) {
                     throw new \InvalidArgumentException(sprintf('The response type "%s" requires the following grant type(s): %s.', $responseType, implode(', ', $diff)));
                 }

483) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/RuleManager.php:56    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.ae08df92c4fd0bba8a70e90ccb3a1d03.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        return call_user_func($this->callableForNextRule(0), $clientId, $commandParameters, DataBag::create([]));
+        return call_user_func($this->callableForNextRule(1), $clientId, $commandParameters, DataBag::create([]));
     }
     /**
      * @param int $index
      *
      * @return \Closure
      */

484) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/RuleManager.php:54    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.dc11b230c033d587c9e15cb4d8979dd9.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function handle(ClientId $clientId, DataBag $commandParameters) : DataBag
+    protected function handle(ClientId $clientId, DataBag $commandParameters) : DataBag
     {
         return call_user_func($this->callableForNextRule(0), $clientId, $commandParameters, DataBag::create([]));
     }
     /**
      * @param int $index
      *

485) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/RuleManager.php:66    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.f0dd650bf80b9e8d6f45dc53762ebed5.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (!isset($this->rules[$index])) {
+        if (isset($this->rules[$index])) {
             return function (ClientId $clientId, DataBag $commandParameters, DataBag $validatedParameters) : DataBag {
                 return $validatedParameters;
             };
         }
         $rule = $this->rules[$index];
         return function (ClientId $clientId, DataBag $commandParameters, DataBag $validatedParameters) use($rule, $index) : DataBag {

486) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/ScopePolicyDefaultRule.php:28    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.c65d604ba20d71e3e2636e49b9f16290.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             $defaultScope = $commandParameters->get('default_scope');
-            if (!is_string($defaultScope)) {
+            if (is_string($defaultScope)) {
                 throw new \InvalidArgumentException('The "default_scope" parameter must be a string.');
             }
             if (1 !== preg_match('/^[\\x20\\x23-\\x5B\\x5D-\\x7E]+$/', $defaultScope)) {
                 throw new \InvalidArgumentException('Invalid characters found in the "default_scope" parameter.');
             }
             $validatedParameters = $validatedParameters->with('default_scope', $commandParameters->get('default_scope'));

487) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/ScopePolicyDefaultRule.php:31    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.589e4c07ff46e76f4f495d9ee512202e.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             }
-            if (1 !== preg_match('/^[\\x20\\x23-\\x5B\\x5D-\\x7E]+$/', $defaultScope)) {
+            if (0 !== preg_match('/^[\\x20\\x23-\\x5B\\x5D-\\x7E]+$/', $defaultScope)) {
                 throw new \InvalidArgumentException('Invalid characters found in the "default_scope" parameter.');
             }
             $validatedParameters = $validatedParameters->with('default_scope', $commandParameters->get('default_scope'));
         }
         return $next($clientId, $commandParameters, $validatedParameters);
     }

488) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/ScopePolicyDefaultRule.php:31    [M] NotIdentical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.5ae9180a5c58148801f39e4aea9f32b0.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             }
-            if (1 !== preg_match('/^[\\x20\\x23-\\x5B\\x5D-\\x7E]+$/', $defaultScope)) {
+            if (1 === preg_match('/^[\\x20\\x23-\\x5B\\x5D-\\x7E]+$/', $defaultScope)) {
                 throw new \InvalidArgumentException('Invalid characters found in the "default_scope" parameter.');
             }
             $validatedParameters = $validatedParameters->with('default_scope', $commandParameters->get('default_scope'));
         }
         return $next($clientId, $commandParameters, $validatedParameters);
     }

490) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/ScopePolicyRule.php:42    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.e7468ba970a5c0866221aba040f5f594.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             $policy = $commandParameters->get('scope_policy');
-            if (!is_string($policy)) {
+            if (is_string($policy)) {
                 throw new \InvalidArgumentException('The parameter "scope_policy" must be a string.');
             }
             if (!$this->scopePolicyManager->has($policy)) {
                 throw new \InvalidArgumentException(sprintf('The scope policy "%s" is not supported.', $policy));
             }
             $validatedParameters = $validatedParameters->with('scope_policy', $commandParameters->get('scope_policy'));

491) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/ScopePolicyRule.php:45    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.9c66535b7a30234a7cd1cd6a6b9299c4.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             }
-            if (!$this->scopePolicyManager->has($policy)) {
+            if ($this->scopePolicyManager->has($policy)) {
                 throw new \InvalidArgumentException(sprintf('The scope policy "%s" is not supported.', $policy));
             }
             $validatedParameters = $validatedParameters->with('scope_policy', $commandParameters->get('scope_policy'));
         }
         return $next($clientId, $commandParameters, $validatedParameters);
     }

493) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/DataBag/DataBag.php:33    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.d77a77a29a0528ef82c77d746f58abb2.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public static function create(array $parameters) : self
+    protected static function create(array $parameters) : self
     {
         return new self($parameters);
     }
     /**
      * @param string $key
      *

495) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/DataBag/DataBag.php:54    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.e9463ebae446f6af2b38d03690dc763e.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function get(string $key, $default = null)
+    protected function get(string $key, $default = null)
     {
         if ($this->has($key)) {
             return $this->parameters[$key];
         }
         return $default;
     }

496) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/DataBag/DataBag.php:69    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.8813ab7ab317ffb27b5e2cf4230c8330.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function with(string $key, $value) : self
+    protected function with(string $key, $value) : self
     {
         $clone = clone $this;
         $clone->parameters[$key] = $value;
         return $clone;
     }
     /**

498) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/DataBag/DataBag.php:82    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.cfdb2c070b8febb448f870f2918059d8.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function without(string $key) : self
+    protected function without(string $key) : self
     {
         if (!$this->has($key)) {
             return $this;
         }
         $clone = clone $this;
         unset($clone->parameters[$key]);

501) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/DomainConverter.php:40    [M] BitwiseOr
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.b1845906cc9cde0247c2ca2dafd5ed28.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        $this->options = JSON_UNESCAPED_SLASHES | JSON_UNESCAPED_UNICODE;
+        $this->options = JSON_UNESCAPED_SLASHES & JSON_UNESCAPED_UNICODE;
         $loaderManager = new LoaderManager(['https' => $domainUriLoader]);
         $this->dereferencer = new Dereferencer();
         $this->dereferencer->setLoaderManager($loaderManager);
     }
     /**
      * @param string $jsonData

502) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/DomainConverter.php:56    [M] FalseValue
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.f206b5c85888daaf6483c909f0733e01.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         try {
-            $decoded = json_decode($jsonData, false, $this->options);
+            $decoded = json_decode($jsonData, true, $this->options);
             if (!$decoded instanceof \stdClass) {
                 throw new \RuntimeException('Unable to decode');
             }
             if (!property_exists($decoded, '$schema')) {
                 throw new \InvalidArgumentException('The object is not a valid Json object from the domain.');
             }

503) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/DomainConverter.php:57    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.d2f26ca23e537db229d9f91b742b24e7.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             $decoded = json_decode($jsonData, false, $this->options);
-            if (!$decoded instanceof \stdClass) {
+            if ($decoded instanceof \stdClass) {
                 throw new \RuntimeException('Unable to decode');
             }
             if (!property_exists($decoded, '$schema')) {
                 throw new \InvalidArgumentException('The object is not a valid Json object from the domain.');
             }
             $schema = $this->dereferencer->dereference($decoded->{'$schema'});

504) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/DomainConverter.php:60    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.68f38b32f9370211375115b15c5d55c2.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             }
-            if (!property_exists($decoded, '$schema')) {
+            if (property_exists($decoded, '$schema')) {
                 throw new \InvalidArgumentException('The object is not a valid Json object from the domain.');
             }
             $schema = $this->dereferencer->dereference($decoded->{'$schema'});
             $validator = new Validator($decoded, $schema);
             if ($validator->fails()) {
                 throw new \InvalidArgumentException('The domain object cannot be verified with the selected schema.');

505) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/DomainConverter.php:72    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.c3a9c2babc53e2d0c7ab14750317264a.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             $class = $decoded->type;
-            if (!class_exists($class)) {
+            if (class_exists($class)) {
                 throw new \InvalidArgumentException(sprintf('Unsupported class "%s"', $class));
             }
             $domainObject = $class::createFromJson($decoded);
         } catch (\Exception $e) {
             throw new OAuth2Exception(500, OAuth2Exception::ERROR_INTERNAL, 'The server encountered and internal error.', [], $e);
         }

506) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/DomainConverter.php:53    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.373576acdc6272cfd1608fc8424ff586.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function fromJson(string $jsonData) : DomainObject
+    protected function fromJson(string $jsonData) : DomainObject
     {
         try {
             $decoded = json_decode($jsonData, false, $this->options);
             if (!$decoded instanceof \stdClass) {
                 throw new \RuntimeException('Unable to decode');
             }

507) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/DomainConverter.php:90    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.9bfb635d4c8ffd95076d37fb38ef6100.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function toJson(DomainObject $domainObject) : string
+    protected function toJson(DomainObject $domainObject) : string
     {
         try {
             $jsonData = (object) $domainObject->jsonSerialize();
             $schema = $this->dereferencer->dereference($jsonData->{'$schema'});
             $validator = new Validator($jsonData, $schema);
             if ($validator->fails()) {

508) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/DomainUriLoader.php:41    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.ba13f045d4b00f00081a6c7878da684b.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function add(string $schema, string $filename)
+    protected function add(string $schema, string $filename)
     {
         $this->mappings[$schema] = $filename;
     }
     public function load($path)
     {
         if (array_key_exists($path, $this->mappings)) {

509) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/DomainUriLoader.php:51    [M] FunctionCall
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.acb4d7d03490e15d1fe6b938f4bfe73b.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             $content = file_get_contents($this->mappings[$path]);
-            return json_decode($content);
+            json_decode($content);
+            return null;
         }
         throw SchemaLoadingException::notFound(sprintf('The schema "%s" is not supported.', $path));
     }
 }

510) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/DomainUriLoader.php:46    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.b202bf84894c10cbfb6e96c34ad4f1f9.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     }
-    public function load($path)
+    protected function load($path)
     {
         if (array_key_exists($path, $this->mappings)) {
             $content = file_get_contents($this->mappings[$path]);
             return json_decode($content);
         }
         throw SchemaLoadingException::notFound(sprintf('The schema "%s" is not supported.', $path));

511) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Event/Event.php:40    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.9998521e573a0bb047ff46cd5fd1e425.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (null === $recordedOn || null === $eventId) {
+        if (null !== $recordedOn || null === $eventId) {
             $this->recordedOn = new \DateTimeImmutable();
             $this->eventId = EventId::create(Uuid::uuid4()->toString());
         } else {
             $this->recordedOn = $recordedOn;
             $this->eventId = $eventId;
         }

512) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Event/Event.php:40    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.7c53cb6b024b1acebd337b866c1f7843.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (null === $recordedOn || null === $eventId) {
+        if (null === $recordedOn || null !== $eventId) {
             $this->recordedOn = new \DateTimeImmutable();
             $this->eventId = EventId::create(Uuid::uuid4()->toString());
         } else {
             $this->recordedOn = $recordedOn;
             $this->eventId = $eventId;
         }

513) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Event/Event.php:40    [M] LogicalOr
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.bdd87bfb17a0bb75901974ed8bd69e84.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (null === $recordedOn || null === $eventId) {
+        if (null === $recordedOn && null === $eventId) {
             $this->recordedOn = new \DateTimeImmutable();
             $this->eventId = EventId::create(Uuid::uuid4()->toString());
         } else {
             $this->recordedOn = $recordedOn;
             $this->eventId = $eventId;
         }

514) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Event/Event.php:38    [M] ProtectedVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.0ef00a39cc0d57a763370101de78e46b.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    protected function __construct(?\DateTimeImmutable $recordedOn, ?EventId $eventId)
+    private function __construct(?\DateTimeImmutable $recordedOn, ?EventId $eventId)
     {
         if (null === $recordedOn || null === $eventId) {
             $this->recordedOn = new \DateTimeImmutable();
             $this->eventId = EventId::create(Uuid::uuid4()->toString());
         } else {
             $this->recordedOn = $recordedOn;

515) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Event/Event.php:78    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.7edbc18dd855962c342ce279efc95d54.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getType() : string
+    protected function getType() : string
     {
         return get_class($this);
     }
     /**
      * {@inheritdoc}
      */

517) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Id/Id.php:28    [M] ProtectedVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.2f9f416bf92a405e3b5d01ae6b7269b2.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    protected function __construct(string $value)
+    private function __construct(string $value)
     {
         $this->value = $value;
     }
     /**
      * @return string
      */

518) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Id/Id.php:36    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.5c6c41b8e3beb4a48920935758e87b35.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getValue() : string
+    protected function getValue() : string
     {
         return $this->value;
     }
     /**
      * {@inheritdoc}
      */

521) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Response/OAuth2Exception.php:87    [M] NotIdentical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.465716b41752e502350e0993a437f1c4.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $this->data['error'] = $error;
-        if (null !== $errorDescription) {
+        if (null === $errorDescription) {
             $this->data['error_description'] = $errorDescription;
         }
         parent::__construct('', $code, $previous);
     }
     /**
      * @return array

522) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Response/OAuth2Exception.php:96    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.de11f11f4f39ed72965f6ebf58911264.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getData() : array
+    protected function getData() : array
     {
         return $this->data;
     }
 }

523) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Scope/Checker.php:24    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.4c1ead476a2e7d1fb313b971e12d9dc5.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (1 < count(array_keys($scopes, $scope))) {
+        if (0 < count(array_keys($scopes, $scope))) {
             throw new \InvalidArgumentException(sprintf('Scope "%s" appears more than once.', $scope));
         }
     }
     /**
      * @param string $scope
      *

524) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Scope/Checker.php:24    [M] LessThan
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.42d8d6b0951e4c56a291b82a960963ba.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (1 < count(array_keys($scopes, $scope))) {
+        if (1 <= count(array_keys($scopes, $scope))) {
             throw new \InvalidArgumentException(sprintf('Scope "%s" appears more than once.', $scope));
         }
     }
     /**
      * @param string $scope
      *

525) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Scope/Checker.php:24    [M] LessThanNegotiation
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.d69fecfd37d0437f7034254980008e15.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (1 < count(array_keys($scopes, $scope))) {
+        if (1 >= count(array_keys($scopes, $scope))) {
             throw new \InvalidArgumentException(sprintf('Scope "%s" appears more than once.', $scope));
         }
     }
     /**
      * @param string $scope
      *

526) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Scope/Checker.php:22    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.33c8670f2b9ebc5dca9967539d532c50.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public static function checkUsedOnce(string $scope, array $scopes)
+    protected static function checkUsedOnce(string $scope, array $scopes)
     {
         if (1 < count(array_keys($scopes, $scope))) {
             throw new \InvalidArgumentException(sprintf('Scope "%s" appears more than once.', $scope));
         }
     }
     /**
