527) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Scope/Checker.php:36    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.7f86d29ff8a36b3c54d031bda0454fc2.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (1 !== preg_match('/^[\\x20\\x23-\\x5B\\x5D-\\x7E]+$/', $scope)) {
+        if (0 !== preg_match('/^[\\x20\\x23-\\x5B\\x5D-\\x7E]+$/', $scope)) {
             throw new \InvalidArgumentException('Scope contains illegal characters.');
         }
     }
 }

528) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Scope/Checker.php:36    [M] NotIdentical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.b7bf9a047985468c0c4bda4f6c6ff01d.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (1 !== preg_match('/^[\\x20\\x23-\\x5B\\x5D-\\x7E]+$/', $scope)) {
+        if (1 === preg_match('/^[\\x20\\x23-\\x5B\\x5D-\\x7E]+$/', $scope)) {
             throw new \InvalidArgumentException('Scope contains illegal characters.');
         }
     }
 }

529) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Scope/Checker.php:34    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.6fe240e8173045e157b68d529e842643.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public static function checkCharset(string $scope)
+    protected static function checkCharset(string $scope)
     {
         if (1 !== preg_match('/^[\\x20\\x23-\\x5B\\x5D-\\x7E]+$/', $scope)) {
             throw new \InvalidArgumentException('Scope contains illegal characters.');
         }
     }
 }

531) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Scope/DefaultScopePolicy.php:46    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.b0ebb8ed0e517e9531bdb6e991053eb9.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function applyScopePolicy(array $scope, Client $client) : array
+    protected function applyScopePolicy(array $scope, Client $client) : array
     {
         return $client->has('default_scope') ? explode(' ', $client->get('default_scope')) : $this->getDefaultScopes();
     }
     /**
      * @return string[]
      */

536) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Scope/ScopePolicyManager.php:41    [M] TrueValue
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.78ada8d65e6465a786f0183f188b8f3e.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $this->scopePolicies[$name] = $scopePolicy;
-        if (true === $isDefault || 1 === count($this->scopePolicies)) {
+        if (false === $isDefault || 1 === count($this->scopePolicies)) {
             $this->defaultScopePolicy = $name;
         }
         return $this;
     }
     /**
      * @param array  $scope

537) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Scope/ScopePolicyManager.php:41    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.bd8547fe7d0db01cc32fa383e06ce89d.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $this->scopePolicies[$name] = $scopePolicy;
-        if (true === $isDefault || 1 === count($this->scopePolicies)) {
+        if (true !== $isDefault || 1 === count($this->scopePolicies)) {
             $this->defaultScopePolicy = $name;
         }
         return $this;
     }
     /**
      * @param array  $scope

538) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Scope/ScopePolicyManager.php:41    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.84992a74537cc2d0ede318078e972dd8.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $this->scopePolicies[$name] = $scopePolicy;
-        if (true === $isDefault || 1 === count($this->scopePolicies)) {
+        if (true === $isDefault || 0 === count($this->scopePolicies)) {
             $this->defaultScopePolicy = $name;
         }
         return $this;
     }
     /**
      * @param array  $scope

539) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Scope/ScopePolicyManager.php:41    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.24290f2f2e1bb5370458128b609c3e0e.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $this->scopePolicies[$name] = $scopePolicy;
-        if (true === $isDefault || 1 === count($this->scopePolicies)) {
+        if (true === $isDefault || 1 !== count($this->scopePolicies)) {
             $this->defaultScopePolicy = $name;
         }
         return $this;
     }
     /**
      * @param array  $scope

540) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Scope/ScopePolicyManager.php:41    [M] LogicalOr
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.c7e301b6ea835983ec54b050730edc06.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $this->scopePolicies[$name] = $scopePolicy;
-        if (true === $isDefault || 1 === count($this->scopePolicies)) {
+        if (true === $isDefault && 1 === count($this->scopePolicies)) {
             $this->defaultScopePolicy = $name;
         }
         return $this;
     }
     /**
      * @param array  $scope

541) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Scope/ScopePolicyManager.php:36    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.e678624e10fae5d848b496cdaf5b1cd2.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function add(ScopePolicy $scopePolicy, bool $isDefault = false) : self
+    protected function add(ScopePolicy $scopePolicy, bool $isDefault = false) : self
     {
         $name = $scopePolicy->name();
         $this->scopePolicies[$name] = $scopePolicy;
         if (true === $isDefault || 1 === count($this->scopePolicies)) {
             $this->defaultScopePolicy = $name;
         }

542) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Scope/ScopePolicyManager.php:59    [M] NotIdentical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.292b3678290ff5a445c49e87e65de3a7.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             $policy = $this->getForClient($client);
-            if (null !== $policy) {
+            if (null === $policy) {
                 return $policy->applyScopePolicy($scope, $client);
             }
         }
         return $scope;
     }
     /**

543) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Scope/ScopePolicyManager.php:54    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.8cf081dd534c7539e870a51cceee66c0.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function apply(array $scope, Client $client) : array
+    protected function apply(array $scope, Client $client) : array
     {
         if (empty($scope)) {
             $policy = $this->getForClient($client);
             if (null !== $policy) {
                 return $policy->applyScopePolicy($scope, $client);
             }

545) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Scope/ScopePolicyManager.php:80    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.f1a69b8c7bb61758f0c45fc00a17a01b.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function has(string $scopePolicy) : bool
+    protected function has(string $scopePolicy) : bool
     {
         return array_key_exists($scopePolicy, $this->scopePolicies);
     }
     /**
      * @param string $scopePolicyName
      *

546) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Scope/ScopePolicyManager.php:92    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.828bd71b00099c3c1e13eb7d1146b059.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (!$this->has($scopePolicyName)) {
+        if ($this->has($scopePolicyName)) {
             throw new \InvalidArgumentException(sprintf('The scope policy with name "%s" is not supported', $scopePolicyName));
         }
         return $this->scopePolicies[$scopePolicyName];
     }
     /**
      * @return ScopePolicy|null

547) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Scope/ScopePolicyManager.php:104    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.111b7717287cff5f33791050b0aa432d.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (null === $this->defaultScopePolicy) {
+        if (null !== $this->defaultScopePolicy) {
             return null;
         }
         return $this->scopePolicies[$this->defaultScopePolicy];
     }
     /**
      * @param Client $client

548) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Scope/ScopePolicyManager.php:118    [M] LogicalAnd
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.823f7da79164fcfaef677667250ee2cb.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if ($client->has('scope_policy') && $this->has($client->get('scope_policy'))) {
+        if ($client->has('scope_policy') || $this->has($client->get('scope_policy'))) {
             $policyName = $client->get('scope_policy');
             return $this->get($policyName);
         }
         return $this->default();
     }
 }

549) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Token/Token.php:71    [M] ProtectedVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.60990b42474c5bec95d5635be21c1939.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    protected function __construct()
+    private function __construct()
     {
         $this->parameters = DataBag::create([]);
         $this->metadatas = DataBag::create([]);
     }
     /**
      * @return TokenId

552) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Token/Token.php:103    [M] LessThan
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.4347b960502f156c4e586318cc05e0cb.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        return $this->expiresAt->getTimestamp() < time();
+        return $this->expiresAt->getTimestamp() <= time();
     }
     /**
      * {@inheritdoc}
      */
     public function getExpiresIn() : int
     {

553) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Token/Token.php:103    [M] LessThanNegotiation
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.89d7f5dc77e9f4c794dbd458168aeef9.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        return $this->expiresAt->getTimestamp() < time();
+        return $this->expiresAt->getTimestamp() >= time();
     }
     /**
      * {@inheritdoc}
      */
     public function getExpiresIn() : int
     {

554) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Token/Token.php:101    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.27fa288e5ee709d9e2f8267e039b5861.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function hasExpired() : bool
+    protected function hasExpired() : bool
     {
         return $this->expiresAt->getTimestamp() < time();
     }
     /**
      * {@inheritdoc}
      */

555) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Token/Token.php:112    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.4fd90daee1f65d68d5065efaf909aa10.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $expiresAt = $this->expiresAt;
-        if (null === $expiresAt) {
+        if (null !== $expiresAt) {
             return 0;
         }
         return $this->expiresAt->getTimestamp() - time() < 0 ? 0 : $this->expiresAt->getTimestamp() - time();
     }
     /**
      * @return ClientId

556) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Token/Token.php:116    [M] Minus
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.4173ea0da2e683eca4b80b93af8caf47.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        return $this->expiresAt->getTimestamp() - time() < 0 ? 0 : $this->expiresAt->getTimestamp() - time();
+        return $this->expiresAt->getTimestamp() + time() < 0 ? 0 : $this->expiresAt->getTimestamp() - time();
     }
     /**
      * @return ClientId
      */
     public function getClientId() : ClientId
     {

557) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Token/Token.php:116    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.2ba767bef8eee49c74ead3de913a68c1.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        return $this->expiresAt->getTimestamp() - time() < 0 ? 0 : $this->expiresAt->getTimestamp() - time();
+        return $this->expiresAt->getTimestamp() - time() < 1 ? 0 : $this->expiresAt->getTimestamp() - time();
     }
     /**
      * @return ClientId
      */
     public function getClientId() : ClientId
     {

558) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Token/Token.php:116    [M] LessThan
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.b811dacc484d1ce83acdf9a38e4dc396.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        return $this->expiresAt->getTimestamp() - time() < 0 ? 0 : $this->expiresAt->getTimestamp() - time();
+        return $this->expiresAt->getTimestamp() - time() <= 0 ? 0 : $this->expiresAt->getTimestamp() - time();
     }
     /**
      * @return ClientId
      */
     public function getClientId() : ClientId
     {

559) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Token/Token.php:116    [M] LessThanNegotiation
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.8efd02bd73acd758ff449536bb00a887.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        return $this->expiresAt->getTimestamp() - time() < 0 ? 0 : $this->expiresAt->getTimestamp() - time();
+        return $this->expiresAt->getTimestamp() - time() >= 0 ? 0 : $this->expiresAt->getTimestamp() - time();
     }
     /**
      * @return ClientId
      */
     public function getClientId() : ClientId
     {

560) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Token/Token.php:116    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.d260c8e322fb9147c20a9520e1d96eae.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        return $this->expiresAt->getTimestamp() - time() < 0 ? 0 : $this->expiresAt->getTimestamp() - time();
+        return $this->expiresAt->getTimestamp() - time() < 0 ? 1 : $this->expiresAt->getTimestamp() - time();
     }
     /**
      * @return ClientId
      */
     public function getClientId() : ClientId
     {

561) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Token/Token.php:116    [M] Minus
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.84b4426ac0e45a6776ad71d3e6834bd5.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        return $this->expiresAt->getTimestamp() - time() < 0 ? 0 : $this->expiresAt->getTimestamp() - time();
+        return $this->expiresAt->getTimestamp() - time() < 0 ? 0 : $this->expiresAt->getTimestamp() + time();
     }
     /**
      * @return ClientId
      */
     public function getClientId() : ClientId
     {

562) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Token/Token.php:109    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.ebb72dfb67d788e541fcdc6c10a06e04.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getExpiresIn() : int
+    protected function getExpiresIn() : int
     {
         $expiresAt = $this->expiresAt;
         if (null === $expiresAt) {
             return 0;
         }
         return $this->expiresAt->getTimestamp() - time() < 0 ? 0 : $this->expiresAt->getTimestamp() - time();

566) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Token/Token.php:158    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.e33ee38050bf40463f783299e8a36551.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function hasParameter(string $key) : bool
+    protected function hasParameter(string $key) : bool
     {
         return $this->parameters->has($key);
     }
     /**
      * @return bool
      */

568) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Token/Token.php:180    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.870c3071e1067a2dc92c4f79db44fc14.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (!$this->hasParameter($key)) {
+        if ($this->hasParameter($key)) {
             throw new \InvalidArgumentException(sprintf('The parameter "%s" does not exist.', $key));
         }
         return $this->parameters->get($key);
     }
     /**
      * @return DataBag

569) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Token/Token.php:178    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.c45b7f84a867487ab257e5f5c3e342eb.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getParameter(string $key)
+    protected function getParameter(string $key)
     {
         if (!$this->hasParameter($key)) {
             throw new \InvalidArgumentException(sprintf('The parameter "%s" does not exist.', $key));
         }
         return $this->parameters->get($key);
     }

578) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/ImplicitGrant/ImplicitGrantType.php:89    [M] Foreach_
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.a40fd982a1b3434f9097dda14448468d.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $this->accessTokenRepository->save($accessToken);
-        foreach ($accessToken->getResponseData() as $k => $v) {
+        foreach (array() as $k => $v) {
             $authorization = $authorization->withResponseParameter($k, $v);
         }
         return $next($authorization);
     }
     /**
      * {@inheritdoc}

585) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/IssuerDiscoveryEndpoint/IssuerDiscoveryEndpoint.php:75    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.ae1ab3fa92e9479f34f32c090c825472.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             $resource = $this->resourceManager->find($resourceName);
-            if (null === $resource) {
+            if (null !== $resource) {
                 throw new \InvalidArgumentException(sprintf('The resource with name "%s" does not exist or is not supported by this server.', $resourceName), 400);
             }
             $data = $this->getResourceData($resourceName, $resource);
             $response = $this->responseFactory->createResponse(200);
             $headers = ['Content-Type' => 'application/jrd+json; charset=UTF-8'];
             $response->getBody()->write(json_encode($data, JSON_UNESCAPED_UNICODE | JSON_UNESCAPED_SLASHES));

586) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/IssuerDiscoveryEndpoint/IssuerDiscoveryEndpoint.php:83    [M] BitwiseOr
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.6b97d1c7bc0c77892e590804fa08741f.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             $headers = ['Content-Type' => 'application/jrd+json; charset=UTF-8'];
-            $response->getBody()->write(json_encode($data, JSON_UNESCAPED_UNICODE | JSON_UNESCAPED_SLASHES));
+            $response->getBody()->write(json_encode($data, JSON_UNESCAPED_UNICODE & JSON_UNESCAPED_SLASHES));
         } catch (\InvalidArgumentException $e) {
             $response = $this->responseFactory->createResponse($e->getCode());
             $headers = ['Content-Type' => 'application/json; charset=UTF-8'];
             $response->getBody()->write(json_encode(['error' => OAuth2Exception::ERROR_INVALID_REQUEST, 'error_description' => $e->getMessage()], JSON_UNESCAPED_UNICODE | JSON_UNESCAPED_SLASHES));
         }
         $headers['Cache-Control'] = 'no-cache, no-store, max-age=0, must-revalidate, private';

587) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/IssuerDiscoveryEndpoint/IssuerDiscoveryEndpoint.php:89    [M] BitwiseOr
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.55d7e5a3770f26d9ba8473e850125563.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             $headers = ['Content-Type' => 'application/json; charset=UTF-8'];
-            $response->getBody()->write(json_encode(['error' => OAuth2Exception::ERROR_INVALID_REQUEST, 'error_description' => $e->getMessage()], JSON_UNESCAPED_UNICODE | JSON_UNESCAPED_SLASHES));
+            $response->getBody()->write(json_encode(['error' => OAuth2Exception::ERROR_INVALID_REQUEST, 'error_description' => $e->getMessage()], JSON_UNESCAPED_UNICODE & JSON_UNESCAPED_SLASHES));
         }
         $headers['Cache-Control'] = 'no-cache, no-store, max-age=0, must-revalidate, private';
         $headers['Pragma'] = 'no-cache';
         foreach ($headers as $k => $v) {
             $response = $response->withHeader($k, $v);
         }

588) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/IssuerDiscoveryEndpoint/IssuerDiscoveryEndpoint.php:93    [M] Foreach_
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.697d86ff3259382bfa884d77d5370d1e.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $headers['Pragma'] = 'no-cache';
-        foreach ($headers as $k => $v) {
+        foreach (array() as $k => $v) {
             $response = $response->withHeader($k, $v);
         }
         return $response;
     }
     /**
      * @param ResourceId $resourceName

589) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/IssuerDiscoveryEndpoint/IssuerDiscoveryEndpoint.php:69    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.331a1a85ec052355138dd7c8cddc5c0d.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function process(ServerRequestInterface $request, RequestHandlerInterface $handler) : ResponseInterface
+    protected function process(ServerRequestInterface $request, RequestHandlerInterface $handler) : ResponseInterface
     {
         try {
             $this->checkRel($request);
             $resourceName = $this->getResourceName($request);
             $resource = $this->resourceManager->find($resourceName);
             if (null === $resource) {

590) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/IssuerDiscoveryEndpoint/IssuerDiscoveryEndpoint.php:127    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.3fdadce8b906b25b0cf168022698af4e.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $query_params = $request->getQueryParams() ?? [];
-        if (!array_key_exists('rel', $query_params)) {
+        if (array_key_exists('rel', $query_params)) {
             throw new \InvalidArgumentException('The parameter "rel" is mandatory.', 400);
         }
         if (self::REL_NAME !== $query_params['rel']) {
             throw new \InvalidArgumentException('Unsupported "rel" parameter value.', 400);
         }
     }

591) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/IssuerDiscoveryEndpoint/IssuerDiscoveryEndpoint.php:130    [M] NotIdentical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.3280ecef391b5f7cd94561284661a439.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        if (self::REL_NAME !== $query_params['rel']) {
+        if (self::REL_NAME === $query_params['rel']) {
             throw new \InvalidArgumentException('Unsupported "rel" parameter value.', 400);
         }
     }
     /**
      * @param ServerRequestInterface $request
      *
