592) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/IssuerDiscoveryEndpoint/IssuerDiscoveryEndpoint.php:145    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.ce3a899104e61cacd70a25a2df91a060.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $query_params = $request->getQueryParams() ?? [];
-        if (!array_key_exists('resource', $query_params)) {
+        if (array_key_exists('resource', $query_params)) {
             throw new \InvalidArgumentException('The parameter "resource" is mandatory.', 400);
         }
         $resourceName = $query_params['resource'];
         $domain = $this->findResourceNameDomain($resourceName);
         if ($domain !== $this->host) {
             throw new \InvalidArgumentException('Unsupported domain.', 400);

593) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/IssuerDiscoveryEndpoint/IssuerDiscoveryEndpoint.php:150    [M] NotIdentical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.9381c5c802a51e5c6800c355b90dbc00.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $domain = $this->findResourceNameDomain($resourceName);
-        if ($domain !== $this->host) {
+        if ($domain === $this->host) {
             throw new \InvalidArgumentException('Unsupported domain.', 400);
         }
         return ResourceId::create($resourceName);
     }
     /**
      * @param string $resourceName

594) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/IssuerDiscoveryEndpoint/IssuerDiscoveryEndpoint.php:166    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.171994aafa7d8e897d11342f049b8243.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if ('acct:' === mb_substr($resourceName, 0, 5, 'utf-8')) {
+        if ('acct:' === mb_substr($resourceName, 1, 5, 'utf-8')) {
             $resourceName = mb_substr($resourceName, 5, null, 'utf-8');
         }
         $at = mb_strpos($resourceName, '@', 0, 'utf-8');
         if (false === $at) {
             $uri = $this->uriFactory->createUri($resourceName);
             return $this->getDomain($uri);

595) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/IssuerDiscoveryEndpoint/IssuerDiscoveryEndpoint.php:166    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.82de72b6a406463c5af9b67940a63de5.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if ('acct:' === mb_substr($resourceName, 0, 5, 'utf-8')) {
+        if ('acct:' !== mb_substr($resourceName, 0, 5, 'utf-8')) {
             $resourceName = mb_substr($resourceName, 5, null, 'utf-8');
         }
         $at = mb_strpos($resourceName, '@', 0, 'utf-8');
         if (false === $at) {
             $uri = $this->uriFactory->createUri($resourceName);
             return $this->getDomain($uri);

596) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/IssuerDiscoveryEndpoint/IssuerDiscoveryEndpoint.php:170    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.5ea1ea49f80014312edb3a26ae12eb3e.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        $at = mb_strpos($resourceName, '@', 0, 'utf-8');
+        $at = mb_strpos($resourceName, '@', 1, 'utf-8');
         if (false === $at) {
             $uri = $this->uriFactory->createUri($resourceName);
             return $this->getDomain($uri);
         }
         return $this->getDomainFromEmailResource($resourceName, $at);
     }

597) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/IssuerDiscoveryEndpoint/IssuerDiscoveryEndpoint.php:172    [M] FalseValue
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.d6410a3ec650cd780cf2de9c1c0819b1.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $at = mb_strpos($resourceName, '@', 0, 'utf-8');
-        if (false === $at) {
+        if (true === $at) {
             $uri = $this->uriFactory->createUri($resourceName);
             return $this->getDomain($uri);
         }
         return $this->getDomainFromEmailResource($resourceName, $at);
     }
     /**

598) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/IssuerDiscoveryEndpoint/IssuerDiscoveryEndpoint.php:172    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.792c71456b18919acc45378685bab387.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $at = mb_strpos($resourceName, '@', 0, 'utf-8');
-        if (false === $at) {
+        if (false !== $at) {
             $uri = $this->uriFactory->createUri($resourceName);
             return $this->getDomain($uri);
         }
         return $this->getDomainFromEmailResource($resourceName, $at);
     }
     /**

599) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/IssuerDiscoveryEndpoint/IssuerDiscoveryEndpoint.php:189    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.97f9eaa5ba16a1ec9565e938d0f1070b.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (0 === $at) {
+        if (1 === $at) {
             throw new \InvalidArgumentException('Unsupported Extensible Resource Identifier (XRI) resource value.', 400);
         }
         list(, $domain) = explode('@', $resourceName);
         return $domain;
     }
     /**

600) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/IssuerDiscoveryEndpoint/IssuerDiscoveryEndpoint.php:189    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.e1713a9f326c62094385c157fc7c7f95.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (0 === $at) {
+        if (0 !== $at) {
             throw new \InvalidArgumentException('Unsupported Extensible Resource Identifier (XRI) resource value.', 400);
         }
         list(, $domain) = explode('@', $resourceName);
         return $domain;
     }
     /**

601) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/IssuerDiscoveryEndpoint/IssuerDiscoveryEndpoint.php:207    [M] NotIdentical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.be2da0fe2bd047f1d594ad31893080ea.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $host = $uri->getHost();
-        if (null !== $uri->getPort()) {
+        if (null === $uri->getPort()) {
             $host = sprintf('%s:%d', $host, $uri->getPort());
         }
         return $host;
     }
 }

604) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/JwtBearerGrant/JwtBearerGrantType.php:119    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.8c658746d7c6d8c663f0cb24ea6dd2a4.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function enableEncryptedAssertions(JweCompactSerializer $jweSerializer, JWEDecrypter $jweDecrypter, JWKSet $keyEncryptionKeySet, bool $encryptionRequired)
+    protected function enableEncryptedAssertions(JweCompactSerializer $jweSerializer, JWEDecrypter $jweDecrypter, JWKSet $keyEncryptionKeySet, bool $encryptionRequired)
     {
         $this->jweSerializer = $jweSerializer;
         $this->jweDecrypter = $jweDecrypter;
         $this->encryptionRequired = $encryptionRequired;
         $this->keyEncryptionKeySet = $keyEncryptionKeySet;
     }

608) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/JwtBearerGrant/JwtBearerGrantType.php:160    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.91f27613dc3a07450e519ee33dc14911.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             $jws = $this->jwsSerializer->unserialize($assertion);
-            if (1 !== $jws->countSignatures()) {
+            if (0 !== $jws->countSignatures()) {
                 throw new \InvalidArgumentException('The assertion must have only one signature.');
             }
             $claims = json_decode($jws->getPayload(), true);
             $claims = $this->claimCheckerManager->check($claims);
             foreach (['iss', 'sub'] as $claim) {
                 if (!array_key_exists($claim, $claims)) {

609) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/JwtBearerGrant/JwtBearerGrantType.php:160    [M] NotIdentical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.23cb61fb603ded1f3352639b61890376.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             $jws = $this->jwsSerializer->unserialize($assertion);
-            if (1 !== $jws->countSignatures()) {
+            if (1 === $jws->countSignatures()) {
                 throw new \InvalidArgumentException('The assertion must have only one signature.');
             }
             $claims = json_decode($jws->getPayload(), true);
             $claims = $this->claimCheckerManager->check($claims);
             foreach (['iss', 'sub'] as $claim) {
                 if (!array_key_exists($claim, $claims)) {

610) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/JwtBearerGrant/JwtBearerGrantType.php:163    [M] TrueValue
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.41d18846c8b72f33b42362a0f654ff2c.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             }
-            $claims = json_decode($jws->getPayload(), true);
+            $claims = json_decode($jws->getPayload(), false);
             $claims = $this->claimCheckerManager->check($claims);
             foreach (['iss', 'sub'] as $claim) {
                 if (!array_key_exists($claim, $claims)) {
                     throw new \InvalidArgumentException(sprintf('The assertion must contain the claim member "%s".', $claim));
                 }
             }

611) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/JwtBearerGrant/JwtBearerGrantType.php:166    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.e621145a2f0b738220137e08a5ba7a7d.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             foreach (['iss', 'sub'] as $claim) {
-                if (!array_key_exists($claim, $claims)) {
+                if (array_key_exists($claim, $claims)) {
                     throw new \InvalidArgumentException(sprintf('The assertion must contain the claim member "%s".', $claim));
                 }
             }
             $grantTypeData = $this->checkJWTSignature($grantTypeData, $jws, $claims);
         } catch (OAuth2Exception $e) {
             throw $e;

612) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/JwtBearerGrant/JwtBearerGrantType.php:165    [M] Foreach_
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.8cfd758a0fd942caa7098faf849e4124.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             $claims = $this->claimCheckerManager->check($claims);
-            foreach (['iss', 'sub'] as $claim) {
+            foreach (array() as $claim) {
                 if (!array_key_exists($claim, $claims)) {
                     throw new \InvalidArgumentException(sprintf('The assertion must contain the claim member "%s".', $claim));
                 }
             }
             $grantTypeData = $this->checkJWTSignature($grantTypeData, $jws, $claims);
         } catch (OAuth2Exception $e) {

614) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/JwtBearerGrant/JwtBearerGrantType.php:189    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.110c59c52f3bb09ddcc2338d7c95e24b.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (null === $this->jweDecrypter) {
+        if (null !== $this->jweDecrypter) {
             return $assertion;
         }
         try {
             $jwe = $this->jweSerializer->unserialize($assertion);
             if (1 !== $jwe->countRecipients()) {
                 throw new \InvalidArgumentException('The assertion must have only one recipient.');

615) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/JwtBearerGrant/JwtBearerGrantType.php:195    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.fb0325253f0869e648c9f2381bc35b5e.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             $jwe = $this->jweSerializer->unserialize($assertion);
-            if (1 !== $jwe->countRecipients()) {
+            if (0 !== $jwe->countRecipients()) {
                 throw new \InvalidArgumentException('The assertion must have only one recipient.');
             }
             if (true === $this->jweDecrypter->decryptUsingKeySet($jwe, $this->keyEncryptionKeySet, 0)) {
                 return $jwe->getPayload();
             }
             throw new \InvalidArgumentException('Unable to decrypt the assertion.');

616) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/JwtBearerGrant/JwtBearerGrantType.php:195    [M] NotIdentical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.9b131052e32c8a8dbe57cd606094496a.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             $jwe = $this->jweSerializer->unserialize($assertion);
-            if (1 !== $jwe->countRecipients()) {
+            if (1 === $jwe->countRecipients()) {
                 throw new \InvalidArgumentException('The assertion must have only one recipient.');
             }
             if (true === $this->jweDecrypter->decryptUsingKeySet($jwe, $this->keyEncryptionKeySet, 0)) {
                 return $jwe->getPayload();
             }
             throw new \InvalidArgumentException('Unable to decrypt the assertion.');

617) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/JwtBearerGrant/JwtBearerGrantType.php:198    [M] TrueValue
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.a8412c21766a0bce748863de23863c18.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             }
-            if (true === $this->jweDecrypter->decryptUsingKeySet($jwe, $this->keyEncryptionKeySet, 0)) {
+            if (false === $this->jweDecrypter->decryptUsingKeySet($jwe, $this->keyEncryptionKeySet, 0)) {
                 return $jwe->getPayload();
             }
             throw new \InvalidArgumentException('Unable to decrypt the assertion.');
         } catch (\Exception $e) {
             if (true === $this->encryptionRequired) {
                 throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, $e->getMessage(), [], $e);

618) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/JwtBearerGrant/JwtBearerGrantType.php:198    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.5a8f9372a41dc67e1f84a9f1fbf07f7f.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             }
-            if (true === $this->jweDecrypter->decryptUsingKeySet($jwe, $this->keyEncryptionKeySet, 0)) {
+            if (true === $this->jweDecrypter->decryptUsingKeySet($jwe, $this->keyEncryptionKeySet, 1)) {
                 return $jwe->getPayload();
             }
             throw new \InvalidArgumentException('Unable to decrypt the assertion.');
         } catch (\Exception $e) {
             if (true === $this->encryptionRequired) {
                 throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, $e->getMessage(), [], $e);

619) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/JwtBearerGrant/JwtBearerGrantType.php:198    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.825ed22e20005be8492e2117716e4e56.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             }
-            if (true === $this->jweDecrypter->decryptUsingKeySet($jwe, $this->keyEncryptionKeySet, 0)) {
+            if (true !== $this->jweDecrypter->decryptUsingKeySet($jwe, $this->keyEncryptionKeySet, 0)) {
                 return $jwe->getPayload();
             }
             throw new \InvalidArgumentException('Unable to decrypt the assertion.');
         } catch (\Exception $e) {
             if (true === $this->encryptionRequired) {
                 throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, $e->getMessage(), [], $e);

620) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/JwtBearerGrant/JwtBearerGrantType.php:204    [M] TrueValue
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.35c71f6c15774d871db359c9681d2553.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         } catch (\Exception $e) {
-            if (true === $this->encryptionRequired) {
+            if (false === $this->encryptionRequired) {
                 throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, $e->getMessage(), [], $e);
             }
             return $assertion;
         }
     }
     /**

621) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/JwtBearerGrant/JwtBearerGrantType.php:204    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.e4aa0b1049e892032967b72601011367.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         } catch (\Exception $e) {
-            if (true === $this->encryptionRequired) {
+            if (true !== $this->encryptionRequired) {
                 throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, $e->getMessage(), [], $e);
             }
             return $assertion;
         }
     }
     /**

623) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/JwtBearerGrant/JwtBearerGrantType.php:235    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.99435a4d8e2a961465867a5676e3ee6a.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $sub = $claims['sub'];
-        if ($iss === $sub) {
+        if ($iss !== $sub) {
             // The issuer is the resource owner
             $client = $this->clientRepository->find(ClientId::create($iss));
             if (null === $client || true === $client->isDeleted()) {
                 throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_GRANT, 'Unable to find the issuer of the assertion.');
             }
             if (null === $grantTypeData->getClient()) {

624) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/JwtBearerGrant/JwtBearerGrantType.php:237    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.ebc096e2fa34df021e734f33622349a7.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             $client = $this->clientRepository->find(ClientId::create($iss));
-            if (null === $client || true === $client->isDeleted()) {
+            if (null !== $client || true === $client->isDeleted()) {
                 throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_GRANT, 'Unable to find the issuer of the assertion.');
             }
             if (null === $grantTypeData->getClient()) {
                 $grantTypeData = $grantTypeData->withClient($client);
             } elseif ($grantTypeData->getClient()->getPublicId()->getValue() !== $client->getPublicId()->getValue()) {
                 throw new OAuth2Exception(401, OAuth2Exception::ERROR_INVALID_CLIENT, 'Client authentication failed.');

625) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/JwtBearerGrant/JwtBearerGrantType.php:237    [M] TrueValue
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.f71855810d8a5e0522c91649b7d4b8d7.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             $client = $this->clientRepository->find(ClientId::create($iss));
-            if (null === $client || true === $client->isDeleted()) {
+            if (null === $client || false === $client->isDeleted()) {
                 throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_GRANT, 'Unable to find the issuer of the assertion.');
             }
             if (null === $grantTypeData->getClient()) {
                 $grantTypeData = $grantTypeData->withClient($client);
             } elseif ($grantTypeData->getClient()->getPublicId()->getValue() !== $client->getPublicId()->getValue()) {
                 throw new OAuth2Exception(401, OAuth2Exception::ERROR_INVALID_CLIENT, 'Client authentication failed.');

626) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/JwtBearerGrant/JwtBearerGrantType.php:237    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.2a3de15182f7a6ea04b5c19548b20e19.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             $client = $this->clientRepository->find(ClientId::create($iss));
-            if (null === $client || true === $client->isDeleted()) {
+            if (null === $client || true !== $client->isDeleted()) {
                 throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_GRANT, 'Unable to find the issuer of the assertion.');
             }
             if (null === $grantTypeData->getClient()) {
                 $grantTypeData = $grantTypeData->withClient($client);
             } elseif ($grantTypeData->getClient()->getPublicId()->getValue() !== $client->getPublicId()->getValue()) {
                 throw new OAuth2Exception(401, OAuth2Exception::ERROR_INVALID_CLIENT, 'Client authentication failed.');

627) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/JwtBearerGrant/JwtBearerGrantType.php:237    [M] LogicalOr
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.8a6d51e53352fe0c05df33cc11c8d37a.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             $client = $this->clientRepository->find(ClientId::create($iss));
-            if (null === $client || true === $client->isDeleted()) {
+            if (null === $client && true === $client->isDeleted()) {
                 throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_GRANT, 'Unable to find the issuer of the assertion.');
             }
             if (null === $grantTypeData->getClient()) {
                 $grantTypeData = $grantTypeData->withClient($client);
             } elseif ($grantTypeData->getClient()->getPublicId()->getValue() !== $client->getPublicId()->getValue()) {
                 throw new OAuth2Exception(401, OAuth2Exception::ERROR_INVALID_CLIENT, 'Client authentication failed.');

628) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/JwtBearerGrant/JwtBearerGrantType.php:240    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.2bab956618a5fed5a18396321d2254a5.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             }
-            if (null === $grantTypeData->getClient()) {
+            if (null !== $grantTypeData->getClient()) {
                 $grantTypeData = $grantTypeData->withClient($client);
             } elseif ($grantTypeData->getClient()->getPublicId()->getValue() !== $client->getPublicId()->getValue()) {
                 throw new OAuth2Exception(401, OAuth2Exception::ERROR_INVALID_CLIENT, 'Client authentication failed.');
             }
             $grantTypeData = $grantTypeData->withResourceOwnerId($client->getPublicId());
             $allowedSignatureAlgorithms = $this->jwsVerifier->getSignatureAlgorithmManager()->list();

629) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/JwtBearerGrant/JwtBearerGrantType.php:253    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.e7ad73eb3f18e9123bd750944e980580.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             $resourceOwnerId = $this->findResourceOwner($sub);
-            if (null === $resourceOwnerId) {
+            if (null !== $resourceOwnerId) {
                 throw new \InvalidArgumentException(sprintf('Unknown resource owner with ID "%s"', $sub));
             }
             $grantTypeData = $grantTypeData->withResourceOwnerId($resourceOwnerId);
         } else {
             throw new \InvalidArgumentException('Unable to find the issuer of the assertion.');
         }

630) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/JwtBearerGrant/JwtBearerGrantType.php:261    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.e9dd58f911db8acbc536e9e3273b1328.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        if (!$jws->getSignature(0)->hasProtectedHeaderParameter('alg') || !in_array($jws->getSignature(0)->getProtectedHeaderParameter('alg'), $allowedSignatureAlgorithms)) {
+        if (!$jws->getSignature(1)->hasProtectedHeaderParameter('alg') || !in_array($jws->getSignature(0)->getProtectedHeaderParameter('alg'), $allowedSignatureAlgorithms)) {
             throw new \InvalidArgumentException(sprintf('The signature algorithm "%s" is not allowed.', $jws->getSignature(0)->getProtectedHeaderParameter('alg')));
         }
         $this->jwsVerifier->verifyWithKeySet($jws, $signatureKeys, 0);
         $grantTypeData = $grantTypeData->withMetadata('jwt', $jws);
         $grantTypeData = $grantTypeData->withMetadata('claims', $claims);
         return $grantTypeData;
