631) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/JwtBearerGrant/JwtBearerGrantType.php:261    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.0232c5574cbe8a05c08045d1ab9dc583.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        if (!$jws->getSignature(0)->hasProtectedHeaderParameter('alg') || !in_array($jws->getSignature(0)->getProtectedHeaderParameter('alg'), $allowedSignatureAlgorithms)) {
+        if ($jws->getSignature(0)->hasProtectedHeaderParameter('alg') || !in_array($jws->getSignature(0)->getProtectedHeaderParameter('alg'), $allowedSignatureAlgorithms)) {
             throw new \InvalidArgumentException(sprintf('The signature algorithm "%s" is not allowed.', $jws->getSignature(0)->getProtectedHeaderParameter('alg')));
         }
         $this->jwsVerifier->verifyWithKeySet($jws, $signatureKeys, 0);
         $grantTypeData = $grantTypeData->withMetadata('jwt', $jws);
         $grantTypeData = $grantTypeData->withMetadata('claims', $claims);
         return $grantTypeData;

632) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/JwtBearerGrant/JwtBearerGrantType.php:261    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.d0785086df7ae5551bba1a966feb9dd8.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        if (!$jws->getSignature(0)->hasProtectedHeaderParameter('alg') || !in_array($jws->getSignature(0)->getProtectedHeaderParameter('alg'), $allowedSignatureAlgorithms)) {
+        if (!$jws->getSignature(0)->hasProtectedHeaderParameter('alg') || !in_array($jws->getSignature(1)->getProtectedHeaderParameter('alg'), $allowedSignatureAlgorithms)) {
             throw new \InvalidArgumentException(sprintf('The signature algorithm "%s" is not allowed.', $jws->getSignature(0)->getProtectedHeaderParameter('alg')));
         }
         $this->jwsVerifier->verifyWithKeySet($jws, $signatureKeys, 0);
         $grantTypeData = $grantTypeData->withMetadata('jwt', $jws);
         $grantTypeData = $grantTypeData->withMetadata('claims', $claims);
         return $grantTypeData;

633) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/JwtBearerGrant/JwtBearerGrantType.php:261    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.57b13198d40dfdf5344dd59c0742d61b.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        if (!$jws->getSignature(0)->hasProtectedHeaderParameter('alg') || !in_array($jws->getSignature(0)->getProtectedHeaderParameter('alg'), $allowedSignatureAlgorithms)) {
+        if (!$jws->getSignature(0)->hasProtectedHeaderParameter('alg') || in_array($jws->getSignature(0)->getProtectedHeaderParameter('alg'), $allowedSignatureAlgorithms)) {
             throw new \InvalidArgumentException(sprintf('The signature algorithm "%s" is not allowed.', $jws->getSignature(0)->getProtectedHeaderParameter('alg')));
         }
         $this->jwsVerifier->verifyWithKeySet($jws, $signatureKeys, 0);
         $grantTypeData = $grantTypeData->withMetadata('jwt', $jws);
         $grantTypeData = $grantTypeData->withMetadata('claims', $claims);
         return $grantTypeData;

634) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/JwtBearerGrant/JwtBearerGrantType.php:261    [M] LogicalOr
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.adb799f0f00be8a6b6845fe6c5503464.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        if (!$jws->getSignature(0)->hasProtectedHeaderParameter('alg') || !in_array($jws->getSignature(0)->getProtectedHeaderParameter('alg'), $allowedSignatureAlgorithms)) {
+        if (!$jws->getSignature(0)->hasProtectedHeaderParameter('alg') && !in_array($jws->getSignature(0)->getProtectedHeaderParameter('alg'), $allowedSignatureAlgorithms)) {
             throw new \InvalidArgumentException(sprintf('The signature algorithm "%s" is not allowed.', $jws->getSignature(0)->getProtectedHeaderParameter('alg')));
         }
         $this->jwsVerifier->verifyWithKeySet($jws, $signatureKeys, 0);
         $grantTypeData = $grantTypeData->withMetadata('jwt', $jws);
         $grantTypeData = $grantTypeData->withMetadata('claims', $claims);
         return $grantTypeData;

635) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/JwtBearerGrant/JwtBearerGrantType.php:265    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.52a7987988b51c71a4f1139f011fee59.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        $this->jwsVerifier->verifyWithKeySet($jws, $signatureKeys, 0);
+        $this->jwsVerifier->verifyWithKeySet($jws, $signatureKeys, 1);
         $grantTypeData = $grantTypeData->withMetadata('jwt', $jws);
         $grantTypeData = $grantTypeData->withMetadata('claims', $claims);
         return $grantTypeData;
     }
     /**
      * @param string $subject

636) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/JwtBearerGrant/JwtBearerGrantType.php:280    [M] NotIdentical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.1e3cab87364c5cbe1e3824e62452f6e1.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $userAccount = $this->userAccountRepository->find(UserAccountId::create($subject));
-        if (null !== $userAccount) {
+        if (null === $userAccount) {
             return $userAccount->getPublicId();
         }
         $client = $this->clientRepository->find(ClientId::create($subject));
         if (null !== $client) {
             return $client->getPublicId();
         }

637) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/JwtBearerGrant/TrustedIssuerManager.php:26    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.90d63d4ee1ad4c09f32387d7f661b769.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function add(TrustedIssuer $trustedIssuer)
+    protected function add(TrustedIssuer $trustedIssuer)
     {
         $this->trustedIssuers[$trustedIssuer->name()] = $trustedIssuer;
     }
     /**
      * @param string $name
      *

638) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/JwtBearerGrant/TrustedIssuerManager.php:36    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.12e965d86de48cbb78cf710ea4ab4573.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function has(string $name) : bool
+    protected function has(string $name) : bool
     {
         return array_key_exists($name, $this->trustedIssuers);
     }
     /**
      * @param string $name
      *

639) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/JwtBearerGrant/TrustedIssuerManager.php:48    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.3a082d0de47fba9949e411fb3f76f72a.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (!$this->has($name)) {
+        if ($this->has($name)) {
             throw new \InvalidArgumentException(sprintf('The issuer with name "%s" is not known.', $name));
         }
         return $this->trustedIssuers[$name];
     }
     /**
      * @return string[]

640) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/JwtBearerGrant/TrustedIssuerManager.php:46    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.16acbd65f25e30c19f6579fb7fe82b48.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function get(string $name) : TrustedIssuer
+    protected function get(string $name) : TrustedIssuer
     {
         if (!$this->has($name)) {
             throw new \InvalidArgumentException(sprintf('The issuer with name "%s" is not known.', $name));
         }
         return $this->trustedIssuers[$name];
     }

641) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/JwtBearerGrant/TrustedIssuerManager.php:58    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.7d6d7d180cf36feda428f1cdf410f578.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function list() : array
+    protected function list() : array
     {
         return array_keys($this->trustedIssuers);
     }
 }

642) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/MacTokenType/MacToken.php:34    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.9752e6e660cca5a343eccdd8af27464b.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (!in_array($macAlgorithm, array_keys($this->getAlgorithmMap()))) {
+        if (in_array($macAlgorithm, array_keys($this->getAlgorithmMap()))) {
             throw new \InvalidArgumentException('Unsupported ma algorithm.');
         }
         if ($timestampLifetime <= 0) {
             throw new \InvalidArgumentException('Invalid timestamp lifetime.');
         }
         $this->macAlgorithm = $macAlgorithm;

643) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/MacTokenType/MacToken.php:37    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.a5391c8298695718c360714b8082397f.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        if ($timestampLifetime <= 0) {
+        if ($timestampLifetime <= 1) {
             throw new \InvalidArgumentException('Invalid timestamp lifetime.');
         }
         $this->macAlgorithm = $macAlgorithm;
         $this->timestampLifetime = $timestampLifetime;
     }
     /**

644) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/MacTokenType/MacToken.php:37    [M] LessThanOrEqualTo
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.dac3fe5120cae774d025aaffe89bead9.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        if ($timestampLifetime <= 0) {
+        if ($timestampLifetime < 0) {
             throw new \InvalidArgumentException('Invalid timestamp lifetime.');
         }
         $this->macAlgorithm = $macAlgorithm;
         $this->timestampLifetime = $timestampLifetime;
     }
     /**

645) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/MacTokenType/MacToken.php:37    [M] LessThanOrEqualToNegotiation
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.aa26738886ece7fa3d3cced1622d96f9.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        if ($timestampLifetime <= 0) {
+        if ($timestampLifetime > 0) {
             throw new \InvalidArgumentException('Invalid timestamp lifetime.');
         }
         $this->macAlgorithm = $macAlgorithm;
         $this->timestampLifetime = $timestampLifetime;
     }
     /**

649) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/MacTokenType/MacToken.php:75    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.b38c220f7b32a07ebbbe0f3a9751c509.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getTimestampLifetime() : int
+    protected function getTimestampLifetime() : int
     {
         return $this->timestampLifetime;
     }
     /**
      * @return string
      */

650) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/MacTokenType/MacToken.php:83    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.fa59d49fe33e4d19cd6fe9721e37af96.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getMacAlgorithm()
+    protected function getMacAlgorithm()
     {
         return $this->macAlgorithm;
     }
     /**
      * {@inheritdoc}
      */

651) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/MacTokenType/MacToken.php:96    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.62910d6a60d0a92ba52106093753a11a.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         foreach ($authorization_headers as $authorization_header) {
-            if ('MAC ' === mb_substr($authorization_header, 0, 4, '8bit')) {
+            if ('MAC ' === mb_substr($authorization_header, 1, 4, '8bit')) {
                 $header = trim(mb_substr($authorization_header, 4, null, '8bit'));
                 if (true === $this->isHeaderValid($header, $additionalCredentialValues, $token)) {
                     return $token;
                 }
             }
         }

652) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/MacTokenType/MacToken.php:96    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.80a6a4bb3732e49e4e83f8bb3eab6355.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         foreach ($authorization_headers as $authorization_header) {
-            if ('MAC ' === mb_substr($authorization_header, 0, 4, '8bit')) {
+            if ('MAC ' !== mb_substr($authorization_header, 0, 4, '8bit')) {
                 $header = trim(mb_substr($authorization_header, 4, null, '8bit'));
                 if (true === $this->isHeaderValid($header, $additionalCredentialValues, $token)) {
                     return $token;
                 }
             }
         }

653) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/MacTokenType/MacToken.php:98    [M] TrueValue
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.14078db6890cb7d3af3b44f445a44f9d.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
                 $header = trim(mb_substr($authorization_header, 4, null, '8bit'));
-                if (true === $this->isHeaderValid($header, $additionalCredentialValues, $token)) {
+                if (false === $this->isHeaderValid($header, $additionalCredentialValues, $token)) {
                     return $token;
                 }
             }
         }
         return null;
     }

654) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/MacTokenType/MacToken.php:98    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.7a9e5a639c6340396579ef65accbe9d1.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
                 $header = trim(mb_substr($authorization_header, 4, null, '8bit'));
-                if (true === $this->isHeaderValid($header, $additionalCredentialValues, $token)) {
+                if (true !== $this->isHeaderValid($header, $additionalCredentialValues, $token)) {
                     return $token;
                 }
             }
         }
         return null;
     }

657) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/MacTokenType/MacToken.php:112    [M] NotIdentical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.8a93b0fb044afb62ab0d2eb6d2bd9b0e.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if ($accessToken->getParameter('token_type') !== $this->name()) {
+        if ($accessToken->getParameter('token_type') === $this->name()) {
             return false;
         }
         foreach ($this->getParametersToCheck() as $key => $closure) {
             if (!array_key_exists($key, $additionalCredentialValues) || false === $closure($additionalCredentialValues[$key], $accessToken)) {
                 return false;
             }

658) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/MacTokenType/MacToken.php:117    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.9edf8b3fa1682cae74a19e00a115912d.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         foreach ($this->getParametersToCheck() as $key => $closure) {
-            if (!array_key_exists($key, $additionalCredentialValues) || false === $closure($additionalCredentialValues[$key], $accessToken)) {
+            if (array_key_exists($key, $additionalCredentialValues) || false === $closure($additionalCredentialValues[$key], $accessToken)) {
                 return false;
             }
         }
         $mac = $this->generateMac($request, $accessToken, $additionalCredentialValues);
         return hash_equals($mac, $additionalCredentialValues['mac']);
     }

659) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/MacTokenType/MacToken.php:117    [M] FalseValue
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.eab790da9ce775910b3e4014c3e9daf0.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         foreach ($this->getParametersToCheck() as $key => $closure) {
-            if (!array_key_exists($key, $additionalCredentialValues) || false === $closure($additionalCredentialValues[$key], $accessToken)) {
+            if (!array_key_exists($key, $additionalCredentialValues) || true === $closure($additionalCredentialValues[$key], $accessToken)) {
                 return false;
             }
         }
         $mac = $this->generateMac($request, $accessToken, $additionalCredentialValues);
         return hash_equals($mac, $additionalCredentialValues['mac']);
     }

660) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/MacTokenType/MacToken.php:117    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.c7bdcc805e57c318f78351e08ff5937d.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         foreach ($this->getParametersToCheck() as $key => $closure) {
-            if (!array_key_exists($key, $additionalCredentialValues) || false === $closure($additionalCredentialValues[$key], $accessToken)) {
+            if (!array_key_exists($key, $additionalCredentialValues) || false !== $closure($additionalCredentialValues[$key], $accessToken)) {
                 return false;
             }
         }
         $mac = $this->generateMac($request, $accessToken, $additionalCredentialValues);
         return hash_equals($mac, $additionalCredentialValues['mac']);
     }

661) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/MacTokenType/MacToken.php:117    [M] LogicalOr
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.05c471fc57c139c7b494ebfd01bfb38c.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         foreach ($this->getParametersToCheck() as $key => $closure) {
-            if (!array_key_exists($key, $additionalCredentialValues) || false === $closure($additionalCredentialValues[$key], $accessToken)) {
+            if (!array_key_exists($key, $additionalCredentialValues) && false === $closure($additionalCredentialValues[$key], $accessToken)) {
                 return false;
             }
         }
         $mac = $this->generateMac($request, $accessToken, $additionalCredentialValues);
         return hash_equals($mac, $additionalCredentialValues['mac']);
     }

662) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/MacTokenType/MacToken.php:118    [M] FalseValue
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.8647e3c92d4d3db1c771b46f638f3b70.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             if (!array_key_exists($key, $additionalCredentialValues) || false === $closure($additionalCredentialValues[$key], $accessToken)) {
-                return false;
+                return true;
             }
         }
         $mac = $this->generateMac($request, $accessToken, $additionalCredentialValues);
         return hash_equals($mac, $additionalCredentialValues['mac']);
     }
     private function getParametersToCheck() : array

663) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/MacTokenType/MacToken.php:116    [M] Foreach_
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.615fdeaf031425e6194ad0d7317a4230.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        foreach ($this->getParametersToCheck() as $key => $closure) {
+        foreach (array() as $key => $closure) {
             if (!array_key_exists($key, $additionalCredentialValues) || false === $closure($additionalCredentialValues[$key], $accessToken)) {
                 return false;
             }
         }
         $mac = $this->generateMac($request, $accessToken, $additionalCredentialValues);
         return hash_equals($mac, $additionalCredentialValues['mac']);

665) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/MacTokenType/MacToken.php:131    [M] FunctionCall
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.20195b1ed6cb6a1be8c86a72c2586c82.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         return ['id' => function ($value, AccessToken $accessToken) {
-            return hash_equals($accessToken->getTokenId()->getValue(), $value);
+            hash_equals($accessToken->getTokenId()->getValue(), $value);
+            return null;
         }, 'ts' => function ($value) {
             return time() < $this->getTimestampLifetime() + (int) $value;
         }, 'nonce' => function () {
             return true;
         }];

666) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/MacTokenType/MacToken.php:134    [M] Plus
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.2fd007403f3a1c0d1e0a470fdcf48950.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }, 'ts' => function ($value) {
-            return time() < $this->getTimestampLifetime() + (int) $value;
+            return time() < $this->getTimestampLifetime() - (int) $value;
         }, 'nonce' => function () {
             return true;
         }];
     }
     /**
      * @param ServerRequestInterface $request

667) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/MacTokenType/MacToken.php:134    [M] LessThan
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.075fb3879ceb98d04ce9a47b2124a87c.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }, 'ts' => function ($value) {
-            return time() < $this->getTimestampLifetime() + (int) $value;
+            return time() <= $this->getTimestampLifetime() + (int) $value;
         }, 'nonce' => function () {
             return true;
         }];
     }
     /**
      * @param ServerRequestInterface $request

668) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/MacTokenType/MacToken.php:134    [M] LessThanNegotiation
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.a294a173df7d4bcaba4d75a70f77ec51.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }, 'ts' => function ($value) {
-            return time() < $this->getTimestampLifetime() + (int) $value;
+            return time() >= $this->getTimestampLifetime() + (int) $value;
         }, 'nonce' => function () {
             return true;
         }];
     }
     /**
      * @param ServerRequestInterface $request

669) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/MacTokenType/MacToken.php:137    [M] TrueValue
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.1f44bae43a9f0d20cf5ab27ca2cdf28f.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }, 'nonce' => function () {
-            return true;
+            return false;
         }];
     }
     /**
      * @param ServerRequestInterface $request
      * @param AccessToken            $token
      * @param array                  $values

670) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/MacTokenType/MacToken.php:169    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.75d25247cbddf92537bcbbecfd9f2064.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $algorithms = $this->getAlgorithmMap();
-        if (!array_key_exists($token->getParameter('mac_algorithm'), $algorithms)) {
+        if (array_key_exists($token->getParameter('mac_algorithm'), $algorithms)) {
             throw new \RuntimeException(sprintf('The MAC algorithm "%s" is not supported.', $token->getParameter('mac_algorithm')));
         }
         return base64_encode(hash_hmac($algorithms[$token->getParameter('mac_algorithm')], $basestr, $token->getParameter('mac_key'), true));
     }
     /**
      * @return array

671) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/MacTokenType/MacToken.php:177    [M] TrueValue
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.18281abc8a55889881a6ea323dbf2a1f.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        return base64_encode(hash_hmac($algorithms[$token->getParameter('mac_algorithm')], $basestr, $token->getParameter('mac_key'), true));
+        return base64_encode(hash_hmac($algorithms[$token->getParameter('mac_algorithm')], $basestr, $token->getParameter('mac_key'), false));
     }
     /**
      * @return array
      */
     protected function getAlgorithmMap() : array
     {
