672) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/MacTokenType/MacToken.php:184    [M] ProtectedVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.39ae966a46ac9e79567d67e00f67a2f6.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    protected function getAlgorithmMap() : array
+    private function getAlgorithmMap() : array
     {
         return ['hmac-sha-1' => 'sha1', 'hmac-sha-256' => 'sha256'];
     }
     /**
      * @param string      $header
      * @param array       $additionalCredentialValues

673) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/MacTokenType/MacToken.php:201    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.934487fd153b9a46fc3e60d9c8bd97a8.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (1 === preg_match('/(\\w+)=("((?:[^"\\\\]|\\\\.)+)"|([^\\s,$]+))/', $header, $matches)) {
+        if (0 === preg_match('/(\\w+)=("((?:[^"\\\\]|\\\\.)+)"|([^\\s,$]+))/', $header, $matches)) {
             preg_match_all('/(\\w+)=("((?:[^"\\\\]|\\\\.)+)"|([^\\s,$]+))/', $header, $matches, PREG_SET_ORDER);
             if (!is_array($matches)) {
                 return false;
             }
             $values = [];
             foreach ($matches as $match) {

674) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/MacTokenType/MacToken.php:201    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.e04de0c881542dc418d6c998ea51eddb.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (1 === preg_match('/(\\w+)=("((?:[^"\\\\]|\\\\.)+)"|([^\\s,$]+))/', $header, $matches)) {
+        if (1 !== preg_match('/(\\w+)=("((?:[^"\\\\]|\\\\.)+)"|([^\\s,$]+))/', $header, $matches)) {
             preg_match_all('/(\\w+)=("((?:[^"\\\\]|\\\\.)+)"|([^\\s,$]+))/', $header, $matches, PREG_SET_ORDER);
             if (!is_array($matches)) {
                 return false;
             }
             $values = [];
             foreach ($matches as $match) {

675) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/MacTokenType/MacToken.php:204    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.092522bb00925833bcc0a7797d1a7e89.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             preg_match_all('/(\\w+)=("((?:[^"\\\\]|\\\\.)+)"|([^\\s,$]+))/', $header, $matches, PREG_SET_ORDER);
-            if (!is_array($matches)) {
+            if (is_array($matches)) {
                 return false;
             }
             $values = [];
             foreach ($matches as $match) {
                 $values[$match[1]] = isset($match[4]) ? $match[4] : $match[3];
             }

676) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/MacTokenType/MacToken.php:210    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.4ff4a97b628a09113b9949d46e780edf.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             foreach ($matches as $match) {
-                $values[$match[1]] = isset($match[4]) ? $match[4] : $match[3];
+                $values[$match[0]] = isset($match[4]) ? $match[4] : $match[3];
             }
             if (array_key_exists('id', $values)) {
                 $additionalCredentialValues = $values;
                 $token = $values['id'];
                 return true;
             }

677) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/MacTokenType/MacToken.php:209    [M] Foreach_
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.6be21ab1d6248f811ad2fedb92497df6.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             $values = [];
-            foreach ($matches as $match) {
+            foreach (array() as $match) {
                 $values[$match[1]] = isset($match[4]) ? $match[4] : $match[3];
             }
             if (array_key_exists('id', $values)) {
                 $additionalCredentialValues = $values;
                 $token = $values['id'];
                 return true;

678) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/MacTokenType/MacToken.php:218    [M] TrueValue
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.f6163f41c32c214b4f56ac0fb0045e7b.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
                 $token = $values['id'];
-                return true;
+                return false;
             }
         }
         return false;
     }
     /**
      * @return string

682) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/MetadataEndpoint/Metadata.php:51    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.ea90a6307b69b41dd375676daf26df89.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function set(string $key, $value)
+    protected function set(string $key, $value)
     {
         $this->values[$key] = $value;
     }
     /**
      * {@inheritdoc}
      */

684) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/RefreshTokenGrant/Command/AddAccessTokenCommand.php:37    [M] ProtectedVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.47d14787dc82a3bc10be036de5179b61.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    protected function __construct(RefreshTokenId $refreshTokenId, AccessTokenId $accessTokenId)
+    private function __construct(RefreshTokenId $refreshTokenId, AccessTokenId $accessTokenId)
     {
         $this->refreshTokenId = $refreshTokenId;
         $this->accessTokenId = $accessTokenId;
     }
     /**
      * @param RefreshTokenId $refreshTokenId

685) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/RefreshTokenGrant/Command/AddAccessTokenCommand.php:49    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.6b0e6d69409584cabc8d086955ea2e59.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public static function create(RefreshTokenId $refreshTokenId, AccessTokenId $accessTokenId) : self
+    protected static function create(RefreshTokenId $refreshTokenId, AccessTokenId $accessTokenId) : self
     {
         return new self($refreshTokenId, $accessTokenId);
     }
     /**
      * @return RefreshTokenId
      */

686) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/RefreshTokenGrant/Command/AddAccessTokenCommand.php:57    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.8053f71b320523916188149d978476b8.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getRefreshTokenId() : RefreshTokenId
+    protected function getRefreshTokenId() : RefreshTokenId
     {
         return $this->refreshTokenId;
     }
     /**
      * @return AccessTokenId
      */

688) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/RefreshTokenGrant/Command/AddAccessTokenCommandHandler.php:42    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.9014d8dc0178597e8dc42ba6217f59ac.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $refreshToken = $this->refreshTokenRepository->find($refreshTokenId);
-        if (null === $refreshToken) {
+        if (null !== $refreshToken) {
             throw new \InvalidArgumentException(sprintf('Unable to find the refresh token with ID "%s".', $command->getRefreshTokenId()->getValue()));
         }
         $refreshToken = $refreshToken->addAccessToken($command->getAccessTokenId());
         $this->refreshTokenRepository->save($refreshToken);
     }
 }

689) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/RefreshTokenGrant/Command/AddAccessTokenCommandHandler.php:38    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.e6c89c630239392dc66759402ba8229b.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function handle(AddAccessTokenCommand $command)
+    protected function handle(AddAccessTokenCommand $command)
     {
         $refreshTokenId = $command->getRefreshTokenId();
         $refreshToken = $this->refreshTokenRepository->find($refreshTokenId);
         if (null === $refreshToken) {
             throw new \InvalidArgumentException(sprintf('Unable to find the refresh token with ID "%s".', $command->getRefreshTokenId()->getValue()));
         }

690) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/RefreshTokenGrant/Command/CreateRefreshTokenCommand.php:76    [M] ProtectedVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.4490804550232db1de2a9bda47082aee.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    protected function __construct(RefreshTokenId $refreshTokenId, ClientId $clientId, ResourceOwnerId $resourceOwnerId, \DateTimeImmutable $expiresAt, DataBag $parameters, DataBag $metadatas, array $scopes, ?ResourceServerId $resourceServerId)
+    private function __construct(RefreshTokenId $refreshTokenId, ClientId $clientId, ResourceOwnerId $resourceOwnerId, \DateTimeImmutable $expiresAt, DataBag $parameters, DataBag $metadatas, array $scopes, ?ResourceServerId $resourceServerId)
     {
         $this->refreshTokenId = $refreshTokenId;
         $this->clientId = $clientId;
         $this->resourceOwnerId = $resourceOwnerId;
         $this->expiresAt = $expiresAt;
         $this->parameters = $parameters;

691) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/RefreshTokenGrant/Command/CreateRefreshTokenCommand.php:100    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.db38e57fd37b2eb8a98dbf672d9a881d.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public static function create(RefreshTokenId $refreshTokenId, ClientId $clientId, ResourceOwnerId $resourceOwnerId, \DateTimeImmutable $expiresAt, DataBag $parameters, DataBag $metadatas, array $scopes, ?ResourceServerId $resourceServerId) : self
+    protected static function create(RefreshTokenId $refreshTokenId, ClientId $clientId, ResourceOwnerId $resourceOwnerId, \DateTimeImmutable $expiresAt, DataBag $parameters, DataBag $metadatas, array $scopes, ?ResourceServerId $resourceServerId) : self
     {
         return new self($refreshTokenId, $clientId, $resourceOwnerId, $expiresAt, $parameters, $metadatas, $scopes, $resourceServerId);
     }
     /**
      * @return ClientId
      */

700) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/RefreshTokenGrant/Command/CreateRefreshTokenCommandHandler.php:42    [M] NotIdentical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.686b56c2d5700b331b39467587b65d39.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $refreshToken = $this->refreshTokenRepository->find($command->getRefreshTokenId());
-        if (null !== $refreshToken) {
+        if (null === $refreshToken) {
             throw new \InvalidArgumentException(sprintf('The refresh token with ID "%s" already exists.', $command->getRefreshTokenId()->getValue()));
         }
         $refreshToken = RefreshToken::createEmpty();
         $refreshToken = $refreshToken->create($command->getRefreshTokenId(), $command->getResourceOwnerId(), $command->getClientId(), $command->getParameters(), $command->getMetadatas(), $command->getScopes(), $command->getExpiresAt(), $command->getResourceServerId());
         $this->refreshTokenRepository->save($refreshToken);
     }

701) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/RefreshTokenGrant/Command/CreateRefreshTokenCommandHandler.php:39    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.fc12e935fc6c46abe5d889ed157d476d.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function handle(CreateRefreshTokenCommand $command)
+    protected function handle(CreateRefreshTokenCommand $command)
     {
         $refreshToken = $this->refreshTokenRepository->find($command->getRefreshTokenId());
         if (null !== $refreshToken) {
             throw new \InvalidArgumentException(sprintf('The refresh token with ID "%s" already exists.', $command->getRefreshTokenId()->getValue()));
         }
         $refreshToken = RefreshToken::createEmpty();

702) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/RefreshTokenGrant/Command/RevokeRefreshTokenCommand.php:30    [M] ProtectedVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.f1f7195eb5c55966a98c7815de680219.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    protected function __construct(RefreshTokenId $refreshTokenId)
+    private function __construct(RefreshTokenId $refreshTokenId)
     {
         $this->refreshTokenId = $refreshTokenId;
     }
     /**
      * @param RefreshTokenId $refreshTokenId
      *

703) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/RefreshTokenGrant/Command/RevokeRefreshTokenCommand.php:40    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.4ea6289bc36cd760aba2409746b8bf3d.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public static function create(RefreshTokenId $refreshTokenId) : self
+    protected static function create(RefreshTokenId $refreshTokenId) : self
     {
         return new self($refreshTokenId);
     }
     /**
      * @return RefreshTokenId
      */

706) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/RefreshTokenGrant/Command/RevokeRefreshTokenCommandHandler.php:38    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.86c020aab29f95a90f9c28265da6e70a.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function handle(RevokeRefreshTokenCommand $command)
+    protected function handle(RevokeRefreshTokenCommand $command)
     {
         $refreshTokenId = $command->getRefreshTokenId();
         $refreshToken = $this->refreshTokenRepository->find($refreshTokenId);
         if (null === $refreshToken) {
             throw new \InvalidArgumentException(sprintf('Unable to find the refresh token with ID "%s".', $command->getRefreshTokenId()->getValue()));
         }

707) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/RefreshTokenGrant/Event/AccessTokenAddedToRefreshTokenEvent.php:43    [M] ProtectedVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.5d63936604966d5c53a651e6b90dc1e7.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    protected function __construct(RefreshTokenId $refreshTokenId, AccessTokenId $accessTokenId, ?\DateTimeImmutable $recordedOn, ?EventId $eventId)
+    private function __construct(RefreshTokenId $refreshTokenId, AccessTokenId $accessTokenId, ?\DateTimeImmutable $recordedOn, ?EventId $eventId)
     {
         parent::__construct($recordedOn, $eventId);
         $this->refreshTokenId = $refreshTokenId;
         $this->accessTokenId = $accessTokenId;
     }
     /**

713) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/RefreshTokenGrant/Event/RefreshTokenCreatedEvent.php:82    [M] ProtectedVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.6b38a1904bff19119343c3a220b3eab0.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    protected function __construct(RefreshTokenId $refreshTokenId, ResourceOwnerId $resourceOwnerId, ClientId $clientId, DataBag $parameters, DataBag $metadatas, \DateTimeImmutable $expiresAt, array $scopes, ?ResourceServerId $resourceServerId, ?\DateTimeImmutable $recordedOn, ?EventId $eventId)
+    private function __construct(RefreshTokenId $refreshTokenId, ResourceOwnerId $resourceOwnerId, ClientId $clientId, DataBag $parameters, DataBag $metadatas, \DateTimeImmutable $expiresAt, array $scopes, ?ResourceServerId $resourceServerId, ?\DateTimeImmutable $recordedOn, ?EventId $eventId)
     {
         parent::__construct($recordedOn, $eventId);
         $this->refreshTokenId = $refreshTokenId;
         $this->resourceOwnerId = $resourceOwnerId;
         $this->clientId = $clientId;
         $this->parameters = $parameters;

714) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/RefreshTokenGrant/Event/RefreshTokenCreatedEvent.php:115    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.983cc07a50646e2650c401429f4d012a.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public static function create(RefreshTokenId $refreshTokenId, ResourceOwnerId $resourceOwnerId, ClientId $clientId, DataBag $parameters, DataBag $metadatas, \DateTimeImmutable $expiresAt, array $scopes, ?ResourceServerId $resourceServerId) : self
+    protected static function create(RefreshTokenId $refreshTokenId, ResourceOwnerId $resourceOwnerId, ClientId $clientId, DataBag $parameters, DataBag $metadatas, \DateTimeImmutable $expiresAt, array $scopes, ?ResourceServerId $resourceServerId) : self
     {
         return new self($refreshTokenId, $resourceOwnerId, $clientId, $parameters, $metadatas, $expiresAt, $scopes, $resourceServerId, null, null);
     }
     /**
      * @return RefreshTokenId
      */

725) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/RefreshTokenGrant/Event/RefreshTokenRevokedEvent.php:36    [M] ProtectedVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.e25a56f4b0d70f4308166e4e56297077.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    protected function __construct(RefreshTokenId $refreshTokenId, ?\DateTimeImmutable $recordedOn, ?EventId $eventId)
+    private function __construct(RefreshTokenId $refreshTokenId, ?\DateTimeImmutable $recordedOn, ?EventId $eventId)
     {
         parent::__construct($recordedOn, $eventId);
         $this->refreshTokenId = $refreshTokenId;
     }
     /**
      * {@inheritdoc}

732) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/RefreshTokenGrant/RefreshToken.php:67    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.67baf594f630945d4a9ffc92a9e8c879.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function create(RefreshTokenId $refreshTokenId, ResourceOwnerId $resourceOwnerId, ClientId $clientId, DataBag $parameters, DataBag $metadatas, array $scopes, \DateTimeImmutable $expiresAt, ?ResourceServerId $resourceServerId) : self
+    protected function create(RefreshTokenId $refreshTokenId, ResourceOwnerId $resourceOwnerId, ClientId $clientId, DataBag $parameters, DataBag $metadatas, array $scopes, \DateTimeImmutable $expiresAt, ?ResourceServerId $resourceServerId) : self
     {
         $clone = clone $this;
         $clone->refreshTokenId = $refreshTokenId;
         $clone->resourceOwnerId = $resourceOwnerId;
         $clone->clientId = $clientId;
         $clone->parameters = $parameters;

733) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/RefreshTokenGrant/RefreshToken.php:90    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.9840fa604e31a870da2bd1944f63c3ea.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (null === $this->refreshTokenId) {
+        if (null !== $this->refreshTokenId) {
             throw new \LogicException('Refresh token not initialized.');
         }
         return $this->refreshTokenId;
     }
     /**
      * @param AccessTokenId $accessTokenId

735) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/RefreshTokenGrant/RefreshToken.php:102    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.608cc05d96eeb298c3905b66740d6a3c.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function addAccessToken(AccessTokenId $accessTokenId) : self
+    protected function addAccessToken(AccessTokenId $accessTokenId) : self
     {
         $id = $accessTokenId->getValue();
         if (array_key_exists($id, $this->accessTokenIds)) {
             return $this;
         }
         $clone = clone $this;

736) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/RefreshTokenGrant/RefreshToken.php:120    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.0989b17988d82501ea1a6b7aee486932.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getAccessTokenIds() : array
+    protected function getAccessTokenIds() : array
     {
         return $this->accessTokenIds;
     }
     /**
      * @return array
      */

737) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/RefreshTokenGrant/RefreshToken.php:149    [M] NotIdentical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.9909d29b20aef6a09c84d88ff3e7ee7c.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $refreshTokenId = RefreshTokenId::create($json->refresh_token_id);
-        $resourceServerId = null !== $json->resource_server_id ? ResourceServerId::create($json->resource_server_id) : null;
+        $resourceServerId = null === $json->resource_server_id ? ResourceServerId::create($json->resource_server_id) : null;
         $accessTokenIds = [];
         foreach ($json->access_token_ids as $access_token_id) {
             $accessTokenIds[$access_token_id] = AccessTokenId::create($access_token_id);
         }
         $expiresAt = \DateTimeImmutable::createFromFormat('U', (string) $json->expires_at);
         $clientId = ClientId::create($json->client_id);

738) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/RefreshTokenGrant/RefreshToken.php:151    [M] Foreach_
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.1d6ee4c4e1bb252527561fe3d6243243.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $accessTokenIds = [];
-        foreach ($json->access_token_ids as $access_token_id) {
+        foreach (array() as $access_token_id) {
             $accessTokenIds[$access_token_id] = AccessTokenId::create($access_token_id);
         }
         $expiresAt = \DateTimeImmutable::createFromFormat('U', (string) $json->expires_at);
         $clientId = ClientId::create($json->client_id);
         $parameters = DataBag::create((array) $json->parameters);
         $metadatas = DataBag::create((array) $json->metadatas);

740) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/RefreshTokenGrant/RefreshToken.php:185    [M] Plus
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.352df48113cf890c1c16081dc61362cb.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        $data = parent::jsonSerialize() + ['refresh_token_id' => $this->getTokenId()->getValue(), 'access_token_ids' => array_keys($this->getAccessTokenIds()), 'resource_server_id' => $this->getResourceServerId() ? $this->getResourceServerId()->getValue() : null];
+        $data = parent::jsonSerialize() - ['refresh_token_id' => $this->getTokenId()->getValue(), 'access_token_ids' => array_keys($this->getAccessTokenIds()), 'resource_server_id' => $this->getResourceServerId() ? $this->getResourceServerId()->getValue() : null];
         return $data;
     }
     /**
      * @return bool
      */
     public function isRevoked() : bool

746) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/RefreshTokenGrant/RefreshToken.php:226    [M] NotIdentical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.5d621c83e84687c99fd546f09abeb95e.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        if (null !== $this->refreshTokenId && $this->refreshTokenId->getValue() !== $event->getDomainId()->getValue()) {
+        if (null === $this->refreshTokenId && $this->refreshTokenId->getValue() !== $event->getDomainId()->getValue()) {
             throw new \RuntimeException('Event not applicable for this refresh token.');
         }
         $method = $map[$event->getType()];
         return $this->{$method}($event);
     }
     /**

747) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/RefreshTokenGrant/RefreshToken.php:226    [M] NotIdentical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.a42bfd8ace0f6faabe23442d9983622b.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        if (null !== $this->refreshTokenId && $this->refreshTokenId->getValue() !== $event->getDomainId()->getValue()) {
+        if (null !== $this->refreshTokenId && $this->refreshTokenId->getValue() === $event->getDomainId()->getValue()) {
             throw new \RuntimeException('Event not applicable for this refresh token.');
         }
         $method = $map[$event->getType()];
         return $this->{$method}($event);
     }
     /**
