748) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/RefreshTokenGrant/RefreshToken.php:226    [M] LogicalAnd
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.5c3140c92c153fa99e166fa2fc465245.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        if (null !== $this->refreshTokenId && $this->refreshTokenId->getValue() !== $event->getDomainId()->getValue()) {
+        if (null !== $this->refreshTokenId || $this->refreshTokenId->getValue() !== $event->getDomainId()->getValue()) {
             throw new \RuntimeException('Event not applicable for this refresh token.');
         }
         $method = $map[$event->getType()];
         return $this->{$method}($event);
     }
     /**

750) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/RefreshTokenGrant/RefreshToken.php:251    [M] ProtectedVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.c6287ec228b064b1866057a748cb225c.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    protected function applyRefreshTokenCreatedEvent(RefreshTokenEvent\RefreshTokenCreatedEvent $event) : self
+    private function applyRefreshTokenCreatedEvent(RefreshTokenEvent\RefreshTokenCreatedEvent $event) : self
     {
         $clone = clone $this;
         $clone->refreshTokenId = $event->getRefreshTokenId();
         $clone->resourceOwnerId = $event->getResourceOwnerId();
         $clone->clientId = $event->getClientId();
         $clone->parameters = $event->getParameters();

751) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/RefreshTokenGrant/RefreshToken.php:271    [M] ProtectedVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.6664ede9817dafeb15efd297d24de21e.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    protected function applyAccessTokenAddedToRefreshTokenEvent(RefreshTokenEvent\AccessTokenAddedToRefreshTokenEvent $event) : self
+    private function applyAccessTokenAddedToRefreshTokenEvent(RefreshTokenEvent\AccessTokenAddedToRefreshTokenEvent $event) : self
     {
         $clone = clone $this;
         $clone->accessTokenIds[$event->getAccessTokenId()->getValue()] = $event->getAccessTokenId();
         return $clone;
     }
     /**

753) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/RefreshTokenGrant/RefreshToken.php:284    [M] ProtectedVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.62fc4ddb665cb534b0a5b0bb2e305c14.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    protected function applyRefreshTokenRevokedEvent(RefreshTokenEvent\RefreshTokenRevokedEvent $event) : self
+    private function applyRefreshTokenRevokedEvent(RefreshTokenEvent\RefreshTokenRevokedEvent $event) : self
     {
         $clone = clone $this;
         $clone->revoked = true;
         return $clone;
     }
 }

758) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/RefreshTokenGrant/RefreshTokenGrantType.php:78    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.fabd73255c6a1c5c7a018458dde32b34.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $token = $this->refreshTokenRepository->find(RefreshTokenId::create($refreshToken));
-        if (null === $token) {
+        if (null !== $token) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_GRANT, 'The parameter "refresh_token" is invalid.');
         }
         $grantTypeData = $grantTypeData->withAvailableScopes($token->getScopes());
         return $grantTypeData;
     }
     /**

760) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/RefreshTokenGrant/RefreshTokenGrantType.php:99    [M] Foreach_
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.e2778b5aac6b6684677a646b4a08fa0c.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $grantTypeData = $grantTypeData->withResourceOwnerId($token->getResourceOwnerId());
-        foreach ($token->getMetadatas()->all() as $k => $v) {
+        foreach (array() as $k => $v) {
             $grantTypeData = $grantTypeData->withMetadata($k, $v);
         }
         foreach ($token->getParameters()->all() as $k => $v) {
             $grantTypeData = $grantTypeData->withParameter($k, $v);
         }
         return $grantTypeData;

761) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/RefreshTokenGrant/RefreshTokenGrantType.php:102    [M] Foreach_
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.ae4da6d911361326c9eac5386a809e77.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        foreach ($token->getParameters()->all() as $k => $v) {
+        foreach (array() as $k => $v) {
             $grantTypeData = $grantTypeData->withParameter($k, $v);
         }
         return $grantTypeData;
     }
     /**
      * {@inheritdoc}

763) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/RefreshTokenGrant/RefreshTokenGrantType.php:114    [M] TrueValue
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.9c176403921a1e266c1d7af5384dddae.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (true === $token->isRevoked() || $client->getPublicId()->getValue() !== $token->getClientId()->getValue()) {
+        if (false === $token->isRevoked() || $client->getPublicId()->getValue() !== $token->getClientId()->getValue()) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_GRANT, 'The parameter "refresh_token" is invalid.');
         }
         if ($token->hasExpired()) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_GRANT, 'Refresh token has expired.');
         }
     }

764) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/RefreshTokenGrant/RefreshTokenGrantType.php:114    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.163369839a0fb3d344d7c5996fa0494e.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (true === $token->isRevoked() || $client->getPublicId()->getValue() !== $token->getClientId()->getValue()) {
+        if (true !== $token->isRevoked() || $client->getPublicId()->getValue() !== $token->getClientId()->getValue()) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_GRANT, 'The parameter "refresh_token" is invalid.');
         }
         if ($token->hasExpired()) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_GRANT, 'Refresh token has expired.');
         }
     }

765) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/RefreshTokenGrant/RefreshTokenGrantType.php:114    [M] NotIdentical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.ec88da21110afbbcb8c2e48f373d25db.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (true === $token->isRevoked() || $client->getPublicId()->getValue() !== $token->getClientId()->getValue()) {
+        if (true === $token->isRevoked() || $client->getPublicId()->getValue() === $token->getClientId()->getValue()) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_GRANT, 'The parameter "refresh_token" is invalid.');
         }
         if ($token->hasExpired()) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_GRANT, 'Refresh token has expired.');
         }
     }

766) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/RefreshTokenGrant/RefreshTokenGrantType.php:114    [M] LogicalOr
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.97c2adfd4a28ff6db2936a40bc371b48.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (true === $token->isRevoked() || $client->getPublicId()->getValue() !== $token->getClientId()->getValue()) {
+        if (true === $token->isRevoked() && $client->getPublicId()->getValue() !== $token->getClientId()->getValue()) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_GRANT, 'The parameter "refresh_token" is invalid.');
         }
         if ($token->hasExpired()) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_GRANT, 'Refresh token has expired.');
         }
     }

770) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/RefreshTokenGrant/RefreshTokenTypeHint.php:60    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.4239b806ac7ee413f34d993d2b3b77c6.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (!$token instanceof RefreshToken || true === $token->isRevoked()) {
+        if ($token instanceof RefreshToken || true === $token->isRevoked()) {
             return;
         }
         $token = $token->markAsRevoked();
         $this->refreshTokenRepository->save($token);
     }
     /**

771) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/RefreshTokenGrant/RefreshTokenTypeHint.php:60    [M] TrueValue
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.cb9729a0fe9aa8f60cbdc9f0fbaa1dd8.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (!$token instanceof RefreshToken || true === $token->isRevoked()) {
+        if (!$token instanceof RefreshToken || false === $token->isRevoked()) {
             return;
         }
         $token = $token->markAsRevoked();
         $this->refreshTokenRepository->save($token);
     }
     /**

772) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/RefreshTokenGrant/RefreshTokenTypeHint.php:60    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.a6017cc8162c92f2ebc101895ad18116.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (!$token instanceof RefreshToken || true === $token->isRevoked()) {
+        if (!$token instanceof RefreshToken || true !== $token->isRevoked()) {
             return;
         }
         $token = $token->markAsRevoked();
         $this->refreshTokenRepository->save($token);
     }
     /**

773) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/RefreshTokenGrant/RefreshTokenTypeHint.php:60    [M] LogicalOr
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.eed68468c947fc529edf9f5cc1a484a7.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (!$token instanceof RefreshToken || true === $token->isRevoked()) {
+        if (!$token instanceof RefreshToken && true === $token->isRevoked()) {
             return;
         }
         $token = $token->markAsRevoked();
         $this->refreshTokenRepository->save($token);
     }
     /**

775) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/RefreshTokenGrant/RefreshTokenTypeHint.php:73    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.6b9a25722b3a8d3d88c12fbe5d290457.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (!$token instanceof RefreshToken || $token->isRevoked() || $token->hasExpired()) {
+        if ($token instanceof RefreshToken || $token->isRevoked() || $token->hasExpired()) {
             return ['active' => false];
         }
         $result = ['active' => true, 'client_id' => $token->getClientId(), 'exp' => $token->getExpiresAt()->getTimestamp()];
         if (!empty($token->getScopes())) {
             $result['scp'] = $token->getScopes();
         }

776) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/RefreshTokenGrant/RefreshTokenTypeHint.php:73    [M] LogicalOr
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.a0289819d43a0aefb38958ef2c6f0f7c.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (!$token instanceof RefreshToken || $token->isRevoked() || $token->hasExpired()) {
+        if (!$token instanceof RefreshToken && $token->isRevoked() || $token->hasExpired()) {
             return ['active' => false];
         }
         $result = ['active' => true, 'client_id' => $token->getClientId(), 'exp' => $token->getExpiresAt()->getTimestamp()];
         if (!empty($token->getScopes())) {
             $result['scp'] = $token->getScopes();
         }

777) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/RefreshTokenGrant/RefreshTokenTypeHint.php:73    [M] LogicalOr
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.6a710dcc97f0a8f36afe75fdb836cd93.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (!$token instanceof RefreshToken || $token->isRevoked() || $token->hasExpired()) {
+        if ((!$token instanceof RefreshToken || $token->isRevoked()) && $token->hasExpired()) {
             return ['active' => false];
         }
         $result = ['active' => true, 'client_id' => $token->getClientId(), 'exp' => $token->getExpiresAt()->getTimestamp()];
         if (!empty($token->getScopes())) {
             $result['scp'] = $token->getScopes();
         }

778) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/RefreshTokenGrant/RefreshTokenTypeHint.php:75    [M] FalseValue
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.23a87640054d2f48182f0726bef7b4eb.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         if (!$token instanceof RefreshToken || $token->isRevoked() || $token->hasExpired()) {
-            return ['active' => false];
+            return ['active' => true];
         }
         $result = ['active' => true, 'client_id' => $token->getClientId(), 'exp' => $token->getExpiresAt()->getTimestamp()];
         if (!empty($token->getScopes())) {
             $result['scp'] = $token->getScopes();
         }
         return $result;

779) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/RefreshTokenGrant/RefreshTokenTypeHint.php:80    [M] TrueValue
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.87734221d183de3ad98f1afa9712329c.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        $result = ['active' => true, 'client_id' => $token->getClientId(), 'exp' => $token->getExpiresAt()->getTimestamp()];
+        $result = ['active' => false, 'client_id' => $token->getClientId(), 'exp' => $token->getExpiresAt()->getTimestamp()];
         if (!empty($token->getScopes())) {
             $result['scp'] = $token->getScopes();
         }
         return $result;
     }
 }

780) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/RefreshTokenGrant/RefreshTokenTypeHint.php:85    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.0a1ef24d6268ff858021f3b8026cea1e.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $result = ['active' => true, 'client_id' => $token->getClientId(), 'exp' => $token->getExpiresAt()->getTimestamp()];
-        if (!empty($token->getScopes())) {
+        if (empty($token->getScopes())) {
             $result['scp'] = $token->getScopes();
         }
         return $result;
     }
 }

787) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/ResourceOwnerPasswordCredentialsGrant/ResourceOwnerPasswordCredentialsGrantType.php:96    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.609de27d4f1f38946bdb526f1362948e.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $userAccount = $this->userAccountRepository->findOneByUsername($username);
-        if (null === $userAccount || !$this->userAccountManager->isPasswordCredentialValid($userAccount, $password)) {
+        if (null !== $userAccount || !$this->userAccountManager->isPasswordCredentialValid($userAccount, $password)) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_GRANT, 'Invalid username and password combination.');
         }
         $grantTypeData = $grantTypeData->withResourceOwnerId($userAccount->getPublicId());
         return $grantTypeData;
     }
 }

788) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/ResourceOwnerPasswordCredentialsGrant/ResourceOwnerPasswordCredentialsGrantType.php:96    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.2f5a800331d1ab69c8a6ec9127759426.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $userAccount = $this->userAccountRepository->findOneByUsername($username);
-        if (null === $userAccount || !$this->userAccountManager->isPasswordCredentialValid($userAccount, $password)) {
+        if (null === $userAccount || $this->userAccountManager->isPasswordCredentialValid($userAccount, $password)) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_GRANT, 'Invalid username and password combination.');
         }
         $grantTypeData = $grantTypeData->withResourceOwnerId($userAccount->getPublicId());
         return $grantTypeData;
     }
 }

789) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/ResourceOwnerPasswordCredentialsGrant/ResourceOwnerPasswordCredentialsGrantType.php:96    [M] LogicalOr
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.5fba497df43e64d03c530dee68002136.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $userAccount = $this->userAccountRepository->findOneByUsername($username);
-        if (null === $userAccount || !$this->userAccountManager->isPasswordCredentialValid($userAccount, $password)) {
+        if (null === $userAccount && !$this->userAccountManager->isPasswordCredentialValid($userAccount, $password)) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_GRANT, 'Invalid username and password combination.');
         }
         $grantTypeData = $grantTypeData->withResourceOwnerId($userAccount->getPublicId());
         return $grantTypeData;
     }
 }

791) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/ClientSecretBasic.php:41    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.18a9fe9106a459ff86054ed68e29e014.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if ($secretLifetime < 0) {
+        if ($secretLifetime < 1) {
             throw new \InvalidArgumentException('The secret lifetime must be at least 0 (= unlimited).');
         }
         $this->realm = $realm;
         $this->secretLifetime = $secretLifetime;
     }
     /**

792) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/ClientSecretBasic.php:41    [M] LessThan
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.9837181704e3e1db63ead34aceaa4439.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if ($secretLifetime < 0) {
+        if ($secretLifetime <= 0) {
             throw new \InvalidArgumentException('The secret lifetime must be at least 0 (= unlimited).');
         }
         $this->realm = $realm;
         $this->secretLifetime = $secretLifetime;
     }
     /**

793) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/ClientSecretBasic.php:41    [M] LessThanNegotiation
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.595e7e802071b5475c9cbaabb0cc2409.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if ($secretLifetime < 0) {
+        if ($secretLifetime >= 0) {
             throw new \InvalidArgumentException('The secret lifetime must be at least 0 (= unlimited).');
         }
         $this->realm = $realm;
         $this->secretLifetime = $secretLifetime;
     }
     /**

794) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/ClientSecretBasic.php:52    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.23f2558b7d55813110b07b8616281d9c.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getSchemesParameters() : array
+    protected function getSchemesParameters() : array
     {
         return [sprintf('Basic realm="%s",charset="UTF-8"', $this->realm)];
     }
     /**
      * {@inheritdoc}
      */

795) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/ClientSecretBasic.php:65    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.6c627fd01e731f3b5cb80b1838eeeb52.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $authorization_headers = $request->getHeader('Authorization');
-        if (0 < count($authorization_headers)) {
+        if (1 < count($authorization_headers)) {
             foreach ($authorization_headers as $authorization_header) {
                 $clientId = $this->findClientIdAndCredentialsInAuthorizationHeader($authorization_header, $client_credentials);
                 if (null !== $clientId) {
                     return $clientId;
                 }
             }

796) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/ClientSecretBasic.php:65    [M] LessThan
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.8cd3663cf6382f9b69d4144090a76c0d.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $authorization_headers = $request->getHeader('Authorization');
-        if (0 < count($authorization_headers)) {
+        if (0 <= count($authorization_headers)) {
             foreach ($authorization_headers as $authorization_header) {
                 $clientId = $this->findClientIdAndCredentialsInAuthorizationHeader($authorization_header, $client_credentials);
                 if (null !== $clientId) {
                     return $clientId;
                 }
             }

797) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/ClientSecretBasic.php:65    [M] LessThanNegotiation
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.cf471fcd2d77687829f9fe9304a7fdb6.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $authorization_headers = $request->getHeader('Authorization');
-        if (0 < count($authorization_headers)) {
+        if (0 >= count($authorization_headers)) {
             foreach ($authorization_headers as $authorization_header) {
                 $clientId = $this->findClientIdAndCredentialsInAuthorizationHeader($authorization_header, $client_credentials);
                 if (null !== $clientId) {
                     return $clientId;
                 }
             }

798) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/ClientSecretBasic.php:68    [M] NotIdentical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.9b25adb9255ccac33fef9ef9f6b1241b.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
                 $clientId = $this->findClientIdAndCredentialsInAuthorizationHeader($authorization_header, $client_credentials);
-                if (null !== $clientId) {
+                if (null === $clientId) {
                     return $clientId;
                 }
             }
         }
         return null;
     }

799) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/ClientSecretBasic.php:66    [M] Foreach_
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.cdde143ee0af2fa74c12ffa1a9a82237.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         if (0 < count($authorization_headers)) {
-            foreach ($authorization_headers as $authorization_header) {
+            foreach (array() as $authorization_header) {
                 $clientId = $this->findClientIdAndCredentialsInAuthorizationHeader($authorization_header, $client_credentials);
                 if (null !== $clientId) {
                     return $clientId;
                 }
             }
         }

800) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/ClientSecretBasic.php:62    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.a112e3eb4e47ef7b8617e9c0275269e6.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function findClientId(ServerRequestInterface $request, &$client_credentials = null) : ?ClientId
+    protected function findClientId(ServerRequestInterface $request, &$client_credentials = null) : ?ClientId
     {
         $authorization_headers = $request->getHeader('Authorization');
         if (0 < count($authorization_headers)) {
             foreach ($authorization_headers as $authorization_header) {
                 $clientId = $this->findClientIdAndCredentialsInAuthorizationHeader($authorization_header, $client_credentials);
                 if (null !== $clientId) {
