801) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/ClientSecretBasic.php:85    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.cb47726cab8daddbfc8d62e14bf4b153.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if ('basic ' === mb_strtolower(mb_substr($authorization_header, 0, 6, '8bit'), '8bit')) {
+        if ('basic ' === mb_strtolower(mb_substr($authorization_header, 1, 6, '8bit'), '8bit')) {
             list($client_id, $client_secret) = explode(':', base64_decode(mb_substr($authorization_header, 6, mb_strlen($authorization_header, '8bit') - 6, '8bit')));
             if (!empty($client_id) && !empty($client_secret)) {
                 $client_credentials = $client_secret;
                 return ClientId::create($client_id);
             }
         }

802) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/ClientSecretBasic.php:85    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.0935ebb9f3658e1883ad5fe00338d1a9.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if ('basic ' === mb_strtolower(mb_substr($authorization_header, 0, 6, '8bit'), '8bit')) {
+        if ('basic ' !== mb_strtolower(mb_substr($authorization_header, 0, 6, '8bit'), '8bit')) {
             list($client_id, $client_secret) = explode(':', base64_decode(mb_substr($authorization_header, 6, mb_strlen($authorization_header, '8bit') - 6, '8bit')));
             if (!empty($client_id) && !empty($client_secret)) {
                 $client_credentials = $client_secret;
                 return ClientId::create($client_id);
             }
         }

803) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/ClientSecretBasic.php:86    [M] Minus
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.f4944de38a3689ebaf11251fe5f095a5.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         if ('basic ' === mb_strtolower(mb_substr($authorization_header, 0, 6, '8bit'), '8bit')) {
-            list($client_id, $client_secret) = explode(':', base64_decode(mb_substr($authorization_header, 6, mb_strlen($authorization_header, '8bit') - 6, '8bit')));
+            list($client_id, $client_secret) = explode(':', base64_decode(mb_substr($authorization_header, 6, mb_strlen($authorization_header, '8bit') + 6, '8bit')));
             if (!empty($client_id) && !empty($client_secret)) {
                 $client_credentials = $client_secret;
                 return ClientId::create($client_id);
             }
         }
         return null;

804) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/ClientSecretBasic.php:87    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.8632eb9a3b62534f3f798c5e06d9b842.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             list($client_id, $client_secret) = explode(':', base64_decode(mb_substr($authorization_header, 6, mb_strlen($authorization_header, '8bit') - 6, '8bit')));
-            if (!empty($client_id) && !empty($client_secret)) {
+            if (empty($client_id) && !empty($client_secret)) {
                 $client_credentials = $client_secret;
                 return ClientId::create($client_id);
             }
         }
         return null;
     }

805) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/ClientSecretBasic.php:87    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.c038b0e48843c962f89d0ad5a4105e63.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             list($client_id, $client_secret) = explode(':', base64_decode(mb_substr($authorization_header, 6, mb_strlen($authorization_header, '8bit') - 6, '8bit')));
-            if (!empty($client_id) && !empty($client_secret)) {
+            if (!empty($client_id) && empty($client_secret)) {
                 $client_credentials = $client_secret;
                 return ClientId::create($client_id);
             }
         }
         return null;
     }

806) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/ClientSecretBasic.php:87    [M] LogicalAnd
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.15a5ea8a6bd705a58d1dfb37501a5c47.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             list($client_id, $client_secret) = explode(':', base64_decode(mb_substr($authorization_header, 6, mb_strlen($authorization_header, '8bit') - 6, '8bit')));
-            if (!empty($client_id) && !empty($client_secret)) {
+            if (!empty($client_id) || !empty($client_secret)) {
                 $client_credentials = $client_secret;
                 return ClientId::create($client_id);
             }
         }
         return null;
     }

807) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/ClientSecretBasic.php:103    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.75cad2117629cda33d14a21501183ffd.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $validated_parameters = $validated_parameters->with('client_secret', $this->createClientSecret());
-        $validated_parameters = $validated_parameters->with('client_secret_expires_at', 0 === $this->secretLifetime ? 0 : time() + $this->secretLifetime);
+        $validated_parameters = $validated_parameters->with('client_secret_expires_at', 1 === $this->secretLifetime ? 0 : time() + $this->secretLifetime);
         return $validated_parameters;
     }
     /**
      * {@inheritdoc}
      */
     public function isClientAuthenticated(Client $client, $client_credentials, ServerRequestInterface $request) : bool

808) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/ClientSecretBasic.php:103    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.01627931d9e79558be013c76aeb798d9.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $validated_parameters = $validated_parameters->with('client_secret', $this->createClientSecret());
-        $validated_parameters = $validated_parameters->with('client_secret_expires_at', 0 === $this->secretLifetime ? 0 : time() + $this->secretLifetime);
+        $validated_parameters = $validated_parameters->with('client_secret_expires_at', 0 !== $this->secretLifetime ? 0 : time() + $this->secretLifetime);
         return $validated_parameters;
     }
     /**
      * {@inheritdoc}
      */
     public function isClientAuthenticated(Client $client, $client_credentials, ServerRequestInterface $request) : bool

809) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/ClientSecretBasic.php:103    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.a6f9535a27c67e541075a11585cafa96.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $validated_parameters = $validated_parameters->with('client_secret', $this->createClientSecret());
-        $validated_parameters = $validated_parameters->with('client_secret_expires_at', 0 === $this->secretLifetime ? 0 : time() + $this->secretLifetime);
+        $validated_parameters = $validated_parameters->with('client_secret_expires_at', 0 === $this->secretLifetime ? 1 : time() + $this->secretLifetime);
         return $validated_parameters;
     }
     /**
      * {@inheritdoc}
      */
     public function isClientAuthenticated(Client $client, $client_credentials, ServerRequestInterface $request) : bool

810) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/ClientSecretBasic.php:103    [M] Plus
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.332c7bff4697b3a7ea057a1f70366506.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $validated_parameters = $validated_parameters->with('client_secret', $this->createClientSecret());
-        $validated_parameters = $validated_parameters->with('client_secret_expires_at', 0 === $this->secretLifetime ? 0 : time() + $this->secretLifetime);
+        $validated_parameters = $validated_parameters->with('client_secret_expires_at', 0 === $this->secretLifetime ? 0 : time() - $this->secretLifetime);
         return $validated_parameters;
     }
     /**
      * {@inheritdoc}
      */
     public function isClientAuthenticated(Client $client, $client_credentials, ServerRequestInterface $request) : bool

811) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/ClientSecretBasic.php:100    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.132bb281da8cd9a855c766478c910e16.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function checkClientConfiguration(DataBag $command_parameters, DataBag $validated_parameters) : DataBag
+    protected function checkClientConfiguration(DataBag $command_parameters, DataBag $validated_parameters) : DataBag
     {
         $validated_parameters = $validated_parameters->with('client_secret', $this->createClientSecret());
         $validated_parameters = $validated_parameters->with('client_secret_expires_at', 0 === $this->secretLifetime ? 0 : time() + $this->secretLifetime);
         return $validated_parameters;
     }
     /**

812) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/ClientSecretBasic.php:111    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.1254edc47026f5908adbd53a1b8ec3c5.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function isClientAuthenticated(Client $client, $client_credentials, ServerRequestInterface $request) : bool
+    protected function isClientAuthenticated(Client $client, $client_credentials, ServerRequestInterface $request) : bool
     {
         return hash_equals($client->get('client_secret'), $client_credentials);
     }
     /**
      * {@inheritdoc}
      */

813) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/ClientSecretBasic.php:119    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.86a2060784bf309cbb1ee6f6d9f08ba0.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getSupportedAuthenticationMethods() : array
+    protected function getSupportedAuthenticationMethods() : array
     {
         return ['client_secret_basic'];
     }
     /**
      * @return string
      */

818) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/ClientSecretPost.php:56    [M] LogicalAnd
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.a56430c45785cd9d0888962210818d61.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $parameters = $request->getParsedBody() ?? [];
-        if (array_key_exists('client_id', $parameters) && array_key_exists('client_secret', $parameters)) {
+        if (array_key_exists('client_id', $parameters) || array_key_exists('client_secret', $parameters)) {
             $clientCredentials = $parameters['client_secret'];
             return ClientId::create($parameters['client_id']);
         }
         return null;
     }
     /**

819) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/ClientSecretPost.php:53    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.36dbc17a80d996413b7b3c5caa5027eb.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function findClientId(ServerRequestInterface $request, &$clientCredentials = null) : ?ClientId
+    protected function findClientId(ServerRequestInterface $request, &$clientCredentials = null) : ?ClientId
     {
         $parameters = $request->getParsedBody() ?? [];
         if (array_key_exists('client_id', $parameters) && array_key_exists('client_secret', $parameters)) {
             $clientCredentials = $parameters['client_secret'];
             return ClientId::create($parameters['client_id']);
         }

825) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/ClientSecretPost.php:79    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.8e606937220b597475675ff6cf09eaea.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function isClientAuthenticated(Client $client, $clientCredentials, ServerRequestInterface $request) : bool
+    protected function isClientAuthenticated(Client $client, $clientCredentials, ServerRequestInterface $request) : bool
     {
         return hash_equals($client->get('client_secret'), $clientCredentials);
     }
     /**
      * {@inheritdoc}
      */

833) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/GrantTypeData.php:69    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.8bae3a8cd1f7e6fe0abc34cd81e8b760.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public static function create(?Client $client) : self
+    protected static function create(?Client $client) : self
     {
         return new self($client);
     }
     /**
      * @param string $key
      * @param mixed  $metadata

834) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/GrantTypeData.php:80    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.b45b5bfc89f960147ac8c0b2f8637f4b.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function withMetadata(string $key, $metadata) : self
+    protected function withMetadata(string $key, $metadata) : self
     {
         $clone = clone $this;
         $clone->metadatas = $this->metadatas->with($key, $metadata);
         return $clone;
     }
     /**

835) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/GrantTypeData.php:115    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.9d21d00086553303611cdfe0040d7d7e.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function hasMetadata(string $key) : bool
+    protected function hasMetadata(string $key) : bool
     {
         return $this->metadatas->has($key);
     }
     /**
      * @param string $key
      * @param $parameter

836) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/GrantTypeData.php:126    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.644ee4fe83d8754ef72acfc96e3f5ecb.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function withParameter(string $key, $parameter) : self
+    protected function withParameter(string $key, $parameter) : self
     {
         $clone = clone $this;
         $clone->parameters = $this->parameters->with($key, $parameter);
         return $clone;
     }
     /**

837) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/GrantTypeData.php:171    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.bf185b5ae1f86a6560f5dfad29c9282e.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function withClient(Client $client) : self
+    protected function withClient(Client $client) : self
     {
         $clone = clone $this;
         $clone->client = $client;
         return $clone;
     }
     /**

838) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/GrantTypeData.php:182    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.7171296ffb57db1ebbd3e91ab2c0c8d5.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getClient() : ?Client
+    protected function getClient() : ?Client
     {
         return $this->client;
     }
     /**
      * @param ResourceOwnerId $resourceOwnerId
      *

839) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/GrantTypeData.php:192    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.636e90b49ff1246950fa2e7ffd837711.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function withResourceOwnerId(ResourceOwnerId $resourceOwnerId) : self
+    protected function withResourceOwnerId(ResourceOwnerId $resourceOwnerId) : self
     {
         $clone = clone $this;
         $clone->resourceOwnerId = $resourceOwnerId;
         return $clone;
     }
     /**

841) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/GrantTypeData.php:275    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.9d8935ba1503c51d153360a5bafded91.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getAvailableScopes() : ?array
+    protected function getAvailableScopes() : ?array
     {
         return $this->availableScopes;
     }
     /**
      * @param string[] $scopes
      *

842) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/GrantTypeData.php:285    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.aad4afd4aeda72c9db3bcc11149979df.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function withAvailableScopes(array $scopes) : self
+    protected function withAvailableScopes(array $scopes) : self
     {
         $clone = clone $this;
         $clone->availableScopes = $scopes;
         return $clone;
     }
 }

843) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/GrantTypeManager.php:28    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.ca1eaef2959fe071ad31ab30b8bd659a.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function add(GrantType $grantType) : self
+    protected function add(GrantType $grantType) : self
     {
         $this->grantTypes[$grantType->getGrantType()] = $grantType;
         return $this;
     }
     /**
      * @param string $name

845) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/GrantTypeManager.php:52    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.832017333460458c16e48fb464c4b1f2.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (!$this->has($names)) {
+        if ($this->has($names)) {
             throw new \InvalidArgumentException(sprintf('The grant type "%s" is not supported.', $names));
         }
         return $this->grantTypes[$names];
     }
     /**
      * @return string[]

846) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/GrantTypeManager.php:50    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.db18fa58c75a4f2dc752c6a190e788b3.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function get(string $names) : GrantType
+    protected function get(string $names) : GrantType
     {
         if (!$this->has($names)) {
             throw new \InvalidArgumentException(sprintf('The grant type "%s" is not supported.', $names));
         }
         return $this->grantTypes[$names];
     }

847) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenIntrospectionEndpoint/TokenIntrospectionEndpoint.php:60    [M] NotIdentical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.a20943b307b0e21f4cb074ef99b98e66.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
                 $result = $hint->find($token);
-                if (null !== $result) {
+                if (null === $result) {
                     if (null === $result->getResourceServerId() || $result->getResourceServerId()->getValue() === $resourceServer->getResourceServerId()->getValue()) {
                         $data = $hint->introspect($result);
                         $response = $this->responseFactory->createResponse();
                         $response->getBody()->write(json_encode($data, JSON_UNESCAPED_UNICODE | JSON_UNESCAPED_SLASHES));
                         $headers = ['Content-Type' => 'application/json; charset=UTF-8', 'Cache-Control' => 'no-cache, no-store, max-age=0, must-revalidate, private', 'Pragma' => 'no-cache'];
                         foreach ($headers as $k => $v) {

848) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenIntrospectionEndpoint/TokenIntrospectionEndpoint.php:61    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.2d4edde260ded81e57e7592c78eedd99.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
                 if (null !== $result) {
-                    if (null === $result->getResourceServerId() || $result->getResourceServerId()->getValue() === $resourceServer->getResourceServerId()->getValue()) {
+                    if (null !== $result->getResourceServerId() || $result->getResourceServerId()->getValue() === $resourceServer->getResourceServerId()->getValue()) {
                         $data = $hint->introspect($result);
                         $response = $this->responseFactory->createResponse();
                         $response->getBody()->write(json_encode($data, JSON_UNESCAPED_UNICODE | JSON_UNESCAPED_SLASHES));
                         $headers = ['Content-Type' => 'application/json; charset=UTF-8', 'Cache-Control' => 'no-cache, no-store, max-age=0, must-revalidate, private', 'Pragma' => 'no-cache'];
                         foreach ($headers as $k => $v) {
                             $response = $response->withHeader($k, $v);

849) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenIntrospectionEndpoint/TokenIntrospectionEndpoint.php:61    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.37feb8d576c89598bb3e0ced6b1e11d4.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
                 if (null !== $result) {
-                    if (null === $result->getResourceServerId() || $result->getResourceServerId()->getValue() === $resourceServer->getResourceServerId()->getValue()) {
+                    if (null === $result->getResourceServerId() || $result->getResourceServerId()->getValue() !== $resourceServer->getResourceServerId()->getValue()) {
                         $data = $hint->introspect($result);
                         $response = $this->responseFactory->createResponse();
                         $response->getBody()->write(json_encode($data, JSON_UNESCAPED_UNICODE | JSON_UNESCAPED_SLASHES));
                         $headers = ['Content-Type' => 'application/json; charset=UTF-8', 'Cache-Control' => 'no-cache, no-store, max-age=0, must-revalidate, private', 'Pragma' => 'no-cache'];
                         foreach ($headers as $k => $v) {
                             $response = $response->withHeader($k, $v);

850) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenIntrospectionEndpoint/TokenIntrospectionEndpoint.php:61    [M] LogicalOr
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.65d8b0aa35b1bb5e76aafd2252d8b819.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
                 if (null !== $result) {
-                    if (null === $result->getResourceServerId() || $result->getResourceServerId()->getValue() === $resourceServer->getResourceServerId()->getValue()) {
+                    if (null === $result->getResourceServerId() && $result->getResourceServerId()->getValue() === $resourceServer->getResourceServerId()->getValue()) {
                         $data = $hint->introspect($result);
                         $response = $this->responseFactory->createResponse();
                         $response->getBody()->write(json_encode($data, JSON_UNESCAPED_UNICODE | JSON_UNESCAPED_SLASHES));
                         $headers = ['Content-Type' => 'application/json; charset=UTF-8', 'Cache-Control' => 'no-cache, no-store, max-age=0, must-revalidate, private', 'Pragma' => 'no-cache'];
                         foreach ($headers as $k => $v) {
                             $response = $response->withHeader($k, $v);
