851) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenIntrospectionEndpoint/TokenIntrospectionEndpoint.php:64    [M] BitwiseOr
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.228e333c0bf1839332455da2256ad347.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
                         $response = $this->responseFactory->createResponse();
-                        $response->getBody()->write(json_encode($data, JSON_UNESCAPED_UNICODE | JSON_UNESCAPED_SLASHES));
+                        $response->getBody()->write(json_encode($data, JSON_UNESCAPED_UNICODE & JSON_UNESCAPED_SLASHES));
                         $headers = ['Content-Type' => 'application/json; charset=UTF-8', 'Cache-Control' => 'no-cache, no-store, max-age=0, must-revalidate, private', 'Pragma' => 'no-cache'];
                         foreach ($headers as $k => $v) {
                             $response = $response->withHeader($k, $v);
                         }
                         return $response;
                     }

853) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenIntrospectionEndpoint/TokenIntrospectionEndpoint.php:58    [M] Foreach_
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.fff1641d09be21329b730694e2f7b8d4.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             $hints = $this->getTokenTypeHints($request);
-            foreach ($hints as $hint) {
+            foreach (array() as $hint) {
                 $result = $hint->find($token);
                 if (null !== $result) {
                     if (null === $result->getResourceServerId() || $result->getResourceServerId()->getValue() === $resourceServer->getResourceServerId()->getValue()) {
                         $data = $hint->introspect($result);
                         $response = $this->responseFactory->createResponse();
                         $response->getBody()->write(json_encode($data, JSON_UNESCAPED_UNICODE | JSON_UNESCAPED_SLASHES));

854) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenIntrospectionEndpoint/TokenIntrospectionEndpoint.php:82    [M] BitwiseOr
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.ff9465c2fae62d16fbf253f1b6822fbc.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $response = $this->responseFactory->createResponse($responseStatucCode);
-        $response->getBody()->write(json_encode($responseContent, JSON_UNESCAPED_UNICODE | JSON_UNESCAPED_SLASHES));
+        $response->getBody()->write(json_encode($responseContent, JSON_UNESCAPED_UNICODE & JSON_UNESCAPED_SLASHES));
         $headers = ['Content-Type' => 'application/json; charset=UTF-8', 'Cache-Control' => 'no-cache, no-store, max-age=0, must-revalidate, private', 'Pragma' => 'no-cache'];
         foreach ($headers as $k => $v) {
             $response = $response->withHeader($k, $v);
         }
         return $response;
     }

857) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenIntrospectionEndpoint/TokenIntrospectionEndpoint.php:101    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.88e42d21a807fb3c0dac94cb891f775c.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $resourceServer = $request->getAttribute('resource_server');
-        if (null === $resourceServer) {
+        if (null !== $resourceServer) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_RESOURCE_SERVER, 'Resource Server authentication failed.');
         }
         return $resourceServer;
     }
     /**
      * @param ServerRequestInterface $request

858) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenIntrospectionEndpoint/TokenIntrospectionEndpoint.php:118    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.81ef600996ffd259ae03b28029a8b3b6.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $params = $this->getRequestParameters($request);
-        if (!array_key_exists('token', $params)) {
+        if (array_key_exists('token', $params)) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, 'The parameter "token" is missing.');
         }
         return $params['token'];
     }
     /**
      * @param ServerRequestInterface $request

859) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenIntrospectionEndpoint/TokenIntrospectionEndpoint.php:115    [M] ProtectedVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.aec71cb78cd599d84dbcb23db96454bc.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    protected function getToken(ServerRequestInterface $request) : string
+    private function getToken(ServerRequestInterface $request) : string
     {
         $params = $this->getRequestParameters($request);
         if (!array_key_exists('token', $params)) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, 'The parameter "token" is missing.');
         }
         return $params['token'];

860) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenIntrospectionEndpoint/TokenIntrospectionEndpoint.php:139    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.73eb3c14bacb617d2213aa944465439f.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             $tokenTypeHint = $params['token_type_hint'];
-            if (!array_key_exists($params['token_type_hint'], $tokenTypeHints)) {
+            if (array_key_exists($params['token_type_hint'], $tokenTypeHints)) {
                 throw new OAuth2Exception(400, 'unsupported_token_type', sprintf('The token type hint "%s" is not supported. Please use one of the following values: %s.', $params['token_type_hint'], implode(', ', array_keys($tokenTypeHints))));
             }
             $hint = $tokenTypeHints[$tokenTypeHint];
             unset($tokenTypeHints[$tokenTypeHint]);
             $tokenTypeHints = [$tokenTypeHint => $hint] + $tokenTypeHints;
         }

861) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenIntrospectionEndpoint/TokenIntrospectionEndpoint.php:145    [M] Plus
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.91af00956e9a944e96d303df1a6ff5bc.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             unset($tokenTypeHints[$tokenTypeHint]);
-            $tokenTypeHints = [$tokenTypeHint => $hint] + $tokenTypeHints;
+            $tokenTypeHints = [$tokenTypeHint => $hint] - $tokenTypeHints;
         }
         return $tokenTypeHints;
     }
     /**
      * @param ServerRequestInterface $request
      *

862) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenIntrospectionEndpoint/TokenIntrospectionEndpoint.php:132    [M] ProtectedVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.4f96e3e768c7fca60b6856348f49850b.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    protected function getTokenTypeHints(ServerRequestInterface $request) : array
+    private function getTokenTypeHints(ServerRequestInterface $request) : array
     {
         $params = $this->getRequestParameters($request);
         $tokenTypeHints = $this->tokenTypeHintManager->getTokenTypeHints();
         if (array_key_exists('token_type_hint', $params)) {
             $tokenTypeHint = $params['token_type_hint'];
             if (!array_key_exists($params['token_type_hint'], $tokenTypeHints)) {

863) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenIntrospectionEndpoint/TokenIntrospectionEndpoint.php:156    [M] ProtectedVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.7d082132d762c1ff051f8be141140298.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    protected function getRequestParameters(ServerRequestInterface $request) : array
+    private function getRequestParameters(ServerRequestInterface $request) : array
     {
         $parameters = $request->getParsedBody() ?? [];
         return array_intersect_key($parameters, array_flip(['token', 'token_type_hint']));
     }
 }

864) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenIntrospectionEndpoint/TokenTypeHintManager.php:26    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.9e0a8c3b988d7cee39f44c06461f2497.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getTokenTypeHints() : array
+    protected function getTokenTypeHints() : array
     {
         return $this->tokenTypeHints;
     }
     /**
      * @param TokenTypeHint $tokenTypeHint
      *

865) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenIntrospectionEndpoint/TokenTypeHintManager.php:36    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.df370fe2a47cf69f219315852a9ed542.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function add(TokenTypeHint $tokenTypeHint) : self
+    protected function add(TokenTypeHint $tokenTypeHint) : self
     {
         $this->tokenTypeHints[$tokenTypeHint->hint()] = $tokenTypeHint;
         return $this;
     }
 }

867) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenRevocationEndpoint/TokenRevocationEndpoint.php:63    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.5e34691d5fa89d95b855fe7f8c65cb38.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
                 if (null !== $result) {
-                    if ($client->getPublicId()->getValue() === $result->getClientId()->getValue()) {
+                    if ($client->getPublicId()->getValue() !== $result->getClientId()->getValue()) {
                         $hint->revoke($result);
                         return $this->getResponse(200, '', $callback);
                     } else {
                         throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, 'The parameter "token" is invalid.');
                     }
                 }

869) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenRevocationEndpoint/TokenRevocationEndpoint.php:75    [M] BitwiseOr
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.fd43c54e009ad1fd96f9746ce2690795.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         } catch (OAuth2Exception $e) {
-            return $this->getResponse($e->getCode(), json_encode($e->getData(), JSON_UNESCAPED_UNICODE | JSON_UNESCAPED_SLASHES), $callback);
+            return $this->getResponse($e->getCode(), json_encode($e->getData(), JSON_UNESCAPED_UNICODE & JSON_UNESCAPED_SLASHES), $callback);
         }
     }
     /**
      * @param int         $code
      * @param string      $data
      * @param null|string $callback

871) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenRevocationEndpoint/TokenRevocationEndpoint.php:88    [M] NotIdentical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.0434aeee6d10191333df5e83965b2b65.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (null !== $callback) {
+        if (null === $callback) {
             $data = sprintf('%s(%s)', $callback, $data);
         }
         $response = $this->responseFactory->createResponse($code);
         $response->getBody()->write($data);
         $headers = ['Content-Type' => 'application/json; charset=UTF-8', 'Cache-Control' => 'no-cache, no-store, max-age=0, must-revalidate, private', 'Pragma' => 'no-cache'];
         foreach ($headers as $k => $v) {

873) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenRevocationEndpoint/TokenRevocationEndpoint.php:112    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.3226d0492bf71b9a0c4945dbc3cffd5e.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $client = $request->getAttribute('client');
-        if (null === $client) {
+        if (null !== $client) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_CLIENT, 'Client authentication failed.');
         }
         return $client;
     }
     /**
      * @param ServerRequestInterface $request

879) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenRevocationEndpoint/TokenRevocationEndpoint.php:167    [M] ProtectedVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.f6bb5ea4cc5dceb79bcbda96ea384128.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    protected function getCallback(ServerRequestInterface $request) : ?string
+    private function getCallback(ServerRequestInterface $request) : ?string
     {
         $params = $this->getRequestParameters($request);
         if (array_key_exists('callback', $params)) {
             return $params['callback'];
         }
         return null;

880) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenRevocationEndpoint/TokenRevocationGetEndpoint.php:46    [M] TrueValue
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.9ba15e7491ac645722458fad3af80b57.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $supported_parameters = ['token', 'token_type_hint'];
-        if (true === $this->allowJson) {
+        if (false === $this->allowJson) {
             $supported_parameters[] = 'callback';
         }
         return array_intersect_key($parameters, array_flip($supported_parameters));
     }
 }

881) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenRevocationEndpoint/TokenRevocationGetEndpoint.php:46    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.008cfed79fa6dd6e24a5e93be0c5fd84.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $supported_parameters = ['token', 'token_type_hint'];
-        if (true === $this->allowJson) {
+        if (true !== $this->allowJson) {
             $supported_parameters[] = 'callback';
         }
         return array_intersect_key($parameters, array_flip($supported_parameters));
     }
 }

886) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenType/TokenTypeManager.php:39    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.d8ee50b93405a49900e49a45b351469c.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $this->tokenTypes[$tokenType->name()] = $tokenType;
-        if (null === $this->defaultTokenType || true === $default) {
+        if (null !== $this->defaultTokenType || true === $default) {
             $this->defaultTokenType = $tokenType->name();
         }
         return $this;
     }
     /**
      * @param string $tokenTypeName

887) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenType/TokenTypeManager.php:39    [M] TrueValue
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.14fedc933c47abb59eb91f7ec5736b9a.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $this->tokenTypes[$tokenType->name()] = $tokenType;
-        if (null === $this->defaultTokenType || true === $default) {
+        if (null === $this->defaultTokenType || false === $default) {
             $this->defaultTokenType = $tokenType->name();
         }
         return $this;
     }
     /**
      * @param string $tokenTypeName

888) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenType/TokenTypeManager.php:39    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.d2a7d1951c442b08c241ef671e80f7e4.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $this->tokenTypes[$tokenType->name()] = $tokenType;
-        if (null === $this->defaultTokenType || true === $default) {
+        if (null === $this->defaultTokenType || true !== $default) {
             $this->defaultTokenType = $tokenType->name();
         }
         return $this;
     }
     /**
      * @param string $tokenTypeName

889) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenType/TokenTypeManager.php:39    [M] LogicalOr
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.b60382459ec5f6c272c5f710e871542d.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $this->tokenTypes[$tokenType->name()] = $tokenType;
-        if (null === $this->defaultTokenType || true === $default) {
+        if (null === $this->defaultTokenType && true === $default) {
             $this->defaultTokenType = $tokenType->name();
         }
         return $this;
     }
     /**
      * @param string $tokenTypeName

890) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenType/TokenTypeManager.php:36    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.2641ac93289c1317ae6fcc42f9348b5e.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function add(TokenType $tokenType, bool $default = false) : self
+    protected function add(TokenType $tokenType, bool $default = false) : self
     {
         $this->tokenTypes[$tokenType->name()] = $tokenType;
         if (null === $this->defaultTokenType || true === $default) {
             $this->defaultTokenType = $tokenType->name();
         }
         return $this;

891) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenType/TokenTypeManager.php:51    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.ec610980bcc1323c64f7abc1b7ee25e3.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function has(string $tokenTypeName) : bool
+    protected function has(string $tokenTypeName) : bool
     {
         return array_key_exists($tokenTypeName, $this->tokenTypes);
     }
     /**
      * @param string $tokenTypeName
      *

892) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenType/TokenTypeManager.php:63    [M] LogicalNot
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.fc6e67cacfde88fd36a005ac0e941b36.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        if (!$this->has($tokenTypeName)) {
+        if ($this->has($tokenTypeName)) {
             throw new \InvalidArgumentException(sprintf('Unsupported token type "%s".', $tokenTypeName));
         }
         return $this->tokenTypes[$tokenTypeName];
     }
     /**
      * @return TokenType[]

893) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenType/TokenTypeManager.php:61    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.475764f60bbd64617e1bdd078382e7fa.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function get(string $tokenTypeName) : TokenType
+    protected function get(string $tokenTypeName) : TokenType
     {
         if (!$this->has($tokenTypeName)) {
             throw new \InvalidArgumentException(sprintf('Unsupported token type "%s".', $tokenTypeName));
         }
         return $this->tokenTypes[$tokenTypeName];
     }

895) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenType/TokenTypeManager.php:81    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.87b36d6eb80c1832f929a69c84ec1945.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getDefault() : TokenType
+    protected function getDefault() : TokenType
     {
         return $this->get($this->defaultTokenType);
     }
     /**
      * @param ServerRequestInterface $request
      * @param array                  $additionalCredentialValues

896) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenType/TokenTypeManager.php:99    [M] NotIdentical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.ed47ca3ca30ca04ff65315704ac40c82.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             $token = $tmp_type->findToken($request, $tmpAdditionalCredentialValues);
-            if (null !== $token) {
+            if (null === $token) {
                 $additionalCredentialValues = $tmpAdditionalCredentialValues;
                 $type = $tmp_type;
                 return $token;
             }
         }
         return null;

897) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenType/TokenTypeManager.php:95    [M] Foreach_
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.21385449bcd5aee3345b25e5c520904d.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        foreach ($this->all() as $tmp_type) {
+        foreach (array() as $tmp_type) {
             $tmpAdditionalCredentialValues = [];
             $token = $tmp_type->findToken($request, $tmpAdditionalCredentialValues);
             if (null !== $token) {
                 $additionalCredentialValues = $tmpAdditionalCredentialValues;
                 $type = $tmp_type;
                 return $token;

898) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenType/TokenTypeManager.php:93    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.099d30b02856163fb38c3086d16aa445.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function findToken(ServerRequestInterface $request, array &$additionalCredentialValues, ?TokenType &$type = null) : ?string
+    protected function findToken(ServerRequestInterface $request, array &$additionalCredentialValues, ?TokenType &$type = null) : ?string
     {
         foreach ($this->all() as $tmp_type) {
             $tmpAdditionalCredentialValues = [];
             $token = $tmp_type->findToken($request, $tmpAdditionalCredentialValues);
             if (null !== $token) {
                 $additionalCredentialValues = $tmpAdditionalCredentialValues;

899) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenType/TokenTypeManager.php:118    [M] Foreach_
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.a363b2da59ac9e4069c028d56aa9d727.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $schemes = [];
-        foreach ($this->all() as $type) {
+        foreach (array() as $type) {
             $schemes[] = $this->computeScheme($type, $additionalAuthenticationParameters);
         }
         return $schemes;
     }
     /**
      * @param TokenType $type

900) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenType/TokenTypeManager.php:115    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.2bee072b70d503a0f5c721b8a6b85e5c.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function getSchemes(array $additionalAuthenticationParameters = []) : array
+    protected function getSchemes(array $additionalAuthenticationParameters = []) : array
     {
         $schemes = [];
         foreach ($this->all() as $type) {
             $schemes[] = $this->computeScheme($type, $additionalAuthenticationParameters);
         }
         return $schemes;

901) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenType/TokenTypeManager.php:134    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.3ad709849ef848e9c8391d45dd50c37f.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $scheme = trim($type->getScheme());
-        if (0 === count($additionalAuthenticationParameters)) {
+        if (1 === count($additionalAuthenticationParameters)) {
             return $scheme;
         }
         foreach (['all', $type->name()] as $key) {
             if (array_key_exists($key, $additionalAuthenticationParameters)) {
                 $scheme = $this->appendParameters($scheme, $additionalAuthenticationParameters[$key]);
             }

902) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenType/TokenTypeManager.php:134    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.a4e980ad513ff8b25627a2ae5d1a671d.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $scheme = trim($type->getScheme());
-        if (0 === count($additionalAuthenticationParameters)) {
+        if (0 !== count($additionalAuthenticationParameters)) {
             return $scheme;
         }
         foreach (['all', $type->name()] as $key) {
             if (array_key_exists($key, $additionalAuthenticationParameters)) {
                 $scheme = $this->appendParameters($scheme, $additionalAuthenticationParameters[$key]);
             }
