903) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenType/TokenTypeManager.php:138    [M] Foreach_
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.8601f872447347c630f4dadcb59baf46.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         }
-        foreach (['all', $type->name()] as $key) {
+        foreach (array() as $key) {
             if (array_key_exists($key, $additionalAuthenticationParameters)) {
                 $scheme = $this->appendParameters($scheme, $additionalAuthenticationParameters[$key]);
             }
         }
         return $scheme;
     }

904) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenType/TokenTypeManager.php:155    [M] OneZeroInteger
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.365942ca1fdabcff2ced8b7515b6489c.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
     {
-        $position = mb_strpos($scheme, ' ', 0, 'utf-8');
+        $position = mb_strpos($scheme, ' ', 1, 'utf-8');
         $add_comma = false === $position ? false : true;
         foreach ($parameters as $key => $value) {
             $value = is_string($value) ? sprintf('"%s"', $value) : $value;
             if (false === $add_comma) {
                 $add_comma = true;
                 $scheme = sprintf('%s %s=%s', $scheme, $key, $value);

905) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenType/TokenTypeManager.php:156    [M] FalseValue
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.0b76556029b9ddccc22a1dafb8fb701c.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $position = mb_strpos($scheme, ' ', 0, 'utf-8');
-        $add_comma = false === $position ? false : true;
+        $add_comma = true === $position ? false : true;
         foreach ($parameters as $key => $value) {
             $value = is_string($value) ? sprintf('"%s"', $value) : $value;
             if (false === $add_comma) {
                 $add_comma = true;
                 $scheme = sprintf('%s %s=%s', $scheme, $key, $value);
             } else {

906) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenType/TokenTypeManager.php:156    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.701622e36f16ea05940c92f8a35f29b4.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $position = mb_strpos($scheme, ' ', 0, 'utf-8');
-        $add_comma = false === $position ? false : true;
+        $add_comma = false !== $position ? false : true;
         foreach ($parameters as $key => $value) {
             $value = is_string($value) ? sprintf('"%s"', $value) : $value;
             if (false === $add_comma) {
                 $add_comma = true;
                 $scheme = sprintf('%s %s=%s', $scheme, $key, $value);
             } else {

907) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenType/TokenTypeManager.php:156    [M] FalseValue
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.f7a60679ab803c6a11852d9c8aaeec7e.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $position = mb_strpos($scheme, ' ', 0, 'utf-8');
-        $add_comma = false === $position ? false : true;
+        $add_comma = false === $position ? true : true;
         foreach ($parameters as $key => $value) {
             $value = is_string($value) ? sprintf('"%s"', $value) : $value;
             if (false === $add_comma) {
                 $add_comma = true;
                 $scheme = sprintf('%s %s=%s', $scheme, $key, $value);
             } else {

908) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenType/TokenTypeManager.php:156    [M] TrueValue
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.d949a247263b856412b3a1e8d76ae13c.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $position = mb_strpos($scheme, ' ', 0, 'utf-8');
-        $add_comma = false === $position ? false : true;
+        $add_comma = false === $position ? false : false;
         foreach ($parameters as $key => $value) {
             $value = is_string($value) ? sprintf('"%s"', $value) : $value;
             if (false === $add_comma) {
                 $add_comma = true;
                 $scheme = sprintf('%s %s=%s', $scheme, $key, $value);
             } else {

909) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenType/TokenTypeManager.php:160    [M] FalseValue
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.a56197e210596c3b85347aa1f34426d6.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             $value = is_string($value) ? sprintf('"%s"', $value) : $value;
-            if (false === $add_comma) {
+            if (true === $add_comma) {
                 $add_comma = true;
                 $scheme = sprintf('%s %s=%s', $scheme, $key, $value);
             } else {
                 $scheme = sprintf('%s,%s=%s', $scheme, $key, $value);
             }
         }

910) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenType/TokenTypeManager.php:160    [M] Identical
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.087b2dc745a9e2319fcc4e36c5fe2151.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             $value = is_string($value) ? sprintf('"%s"', $value) : $value;
-            if (false === $add_comma) {
+            if (false !== $add_comma) {
                 $add_comma = true;
                 $scheme = sprintf('%s %s=%s', $scheme, $key, $value);
             } else {
                 $scheme = sprintf('%s,%s=%s', $scheme, $key, $value);
             }
         }

911) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenType/TokenTypeManager.php:161    [M] TrueValue
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.e1959eede7ca7f0e6adfcd15fb853eb4.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
             if (false === $add_comma) {
-                $add_comma = true;
+                $add_comma = false;
                 $scheme = sprintf('%s %s=%s', $scheme, $key, $value);
             } else {
                 $scheme = sprintf('%s,%s=%s', $scheme, $key, $value);
             }
         }
         return $scheme;

912) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenType/TokenTypeManager.php:158    [M] Foreach_
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.d759e41eb77d781fe54751082e3fc255.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
         $add_comma = false === $position ? false : true;
-        foreach ($parameters as $key => $value) {
+        foreach (array() as $key => $value) {
             $value = is_string($value) ? sprintf('"%s"', $value) : $value;
             if (false === $add_comma) {
                 $add_comma = true;
                 $scheme = sprintf('%s %s=%s', $scheme, $key, $value);
             } else {
                 $scheme = sprintf('%s,%s=%s', $scheme, $key, $value);

1) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Annotation/AnnotationDriver.php:74    [M] PublicVisibility
exec /usr/bin/php7.1 -c /tmp/infectionHsy0o1 /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/vendor/phpunit/phpunit/phpunit --configuration /tmp/infection/phpunitConfiguration.fbdbe16fbdc3cdd768c4269cff6d53c8.infection.xml --stop-on-failure 
--- Original
+++ New
@@ @@
      */
-    public function addChecker(CheckerInterface $checker) : self
+    protected function addChecker(CheckerInterface $checker) : self
     {
         $this->checkers[] = $checker;
         return $this;
     }
     /**
      * @return CheckerInterface[]

2) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Annotation/AnnotationDriver.php:84    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function getCheckers() : array
+    protected function getCheckers() : array
     {
         return $this->checkers;
     }
     public function onKernelController(FilterControllerEvent $event)
     {
         if (!is_array($controller = $event->getController())) {

3) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Annotation/AnnotationDriver.php:91    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!is_array($controller = $event->getController())) {
+        if (is_array($controller = $event->getController())) {
             return;
         }
         $object = new \ReflectionObject($controller[0]);
         $method = $object->getMethod($controller[1]);
         $classConfigurations = $this->reader->getClassAnnotations($object);
         $methodConfigurations = $this->reader->getMethodAnnotations($method);

4) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Annotation/AnnotationDriver.php:95    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         }
-        $object = new \ReflectionObject($controller[0]);
+        $object = new \ReflectionObject($controller[1]);
         $method = $object->getMethod($controller[1]);
         $classConfigurations = $this->reader->getClassAnnotations($object);
         $methodConfigurations = $this->reader->getMethodAnnotations($method);
         foreach (array_merge($classConfigurations, $methodConfigurations) as $configuration) {
             if ($configuration instanceof OAuth2) {
                 $token = $this->tokenStorage->getToken();

5) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Annotation/AnnotationDriver.php:96    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         $object = new \ReflectionObject($controller[0]);
-        $method = $object->getMethod($controller[1]);
+        $method = $object->getMethod($controller[0]);
         $classConfigurations = $this->reader->getClassAnnotations($object);
         $methodConfigurations = $this->reader->getMethodAnnotations($method);
         foreach (array_merge($classConfigurations, $methodConfigurations) as $configuration) {
             if ($configuration instanceof OAuth2) {
                 $token = $this->tokenStorage->getToken();
                 if (!$token instanceof OAuth2Token) {

6) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Annotation/AnnotationDriver.php:104    [M] LogicalNot

--- Original
+++ New
@@ @@
                 $token = $this->tokenStorage->getToken();
-                if (!$token instanceof OAuth2Token) {
+                if ($token instanceof OAuth2Token) {
                     $this->createAuthenticationException($event, 'OAuth2 authentication required');
                     return;
                 }
                 foreach ($this->getCheckers() as $checker) {
                     $message = $checker->check($token, $configuration);
                     if (null !== $message) {

7) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Annotation/AnnotationDriver.php:112    [M] NotIdentical

--- Original
+++ New
@@ @@
                     $message = $checker->check($token, $configuration);
-                    if (null !== $message) {
+                    if (null === $message) {
                         $this->createAccessDeniedException($event, $message);
                         return;
                     }
                 }
             }
         }

8) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Annotation/AnnotationDriver.php:110    [M] Foreach_

--- Original
+++ New
@@ @@
                 }
-                foreach ($this->getCheckers() as $checker) {
+                foreach (array() as $checker) {
                     $message = $checker->check($token, $configuration);
                     if (null !== $message) {
                         $this->createAccessDeniedException($event, $message);
                         return;
                     }
                 }

9) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Annotation/AnnotationDriver.php:100    [M] Foreach_

--- Original
+++ New
@@ @@
         $methodConfigurations = $this->reader->getMethodAnnotations($method);
-        foreach (array_merge($classConfigurations, $methodConfigurations) as $configuration) {
+        foreach (array() as $configuration) {
             if ($configuration instanceof OAuth2) {
                 $token = $this->tokenStorage->getToken();
                 if (!$token instanceof OAuth2Token) {
                     $this->createAuthenticationException($event, 'OAuth2 authentication required');
                     return;
                 }

10) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Annotation/AnnotationDriver.php:89    [M] PublicVisibility

--- Original
+++ New
@@ @@
     }
-    public function onKernelController(FilterControllerEvent $event)
+    protected function onKernelController(FilterControllerEvent $event)
     {
         if (!is_array($controller = $event->getController())) {
             return;
         }
         $object = new \ReflectionObject($controller[0]);
         $method = $object->getMethod($controller[1]);

11) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Annotation/Checker/ClientIdChecker.php:26    [M] Identical

--- Original
+++ New
@@ @@
     {
-        if (null === $configuration->getClientId()) {
+        if (null !== $configuration->getClientId()) {
             return null;
         }
         if ($configuration->getClientId() !== $token->getClientId()) {
             return 'Client not authorized.';
         }
         return null;

12) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Annotation/Checker/ClientIdChecker.php:30    [M] NotIdentical

--- Original
+++ New
@@ @@
         }
-        if ($configuration->getClientId() !== $token->getClientId()) {
+        if ($configuration->getClientId() === $token->getClientId()) {
             return 'Client not authorized.';
         }
         return null;
     }
 }

13) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Annotation/Checker/ClientIdChecker.php:24    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function check(OAuth2Token $token, OAuth2 $configuration) : ?string
+    protected function check(OAuth2Token $token, OAuth2 $configuration) : ?string
     {
         if (null === $configuration->getClientId()) {
             return null;
         }
         if ($configuration->getClientId() !== $token->getClientId()) {
             return 'Client not authorized.';

14) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Annotation/Checker/ResourceOwnerIdChecker.php:26    [M] Identical

--- Original
+++ New
@@ @@
     {
-        if (null === $configuration->getResourceOwnerId()) {
+        if (null !== $configuration->getResourceOwnerId()) {
             return null;
         }
         if ($configuration->getResourceOwnerId() !== $token->getResourceOwnerId()) {
             return 'Resource owner not authorized.';
         }
         return null;

15) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Annotation/Checker/ResourceOwnerIdChecker.php:30    [M] NotIdentical

--- Original
+++ New
@@ @@
         }
-        if ($configuration->getResourceOwnerId() !== $token->getResourceOwnerId()) {
+        if ($configuration->getResourceOwnerId() === $token->getResourceOwnerId()) {
             return 'Resource owner not authorized.';
         }
         return null;
     }
 }

17) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Annotation/Checker/ScopeChecker.php:27    [M] Identical

--- Original
+++ New
@@ @@
         $scope = $configuration->getScope();
-        if (null === $scope) {
+        if (null !== $scope) {
             return null;
         }
         $scopes = explode(' ', $scope);
         $diff = array_diff($scopes, $token->getAccessToken()->getScopes());
         if (!empty($diff)) {
             return sprintf('Insufficient scope. The scope rule is: %s', $configuration->getScope());

18) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Annotation/Checker/ScopeChecker.php:34    [M] LogicalNot

--- Original
+++ New
@@ @@
         $diff = array_diff($scopes, $token->getAccessToken()->getScopes());
-        if (!empty($diff)) {
+        if (empty($diff)) {
             return sprintf('Insufficient scope. The scope rule is: %s', $configuration->getScope());
         }
         return null;
     }
 }

19) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Annotation/Checker/ScopeChecker.php:35    [M] FunctionCall

--- Original
+++ New
@@ @@
         if (!empty($diff)) {
-            return sprintf('Insufficient scope. The scope rule is: %s', $configuration->getScope());
+            sprintf('Insufficient scope. The scope rule is: %s', $configuration->getScope());
+            return null;
         }
         return null;
     }
 }

21) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Annotation/OAuth2.php:53    [M] LogicalNot

--- Original
+++ New
@@ @@
             $method = 'set' . str_replace('_', '', ucwords($key, '_'));
-            if (!method_exists($this, $method)) {
+            if (method_exists($this, $method)) {
                 throw new \BadMethodCallException(sprintf("Unknown property '%s' on annotation '%s'.", $key, get_class($this)));
             }
             $this->{$method}($value);
         }
     }
     /**

22) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Annotation/OAuth2.php:51    [M] Foreach_

--- Original
+++ New
@@ @@
         }
-        foreach ($data as $key => $value) {
+        foreach (array() as $key => $value) {
             $method = 'set' . str_replace('_', '', ucwords($key, '_'));
             if (!method_exists($this, $method)) {
                 throw new \BadMethodCallException(sprintf("Unknown property '%s' on annotation '%s'.", $key, get_class($this)));
             }
             $this->{$method}($value);
         }

23) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Annotation/OAuth2.php:63    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
      */
-    protected function setClientId(string $clientId)
+    private function setClientId(string $clientId)
     {
         Assertion::string($clientId, 'The client public ID should be a string.');
         $this->clientId = $clientId;
     }
     /**
      * @return null|string

24) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Annotation/OAuth2.php:72    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function getClientId() : ?string
+    protected function getClientId() : ?string
     {
         return $this->clientId;
     }
     /**
      * @param string $resourceOwnerId
      */

25) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Annotation/OAuth2.php:80    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
      */
-    protected function setResourceOwnerId(string $resourceOwnerId)
+    private function setResourceOwnerId(string $resourceOwnerId)
     {
         Assertion::string($resourceOwnerId, 'The resource owner public ID should be a string.');
         $this->resourceOwnerId = $resourceOwnerId;
     }
     /**
      * @return null|string

26) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Annotation/OAuth2.php:89    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function getResourceOwnerId() : ?string
+    protected function getResourceOwnerId() : ?string
     {
         return $this->resourceOwnerId;
     }
     /**
      * @param string $scope
      */

27) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Annotation/OAuth2.php:97    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
      */
-    protected function setScope(string $scope)
+    private function setScope(string $scope)
     {
         $this->scope = $scope;
     }
     /**
      * @return null|string
      */

28) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Annotation/OAuth2.php:105    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function getScope() : ?string
+    protected function getScope() : ?string
     {
         return $this->scope;
     }
 }

29) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Checker/AudienceChecker.php:49    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function checkClaim($value)
+    protected function checkClaim($value)
     {
         return $this->checkValue($value);
     }
     /**
      * {@inheritdoc}
      */

30) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Checker/AudienceChecker.php:57    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function checkHeader($value)
+    protected function checkHeader($value)
     {
         return $this->checkValue($value);
     }
     /**
      * @param $value
      *

31) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Checker/AudienceChecker.php:69    [M] NotIdentical

--- Original
+++ New
@@ @@
     {
-        if (is_string($value) && $value !== $this->audience) {
+        if (is_string($value) && $value === $this->audience) {
             throw new \InvalidArgumentException('Bad audience.');
         } elseif (!is_array($value) || !in_array($this->audience, $value)) {
             throw new \InvalidArgumentException('Bad audience.');
         }
     }
     /**

32) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Checker/AudienceChecker.php:69    [M] LogicalAnd

--- Original
+++ New
@@ @@
     {
-        if (is_string($value) && $value !== $this->audience) {
+        if (is_string($value) || $value !== $this->audience) {
             throw new \InvalidArgumentException('Bad audience.');
         } elseif (!is_array($value) || !in_array($this->audience, $value)) {
             throw new \InvalidArgumentException('Bad audience.');
         }
     }
     /**

33) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Checker/AudienceChecker.php:71    [M] LogicalNot

--- Original
+++ New
@@ @@
             throw new \InvalidArgumentException('Bad audience.');
-        } elseif (!is_array($value) || !in_array($this->audience, $value)) {
+        } elseif (is_array($value) || !in_array($this->audience, $value)) {
             throw new \InvalidArgumentException('Bad audience.');
         }
     }
     /**
      * {@inheritdoc}
      */

34) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Checker/AudienceChecker.php:71    [M] LogicalNot

--- Original
+++ New
@@ @@
             throw new \InvalidArgumentException('Bad audience.');
-        } elseif (!is_array($value) || !in_array($this->audience, $value)) {
+        } elseif (!is_array($value) || in_array($this->audience, $value)) {
             throw new \InvalidArgumentException('Bad audience.');
         }
     }
     /**
      * {@inheritdoc}
      */

35) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Checker/AudienceChecker.php:71    [M] LogicalOr

--- Original
+++ New
@@ @@
             throw new \InvalidArgumentException('Bad audience.');
-        } elseif (!is_array($value) || !in_array($this->audience, $value)) {
+        } elseif (!is_array($value) && !in_array($this->audience, $value)) {
             throw new \InvalidArgumentException('Bad audience.');
         }
     }
     /**
      * {@inheritdoc}
      */

36) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Checker/AudienceChecker.php:79    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function supportedClaim() : string
+    protected function supportedClaim() : string
     {
         return self::CLAIM_NAME;
     }
     /**
      * {@inheritdoc}
      */

37) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Checker/AudienceChecker.php:87    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function supportedHeader() : string
+    protected function supportedHeader() : string
     {
         return self::CLAIM_NAME;
     }
     /**
      * {@inheritdoc}
      */

38) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Checker/AudienceChecker.php:95    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function protectedHeaderOnly() : bool
+    protected function protectedHeaderOnly() : bool
     {
         return $this->protectedHeader;
     }
 }

39) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Command/ClientCommand.php:29    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
      */
-    protected function configure()
+    private function configure()
     {
         $this->setName('spomky-labs:oauth2-server:client:create')->setDescription('Create a new client')->setHelp(<<<'EOT'
 The <info>%command.name%</info> command will create a new client.
 
   <info>php %command.full_name%</info>
 EOT

40) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Command/ClientCommand.php:63    [M] BitwiseOr

--- Original
+++ New
@@ @@
         $output->writeln('A client has been created');
-        $output->writeln(sprintf('Its configuration is "%s"', json_encode($client, JSON_UNESCAPED_UNICODE | JSON_UNESCAPED_SLASHES)));
+        $output->writeln(sprintf('Its configuration is "%s"', json_encode($client, JSON_UNESCAPED_UNICODE & JSON_UNESCAPED_SLASHES)));
     }
     /**
      * @param InputInterface  $input
      * @param OutputInterface $output
      * @param Client          $client
      */

41) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Command/ClientCommand.php:45    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
      */
-    protected function execute(InputInterface $input, OutputInterface $output)
+    private function execute(InputInterface $input, OutputInterface $output)
     {
         /**
          * @var ClientRepository
          */
         $service = $this->getContainer()->get(ClientRepository::class);
         $client = Client::createEmpty();

42) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Command/ClientCommand.php:79    [M] FalseValue

--- Original
+++ New
@@ @@
         $question = new ChoiceQuestion('Please select the token endpoint authentication method.', $token_endpoint_auth_method_manager->getSupportedTokenEndpointAuthMethods());
-        $question->setMultiselect(false);
+        $question->setMultiselect(true);
         $question->setErrorMessage('The token endpoint authentication method "%s" is invalid.');
         $token_endpoint_auth_method = $helper->ask($input, $output, $question);
         $client->set('token_endpoint_auth_method', $token_endpoint_auth_method);
     }
     /**
      * @param InputInterface  $input

43) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Command/ClientCommand.php:106    [M] LogicalNot

--- Original
+++ New
@@ @@
             }
-        } while (!empty($uri));
+        } while (empty($uri));
         if (!empty($redirect_uris)) {
             $client->set('redirect_uris', $redirect_uris);
         }
     }
     /**
      * @param InputInterface  $input

44) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Command/ClientCommand.php:99    [M] LogicalNot

--- Original
+++ New
@@ @@
             $uri = $helper->ask($input, $output, $question);
-            if (!empty($uri)) {
+            if (empty($uri)) {
                 if (false === $this->isAnUrlOrUrn($uri, false)) {
                     $output->writeln('Invalid input.');
                 } else {
                     $redirect_uris[] = $uri;
                 }
             }

45) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Command/ClientCommand.php:100    [M] FalseValue

--- Original
+++ New
@@ @@
             if (!empty($uri)) {
-                if (false === $this->isAnUrlOrUrn($uri, false)) {
+                if (true === $this->isAnUrlOrUrn($uri, false)) {
                     $output->writeln('Invalid input.');
                 } else {
                     $redirect_uris[] = $uri;
                 }
             }
         } while (!empty($uri));
