46) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Command/ClientCommand.php:100    [M] FalseValue

--- Original
+++ New
@@ @@
             if (!empty($uri)) {
-                if (false === $this->isAnUrlOrUrn($uri, false)) {
+                if (false === $this->isAnUrlOrUrn($uri, true)) {
                     $output->writeln('Invalid input.');
                 } else {
                     $redirect_uris[] = $uri;
                 }
             }
         } while (!empty($uri));

47) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Command/ClientCommand.php:100    [M] Identical

--- Original
+++ New
@@ @@
             if (!empty($uri)) {
-                if (false === $this->isAnUrlOrUrn($uri, false)) {
+                if (false !== $this->isAnUrlOrUrn($uri, false)) {
                     $output->writeln('Invalid input.');
                 } else {
                     $redirect_uris[] = $uri;
                 }
             }
         } while (!empty($uri));

48) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Command/ClientCommand.php:108    [M] LogicalNot

--- Original
+++ New
@@ @@
         } while (!empty($uri));
-        if (!empty($redirect_uris)) {
+        if (empty($redirect_uris)) {
             $client->set('redirect_uris', $redirect_uris);
         }
     }
     /**
      * @param InputInterface  $input
      * @param OutputInterface $output

49) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Command/ClientCommand.php:127    [M] TrueValue

--- Original
+++ New
@@ @@
         $question = new ChoiceQuestion('Please select allowed response types.', $authorization_factory->getSupportedResponseTypes());
-        $question->setMultiselect(true);
+        $question->setMultiselect(false);
         $question->setErrorMessage('The response type "%s" is invalid.');
         $grant_types = $helper->ask($input, $output, $question);
         $client->set('response_types', $grant_types);
     }
     /**
      * @param InputInterface  $input

50) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Command/ClientCommand.php:148    [M] TrueValue

--- Original
+++ New
@@ @@
         $question = new ChoiceQuestion('Please select allowed grant types.', $token_endpoint->getSupportedGrantTypes());
-        $question->setMultiselect(true);
+        $question->setMultiselect(false);
         $question->setErrorMessage('The grant type "%s" is invalid.');
         $grant_types = $helper->ask($input, $output, $question);
         $client->set('grant_types', $grant_types);
     }
     /**
      * {@inheritdoc}

51) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Command/ClientCommand.php:158    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function isEnabled()
+    protected function isEnabled()
     {
         return $this->getContainer()->has('oauth2_server.client_manager');
     }
     /**
      * @param string $uri
      * @param bool   $path_traversal_allowed

54) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Command/ClientCommand.php:172    [M] FalseValue

--- Original
+++ New
@@ @@
         if ('urn:' === mb_substr($uri, 0, 4, '8bit')) {
-            if (false === self::checkUrn($uri)) {
+            if (true === self::checkUrn($uri)) {
                 return false;
             }
         } else {
             if (false === self::checkUrl($uri, $path_traversal_allowed)) {
                 return false;
             }

55) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Command/ClientCommand.php:172    [M] Identical

--- Original
+++ New
@@ @@
         if ('urn:' === mb_substr($uri, 0, 4, '8bit')) {
-            if (false === self::checkUrn($uri)) {
+            if (false !== self::checkUrn($uri)) {
                 return false;
             }
         } else {
             if (false === self::checkUrl($uri, $path_traversal_allowed)) {
                 return false;
             }

56) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Command/ClientCommand.php:173    [M] FalseValue

--- Original
+++ New
@@ @@
             if (false === self::checkUrn($uri)) {
-                return false;
+                return true;
             }
         } else {
             if (false === self::checkUrl($uri, $path_traversal_allowed)) {
                 return false;
             }
         }

57) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Command/ClientCommand.php:176    [M] FalseValue

--- Original
+++ New
@@ @@
         } else {
-            if (false === self::checkUrl($uri, $path_traversal_allowed)) {
+            if (true === self::checkUrl($uri, $path_traversal_allowed)) {
                 return false;
             }
         }
         return true;
     }
     /**

58) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Command/ClientCommand.php:176    [M] Identical

--- Original
+++ New
@@ @@
         } else {
-            if (false === self::checkUrl($uri, $path_traversal_allowed)) {
+            if (false !== self::checkUrl($uri, $path_traversal_allowed)) {
                 return false;
             }
         }
         return true;
     }
     /**

59) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Command/ClientCommand.php:177    [M] FalseValue

--- Original
+++ New
@@ @@
             if (false === self::checkUrl($uri, $path_traversal_allowed)) {
-                return false;
+                return true;
             }
         }
         return true;
     }
     /**
      * @param string $url

62) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Command/ClientCommand.php:194    [M] FalseValue

--- Original
+++ New
@@ @@
         if (!filter_var($url, FILTER_VALIDATE_URL)) {
-            return false;
+            return true;
         }
         $parsed = parse_url($url);
         // Checks for path traversal (e.g. http://foo.bar/redirect/../bad/url)
         if (isset($parsed['path']) && !$path_traversal_allowed) {
             $path = urldecode($parsed['path']);
             // check for 'path traversal'

63) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Command/ClientCommand.php:200    [M] LogicalNot

--- Original
+++ New
@@ @@
         // Checks for path traversal (e.g. http://foo.bar/redirect/../bad/url)
-        if (isset($parsed['path']) && !$path_traversal_allowed) {
+        if (isset($parsed['path']) && $path_traversal_allowed) {
             $path = urldecode($parsed['path']);
             // check for 'path traversal'
             if (preg_match('#/\\.\\.?(/|$)#', $path)) {
                 return false;
             }
         }

64) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Command/ClientCommand.php:200    [M] LogicalAnd

--- Original
+++ New
@@ @@
         // Checks for path traversal (e.g. http://foo.bar/redirect/../bad/url)
-        if (isset($parsed['path']) && !$path_traversal_allowed) {
+        if (isset($parsed['path']) || !$path_traversal_allowed) {
             $path = urldecode($parsed['path']);
             // check for 'path traversal'
             if (preg_match('#/\\.\\.?(/|$)#', $path)) {
                 return false;
             }
         }

65) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Command/ClientCommand.php:204    [M] FalseValue

--- Original
+++ New
@@ @@
             if (preg_match('#/\\.\\.?(/|$)#', $path)) {
-                return false;
+                return true;
             }
         }
         return true;
     }
     /**
      * @param string $urn

67) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Command/ClientCommand.php:190    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public static function checkUrl($url, $path_traversal_allowed)
+    protected static function checkUrl($url, $path_traversal_allowed)
     {
         // If URI is not a valid URI, return false
         if (!filter_var($url, FILTER_VALIDATE_URL)) {
             return false;
         }
         $parsed = parse_url($url);

68) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Command/ClientCommand.php:218    [M] OneZeroInteger

--- Original
+++ New
@@ @@
     {
-        return 1 === preg_match('/^urn:[a-z0-9][a-z0-9-]{0,31}:[a-z0-9()+,\\-.:=@;$_!*\'%\\/?#]+$/', $urn);
+        return 0 === preg_match('/^urn:[a-z0-9][a-z0-9-]{0,31}:[a-z0-9()+,\\-.:=@;$_!*\'%\\/?#]+$/', $urn);
     }
 }

69) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Command/ClientCommand.php:218    [M] Identical

--- Original
+++ New
@@ @@
     {
-        return 1 === preg_match('/^urn:[a-z0-9][a-z0-9-]{0,31}:[a-z0-9()+,\\-.:=@;$_!*\'%\\/?#]+$/', $urn);
+        return 1 !== preg_match('/^urn:[a-z0-9][a-z0-9-]{0,31}:[a-z0-9()+,\\-.:=@;$_!*\'%\\/?#]+$/', $urn);
     }
 }

70) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Controller/AuthorizationEndpointController.php:132    [M] Foreach_

--- Original
+++ New
@@ @@
         $session_data = ['uri' => $request->getUri()->__toString(), 'ui_locale' => $this->getUiLocale($authorization)];
-        foreach (['display', 'id_token_hint', 'login_hint', 'acr_values'] as $key) {
+        foreach (array() as $key) {
             $session_data[$key] = $authorization->hasQueryParam($key) ? $authorization->getQueryParam($key) : null;
         }
         $this->session->set('oauth2_authorization_request_data', $session_data);
         $response = $this->messageFactory->createResponse(302);
         $response = $response->withHeader('Location', $this->router->generate($this->loginRoute, $this->loginRouteParams, UrlGeneratorInterface::ABSOLUTE_URL));
         return $response;

71) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Controller/AuthorizationEndpointController.php:126    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
      */
-    protected function redirectToLoginPage(Authorization $authorization, ServerRequestInterface $request) : ResponseInterface
+    private function redirectToLoginPage(Authorization $authorization, ServerRequestInterface $request) : ResponseInterface
     {
         $session_data = ['uri' => $request->getUri()->__toString(), 'ui_locale' => $this->getUiLocale($authorization)];
         foreach (['display', 'id_token_hint', 'login_hint', 'acr_values'] as $key) {
             $session_data[$key] = $authorization->hasQueryParam($key) ? $authorization->getQueryParam($key) : null;
         }
         $this->session->set('oauth2_authorization_request_data', $session_data);

72) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Controller/AuthorizationEndpointController.php:168    [M] Identical

--- Original
+++ New
@@ @@
         $this->session->remove('oauth2_authorization_request_data');
-        if ('POST' === $request->getMethod()) {
+        if ('POST' !== $request->getMethod()) {
             $authorization = $this->formHandler->handle($form, $request, $authorization, $authorization_model);
             if (is_bool($authorization->isAuthorized())) {
                 throw new ProcessAuthorizationException($authorization);
                 //FIXME
                 /*return [
                       'save_authorization' => $authorization_model->isSaveConfiguration(),

73) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Controller/AuthorizationEndpointController.php:151    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
      */
-    protected function processConsentScreen(ServerRequestInterface $request, Authorization $authorization) : ResponseInterface
+    private function processConsentScreen(ServerRequestInterface $request, Authorization $authorization) : ResponseInterface
     {
         //FIXME: $options = $this->processConsentScreenOptions($authorization);
         $ui_locale = $this->getUiLocale($authorization);
         $options = array_merge(['locale' => $ui_locale, 'scopes' => $authorization->getScopes()]);
         $authorization_model = new AuthorizationModel();
         $authorization_model->setScopes($authorization->getScopes());

74) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Controller/AuthorizationEndpointController.php:215    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!method_exists($this->translator, 'getCatalogue') || !$authorization->hasQueryParam('ui_locales')) {
+        if (method_exists($this->translator, 'getCatalogue') || !$authorization->hasQueryParam('ui_locales')) {
             return null;
         }
         foreach ($authorization->getUiLocales() as $locale) {
             $catalogue = $this->translator->getCatalogue($locale);
             if (in_array('OAuth2FrameworkServer', $catalogue->getDomains())) {
                 return $locale;

75) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Controller/AuthorizationEndpointController.php:215    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!method_exists($this->translator, 'getCatalogue') || !$authorization->hasQueryParam('ui_locales')) {
+        if (!method_exists($this->translator, 'getCatalogue') || $authorization->hasQueryParam('ui_locales')) {
             return null;
         }
         foreach ($authorization->getUiLocales() as $locale) {
             $catalogue = $this->translator->getCatalogue($locale);
             if (in_array('OAuth2FrameworkServer', $catalogue->getDomains())) {
                 return $locale;

76) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Controller/AuthorizationEndpointController.php:215    [M] LogicalOr

--- Original
+++ New
@@ @@
     {
-        if (!method_exists($this->translator, 'getCatalogue') || !$authorization->hasQueryParam('ui_locales')) {
+        if (!method_exists($this->translator, 'getCatalogue') && !$authorization->hasQueryParam('ui_locales')) {
             return null;
         }
         foreach ($authorization->getUiLocales() as $locale) {
             $catalogue = $this->translator->getCatalogue($locale);
             if (in_array('OAuth2FrameworkServer', $catalogue->getDomains())) {
                 return $locale;

77) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Controller/AuthorizationEndpointController.php:219    [M] Foreach_

--- Original
+++ New
@@ @@
         }
-        foreach ($authorization->getUiLocales() as $locale) {
+        foreach (array() as $locale) {
             $catalogue = $this->translator->getCatalogue($locale);
             if (in_array('OAuth2FrameworkServer', $catalogue->getDomains())) {
                 return $locale;
             }
         }
     }

78) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Controller/ClientConfigurationMiddleware.php:47    [M] LogicalNot

--- Original
+++ New
@@ @@
         $routeParameters = $request->getAttribute('_route_params');
-        if (!is_array($routeParameters) || !array_key_exists('client_id', $routeParameters) || null === ($client = $this->clientRepository->find(ClientId::create($routeParameters['client_id'])))) {
+        if (is_array($routeParameters) || !array_key_exists('client_id', $routeParameters) || null === ($client = $this->clientRepository->find(ClientId::create($routeParameters['client_id'])))) {
             throw new OAuth2Exception(400, ['error' => OAuth2ResponseFactoryManager::ERROR_INVALID_REQUEST, 'error_description' => 'Invalid client or invalid registration access token.']);
         }
         $request = $request->withAttribute('client', $client);
         return $handler->handle($request);
     }
 }

79) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Controller/ClientConfigurationMiddleware.php:47    [M] LogicalNot

--- Original
+++ New
@@ @@
         $routeParameters = $request->getAttribute('_route_params');
-        if (!is_array($routeParameters) || !array_key_exists('client_id', $routeParameters) || null === ($client = $this->clientRepository->find(ClientId::create($routeParameters['client_id'])))) {
+        if (!is_array($routeParameters) || array_key_exists('client_id', $routeParameters) || null === ($client = $this->clientRepository->find(ClientId::create($routeParameters['client_id'])))) {
             throw new OAuth2Exception(400, ['error' => OAuth2ResponseFactoryManager::ERROR_INVALID_REQUEST, 'error_description' => 'Invalid client or invalid registration access token.']);
         }
         $request = $request->withAttribute('client', $client);
         return $handler->handle($request);
     }
 }

80) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Controller/ClientConfigurationMiddleware.php:47    [M] LogicalOr

--- Original
+++ New
@@ @@
         $routeParameters = $request->getAttribute('_route_params');
-        if (!is_array($routeParameters) || !array_key_exists('client_id', $routeParameters) || null === ($client = $this->clientRepository->find(ClientId::create($routeParameters['client_id'])))) {
+        if (!is_array($routeParameters) && !array_key_exists('client_id', $routeParameters) || null === ($client = $this->clientRepository->find(ClientId::create($routeParameters['client_id'])))) {
             throw new OAuth2Exception(400, ['error' => OAuth2ResponseFactoryManager::ERROR_INVALID_REQUEST, 'error_description' => 'Invalid client or invalid registration access token.']);
         }
         $request = $request->withAttribute('client', $client);
         return $handler->handle($request);
     }
 }

81) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Controller/ClientConfigurationMiddleware.php:47    [M] Identical

--- Original
+++ New
@@ @@
         $routeParameters = $request->getAttribute('_route_params');
-        if (!is_array($routeParameters) || !array_key_exists('client_id', $routeParameters) || null === ($client = $this->clientRepository->find(ClientId::create($routeParameters['client_id'])))) {
+        if (!is_array($routeParameters) || !array_key_exists('client_id', $routeParameters) || null !== ($client = $this->clientRepository->find(ClientId::create($routeParameters['client_id'])))) {
             throw new OAuth2Exception(400, ['error' => OAuth2ResponseFactoryManager::ERROR_INVALID_REQUEST, 'error_description' => 'Invalid client or invalid registration access token.']);
         }
         $request = $request->withAttribute('client', $client);
         return $handler->handle($request);
     }
 }

82) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Controller/ClientConfigurationMiddleware.php:47    [M] LogicalOr

--- Original
+++ New
@@ @@
         $routeParameters = $request->getAttribute('_route_params');
-        if (!is_array($routeParameters) || !array_key_exists('client_id', $routeParameters) || null === ($client = $this->clientRepository->find(ClientId::create($routeParameters['client_id'])))) {
+        if ((!is_array($routeParameters) || !array_key_exists('client_id', $routeParameters)) && null === ($client = $this->clientRepository->find(ClientId::create($routeParameters['client_id'])))) {
             throw new OAuth2Exception(400, ['error' => OAuth2ResponseFactoryManager::ERROR_INVALID_REQUEST, 'error_description' => 'Invalid client or invalid registration access token.']);
         }
         $request = $request->withAttribute('client', $client);
         return $handler->handle($request);
     }
 }

84) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Controller/MetadataController.php:49    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function enableSignedMetadata(JWSBuilder $jwsBuilder, string $signatureAlgorithm, JWKSet $signatureKeySet)
+    protected function enableSignedMetadata(JWSBuilder $jwsBuilder, string $signatureAlgorithm, JWKSet $signatureKeySet)
     {
         $this->metadataEndpoint->enableSignedMetadata($jwsBuilder, $signatureAlgorithm, $signatureKeySet);
     }
     /**
      * {@inheritdoc}
      */

86) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/AccessTokenHandlerCompilerPass.php:28    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition(AccessTokenHandlerManager::class)) {
+        if ($container->hasDefinition(AccessTokenHandlerManager::class)) {
             return;
         }
         $definition = $container->getDefinition(AccessTokenHandlerManager::class);
         $taggedServices = $container->findTaggedServiceIds('oauth2_server_access_token_handler');
         foreach ($taggedServices as $id => $attributes) {
             $definition->addMethodCall('add', [new Reference($id)]);

87) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/AccessTokenHandlerCompilerPass.php:34    [M] Foreach_

--- Original
+++ New
@@ @@
         $taggedServices = $container->findTaggedServiceIds('oauth2_server_access_token_handler');
-        foreach ($taggedServices as $id => $attributes) {
+        foreach (array() as $id => $attributes) {
             $definition->addMethodCall('add', [new Reference($id)]);
         }
     }
 }

88) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/AccessTokenHandlerCompilerPass.php:26    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function process(ContainerBuilder $container)
+    protected function process(ContainerBuilder $container)
     {
         if (!$container->hasDefinition(AccessTokenHandlerManager::class)) {
             return;
         }
         $definition = $container->getDefinition(AccessTokenHandlerManager::class);
         $taggedServices = $container->findTaggedServiceIds('oauth2_server_access_token_handler');

89) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/AfterConsentScreenCompilerPass.php:28    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition(AfterConsentScreenManager::class)) {
+        if ($container->hasDefinition(AfterConsentScreenManager::class)) {
             return;
         }
         $definition = $container->getDefinition(AfterConsentScreenManager::class);
         $taggedServices = $container->findTaggedServiceIds('oauth2_server_after_consent_screen');
         foreach ($taggedServices as $id => $attributes) {
             $definition->addMethodCall('add', [new Reference($id)]);

90) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/AfterConsentScreenCompilerPass.php:35    [M] Foreach_

--- Original
+++ New
@@ @@
         $taggedServices = $container->findTaggedServiceIds('oauth2_server_after_consent_screen');
-        foreach ($taggedServices as $id => $attributes) {
+        foreach (array() as $id => $attributes) {
             $definition->addMethodCall('add', [new Reference($id)]);
         }
     }
 }

92) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/AuthorizationEndpointRouteCompilerPass.php:28    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$container->has('authorization_endpoint_pipe')) {
+        if ($container->has('authorization_endpoint_pipe')) {
             return;
         }
         $path = $container->getParameter('oauth2_server.endpoint.authorization.path');
         $route_loader = $container->getDefinition(RouteLoader::class);
         $route_loader->addMethodCall('addRoute', ['authorization_endpoint', 'authorization_endpoint_pipe', 'dispatch', $path, [], [], [], '', ['https'], ['GET', 'POST'], '']);
         if (!$container->hasDefinition(MetadataBuilder::class)) {

93) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/AuthorizationEndpointRouteCompilerPass.php:48    [M] LogicalNot

--- Original
+++ New
@@ @@
         $route_loader->addMethodCall('addRoute', ['authorization_endpoint', 'authorization_endpoint_pipe', 'dispatch', $path, [], [], [], '', ['https'], ['GET', 'POST'], '']);
-        if (!$container->hasDefinition(MetadataBuilder::class)) {
+        if ($container->hasDefinition(MetadataBuilder::class)) {
             return;
         }
         $definition = $container->getDefinition(MetadataBuilder::class);
         $definition->addMethodCall('setRoute', ['authorization_endpoint', 'oauth2_server_authorization_endpoint']);
     }
 }

95) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/AuthorizationRequestMetadataCompilerPass.php:29    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition(MetadataBuilder::class) || !$container->hasDefinition(AuthorizationRequestLoader::class)) {
+        if ($container->hasDefinition(MetadataBuilder::class) || !$container->hasDefinition(AuthorizationRequestLoader::class)) {
             return;
         }
         $metadata = $container->getDefinition(MetadataBuilder::class);
         $metadata->addMethodCall('setAuthorizationRequestLoader', [new Reference(AuthorizationRequestLoader::class)]);
     }
 }

96) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/AuthorizationRequestMetadataCompilerPass.php:29    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition(MetadataBuilder::class) || !$container->hasDefinition(AuthorizationRequestLoader::class)) {
+        if (!$container->hasDefinition(MetadataBuilder::class) || $container->hasDefinition(AuthorizationRequestLoader::class)) {
             return;
         }
         $metadata = $container->getDefinition(MetadataBuilder::class);
         $metadata->addMethodCall('setAuthorizationRequestLoader', [new Reference(AuthorizationRequestLoader::class)]);
     }
 }

97) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/AuthorizationRequestMetadataCompilerPass.php:29    [M] LogicalOr

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition(MetadataBuilder::class) || !$container->hasDefinition(AuthorizationRequestLoader::class)) {
+        if (!$container->hasDefinition(MetadataBuilder::class) && !$container->hasDefinition(AuthorizationRequestLoader::class)) {
             return;
         }
         $metadata = $container->getDefinition(MetadataBuilder::class);
         $metadata->addMethodCall('setAuthorizationRequestLoader', [new Reference(AuthorizationRequestLoader::class)]);
     }
 }

99) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/BeforeConsentScreenCompilerPass.php:28    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition(BeforeConsentScreenManager::class)) {
+        if ($container->hasDefinition(BeforeConsentScreenManager::class)) {
             return;
         }
         $definition = $container->getDefinition(BeforeConsentScreenManager::class);
         $taggedServices = $container->findTaggedServiceIds('oauth2_server_before_consent_screen');
         foreach ($taggedServices as $id => $attributes) {
             $definition->addMethodCall('add', [new Reference($id)]);

100) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/BeforeConsentScreenCompilerPass.php:35    [M] Foreach_

--- Original
+++ New
@@ @@
         $taggedServices = $container->findTaggedServiceIds('oauth2_server_before_consent_screen');
-        foreach ($taggedServices as $id => $attributes) {
+        foreach (array() as $id => $attributes) {
             $definition->addMethodCall('add', [new Reference($id)]);
         }
     }
 }

102) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/ClaimSourceCompilerPass.php:28    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition(ClaimSourceManager::class)) {
+        if ($container->hasDefinition(ClaimSourceManager::class)) {
             return;
         }
         $definition = $container->getDefinition(ClaimSourceManager::class);
         $taggedServices = $container->findTaggedServiceIds('oauth2_server_claim_source');
         foreach ($taggedServices as $id => $attributes) {
             $definition->addMethodCall('add', [new Reference($id)]);

103) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/ClaimSourceCompilerPass.php:35    [M] Foreach_

--- Original
+++ New
@@ @@
         $taggedServices = $container->findTaggedServiceIds('oauth2_server_claim_source');
-        foreach ($taggedServices as $id => $attributes) {
+        foreach (array() as $id => $attributes) {
             $definition->addMethodCall('add', [new Reference($id)]);
         }
     }
 }
