105) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/ClientAssertionJWTEncryptionSupportConfigurationCompilerPass.php:28    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition(ClientAssertionJwt::class) || !$container->getParameter('oauth2_server.token_endpoint_auth_method.client_assertion_jwt.encryption.enabled')) {
+        if ($container->hasDefinition(ClientAssertionJwt::class) || !$container->getParameter('oauth2_server.token_endpoint_auth_method.client_assertion_jwt.encryption.enabled')) {
             return;
         }
         $definition = $container->getDefinition(ClientAssertionJwt::class);
         $is_encryption_required = $container->getParameter('oauth2_server.token_endpoint_auth_method.client_assertion_jwt.encryption.required');
         $definition->addMethodCall('enableEncryptedAssertions', [new Reference('jose.jwe_loader.client_assertion_jwt'), $is_encryption_required, new Reference('jose.key_set.oauth2_server.key_set.encryption')]);
     }

106) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/ClientAssertionJWTEncryptionSupportConfigurationCompilerPass.php:28    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition(ClientAssertionJwt::class) || !$container->getParameter('oauth2_server.token_endpoint_auth_method.client_assertion_jwt.encryption.enabled')) {
+        if (!$container->hasDefinition(ClientAssertionJwt::class) || $container->getParameter('oauth2_server.token_endpoint_auth_method.client_assertion_jwt.encryption.enabled')) {
             return;
         }
         $definition = $container->getDefinition(ClientAssertionJwt::class);
         $is_encryption_required = $container->getParameter('oauth2_server.token_endpoint_auth_method.client_assertion_jwt.encryption.required');
         $definition->addMethodCall('enableEncryptedAssertions', [new Reference('jose.jwe_loader.client_assertion_jwt'), $is_encryption_required, new Reference('jose.key_set.oauth2_server.key_set.encryption')]);
     }

107) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/ClientAssertionJWTEncryptionSupportConfigurationCompilerPass.php:28    [M] LogicalOr

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition(ClientAssertionJwt::class) || !$container->getParameter('oauth2_server.token_endpoint_auth_method.client_assertion_jwt.encryption.enabled')) {
+        if (!$container->hasDefinition(ClientAssertionJwt::class) && !$container->getParameter('oauth2_server.token_endpoint_auth_method.client_assertion_jwt.encryption.enabled')) {
             return;
         }
         $definition = $container->getDefinition(ClientAssertionJwt::class);
         $is_encryption_required = $container->getParameter('oauth2_server.token_endpoint_auth_method.client_assertion_jwt.encryption.required');
         $definition->addMethodCall('enableEncryptedAssertions', [new Reference('jose.jwe_loader.client_assertion_jwt'), $is_encryption_required, new Reference('jose.key_set.oauth2_server.key_set.encryption')]);
     }

109) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/ClientConfigurationEndpointRouteCompilerPass.php:28    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition(ClientConfigurationEndpoint::class)) {
+        if ($container->hasDefinition(ClientConfigurationEndpoint::class)) {
             return;
         }
         $path = $container->getParameter('oauth2_server.endpoint.client_configuration.path');
         $route_loader = $container->getDefinition(RouteLoader::class);
         $route_loader->addMethodCall('addRoute', ['client_configuration', 'client_configuration_endpoint_pipe', 'dispatch', $path, [], [], [], '', ['https'], ['GET', 'PUT', 'DELETE'], '']);
     }

111) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/ClientJwtAssertionMetadataCompilerPass.php:29    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition(MetadataBuilder::class)) {
+        if ($container->hasDefinition(MetadataBuilder::class)) {
             return;
         }
         $metadata = $container->getDefinition(MetadataBuilder::class);
         if ($container->hasDefinition(ClientAssertionJwt::class)) {
             $metadata->addMethodCall('setClientAssertionJwt', [new Reference(ClientAssertionJwt::class)]);
         }

113) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/ClientRegistrationEndpointRouteCompilerPass.php:29    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition(ClientRegistrationEndpoint::class)) {
+        if ($container->hasDefinition(ClientRegistrationEndpoint::class)) {
             return;
         }
         $path = $container->getParameter('oauth2_server.endpoint.client_registration.path');
         $route_loader = $container->getDefinition(RouteLoader::class);
         $route_loader->addMethodCall('addRoute', ['client_registration', 'client_registration_endpoint_pipe', 'dispatch', $path, [], [], [], '', ['https'], ['POST'], '']);
         if (!$container->hasDefinition(MetadataBuilder::class)) {

114) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/ClientRegistrationEndpointRouteCompilerPass.php:49    [M] LogicalNot

--- Original
+++ New
@@ @@
         $route_loader->addMethodCall('addRoute', ['client_registration', 'client_registration_endpoint_pipe', 'dispatch', $path, [], [], [], '', ['https'], ['POST'], '']);
-        if (!$container->hasDefinition(MetadataBuilder::class)) {
+        if ($container->hasDefinition(MetadataBuilder::class)) {
             return;
         }
         $definition = $container->getDefinition(MetadataBuilder::class);
         $definition->addMethodCall('setRoute', ['registration_endpoint', 'oauth2_server_client_registration']);
     }
 }

116) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/ClientRuleCompilerPass.php:28    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition(RuleManager::class)) {
+        if ($container->hasDefinition(RuleManager::class)) {
             return;
         }
         $client_manager = $container->getDefinition(RuleManager::class);
         $taggedServices = $container->findTaggedServiceIds('oauth2_server_client_rule');
         foreach ($taggedServices as $id => $attributes) {
             $client_manager->addMethodCall('add', [new Reference($id)]);

117) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/ClientRuleCompilerPass.php:35    [M] Foreach_

--- Original
+++ New
@@ @@
         $taggedServices = $container->findTaggedServiceIds('oauth2_server_client_rule');
-        foreach ($taggedServices as $id => $attributes) {
+        foreach (array() as $id => $attributes) {
             $client_manager->addMethodCall('add', [new Reference($id)]);
         }
     }
 }

122) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/CustomMetadataCompilerPass.php:34    [M] Foreach_

--- Original
+++ New
@@ @@
         $customRoutes = $container->getParameter('oauth2_server.endpoint.metadata.custom_routes');
-        foreach ($customRoutes as $key => $parameters) {
+        foreach (array() as $key => $parameters) {
             $this->addMethodCall($definition, 'setRoute', [$key, $parameters['route_name'], $parameters['route_parameters']]);
         }
         $customValues = $container->getParameter('oauth2_server.endpoint.metadata.custom_values');
         foreach ($customValues as $key => $parameters) {
             $this->addMethodCall($definition, 'addKeyValuePair', [$key, $parameters]);
         }

123) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/CustomMetadataCompilerPass.php:39    [M] Foreach_

--- Original
+++ New
@@ @@
         $customValues = $container->getParameter('oauth2_server.endpoint.metadata.custom_values');
-        foreach ($customValues as $key => $parameters) {
+        foreach (array() as $key => $parameters) {
             $this->addMethodCall($definition, 'addKeyValuePair', [$key, $parameters]);
         }
     }
     /**
      * @param Definition $definition
      * @param string     $method

125) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/GrantTypeCompilerPass.php:29    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition(GrantTypeManager::class)) {
+        if ($container->hasDefinition(GrantTypeManager::class)) {
             return;
         }
         $definition = $container->getDefinition(GrantTypeManager::class);
         $taggedServices = $container->findTaggedServiceIds('oauth2_server_grant_type');
         foreach ($taggedServices as $id => $attributes) {
             $definition->addMethodCall('add', [new Reference($id)]);

126) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/GrantTypeCompilerPass.php:36    [M] Foreach_

--- Original
+++ New
@@ @@
         $taggedServices = $container->findTaggedServiceIds('oauth2_server_grant_type');
-        foreach ($taggedServices as $id => $attributes) {
+        foreach (array() as $id => $attributes) {
             $definition->addMethodCall('add', [new Reference($id)]);
         }
         if (!$container->hasDefinition(MetadataBuilder::class)) {
             return;
         }
         $metadata = $container->getDefinition(MetadataBuilder::class);

127) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/GrantTypeCompilerPass.php:40    [M] LogicalNot

--- Original
+++ New
@@ @@
         }
-        if (!$container->hasDefinition(MetadataBuilder::class)) {
+        if ($container->hasDefinition(MetadataBuilder::class)) {
             return;
         }
         $metadata = $container->getDefinition(MetadataBuilder::class);
         $metadata->addMethodCall('setGrantTypeManager', [new Reference(GrantTypeManager::class)]);
     }
 }

130) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/IdTokenMetadataCompilerPass.php:37    [M] TrueValue

--- Original
+++ New
@@ @@
             $metadata->addMethodCall('addKeyValuePair', ['claim_types_supported', ['normal', 'aggregated', 'distributed']]);
-            $metadata->addMethodCall('addKeyValuePair', ['claims_parameter_supported', true]);
+            $metadata->addMethodCall('addKeyValuePair', ['claims_parameter_supported', false]);
             $metadata->addMethodCall('addKeyValuePair', ['id_token_signing_alg_values_supported', $container->getParameter('oauth2_server.openid_connect.id_token.signature_algorithms')]);
             if (true === $container->getParameter('oauth2_server.openid_connect.id_token.encryption.enabled')) {
                 $metadata->addMethodCall('addKeyValuePair', ['id_token_encryption_alg_values_supported', $container->getParameter('oauth2_server.openid_connect.id_token.encryption.key_encryption_algorithms')]);
                 $metadata->addMethodCall('addKeyValuePair', ['id_token_encryption_enc_values_supported', $container->getParameter('oauth2_server.openid_connect.id_token.encryption.content_encryption_algorithms')]);
             }
         }

131) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/IdTokenMetadataCompilerPass.php:39    [M] TrueValue

--- Original
+++ New
@@ @@
             $metadata->addMethodCall('addKeyValuePair', ['id_token_signing_alg_values_supported', $container->getParameter('oauth2_server.openid_connect.id_token.signature_algorithms')]);
-            if (true === $container->getParameter('oauth2_server.openid_connect.id_token.encryption.enabled')) {
+            if (false === $container->getParameter('oauth2_server.openid_connect.id_token.encryption.enabled')) {
                 $metadata->addMethodCall('addKeyValuePair', ['id_token_encryption_alg_values_supported', $container->getParameter('oauth2_server.openid_connect.id_token.encryption.key_encryption_algorithms')]);
                 $metadata->addMethodCall('addKeyValuePair', ['id_token_encryption_enc_values_supported', $container->getParameter('oauth2_server.openid_connect.id_token.encryption.content_encryption_algorithms')]);
             }
         }
     }
 }

132) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/IdTokenMetadataCompilerPass.php:39    [M] Identical

--- Original
+++ New
@@ @@
             $metadata->addMethodCall('addKeyValuePair', ['id_token_signing_alg_values_supported', $container->getParameter('oauth2_server.openid_connect.id_token.signature_algorithms')]);
-            if (true === $container->getParameter('oauth2_server.openid_connect.id_token.encryption.enabled')) {
+            if (true !== $container->getParameter('oauth2_server.openid_connect.id_token.encryption.enabled')) {
                 $metadata->addMethodCall('addKeyValuePair', ['id_token_encryption_alg_values_supported', $container->getParameter('oauth2_server.openid_connect.id_token.encryption.key_encryption_algorithms')]);
                 $metadata->addMethodCall('addKeyValuePair', ['id_token_encryption_enc_values_supported', $container->getParameter('oauth2_server.openid_connect.id_token.encryption.content_encryption_algorithms')]);
             }
         }
     }
 }

134) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/InitialAccessTokenCompilerPass.php:28    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition(InitialAccessTokenMiddleware::class) || !$container->hasDefinition('client_registration_endpoint_pipe')) {
+        if ($container->hasDefinition(InitialAccessTokenMiddleware::class) || !$container->hasDefinition('client_registration_endpoint_pipe')) {
             return;
         }
         $client_manager = $container->getDefinition('client_registration_endpoint_pipe');
         $client_manager->addMethodCall('addMiddlewareBeforeLastOne', [new Reference(InitialAccessTokenMiddleware::class)]);
     }
 }

135) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/InitialAccessTokenCompilerPass.php:28    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition(InitialAccessTokenMiddleware::class) || !$container->hasDefinition('client_registration_endpoint_pipe')) {
+        if (!$container->hasDefinition(InitialAccessTokenMiddleware::class) || $container->hasDefinition('client_registration_endpoint_pipe')) {
             return;
         }
         $client_manager = $container->getDefinition('client_registration_endpoint_pipe');
         $client_manager->addMethodCall('addMiddlewareBeforeLastOne', [new Reference(InitialAccessTokenMiddleware::class)]);
     }
 }

136) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/InitialAccessTokenCompilerPass.php:28    [M] LogicalOr

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition(InitialAccessTokenMiddleware::class) || !$container->hasDefinition('client_registration_endpoint_pipe')) {
+        if (!$container->hasDefinition(InitialAccessTokenMiddleware::class) && !$container->hasDefinition('client_registration_endpoint_pipe')) {
             return;
         }
         $client_manager = $container->getDefinition('client_registration_endpoint_pipe');
         $client_manager->addMethodCall('addMiddlewareBeforeLastOne', [new Reference(InitialAccessTokenMiddleware::class)]);
     }
 }

138) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/IssuerDiscoveryCompilerPass.php:32    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition(IssuerDiscoveryFactory::class)) {
+        if ($container->hasDefinition(IssuerDiscoveryFactory::class)) {
             return;
         }
         $issuerDiscoveries = $container->getParameter('oauth2_server.endpoint.issuer_discovery');
         foreach ($issuerDiscoveries as $id => $issuerDiscovery) {
             $issuerDiscovery_id = sprintf('oauth2_server_issuer_discovery_%s', $id);
             $issuerDiscoveryDefinition = $container->register($issuerDiscovery_id);

139) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/IssuerDiscoveryCompilerPass.php:38    [M] Foreach_

--- Original
+++ New
@@ @@
         $issuerDiscoveries = $container->getParameter('oauth2_server.endpoint.issuer_discovery');
-        foreach ($issuerDiscoveries as $id => $issuerDiscovery) {
+        foreach (array() as $id => $issuerDiscovery) {
             $issuerDiscovery_id = sprintf('oauth2_server_issuer_discovery_%s', $id);
             $issuerDiscoveryDefinition = $container->register($issuerDiscovery_id);
             $issuerDiscoveryDefinition->setFactory([new Reference(IssuerDiscoveryFactory::class), 'create']);
             $issuerDiscoveryDefinition->setClass(IssuerDiscoveryEndpoint::class);
             $issuerDiscoveryDefinition->setArguments([new Reference($issuerDiscovery['resource_repository']), $issuerDiscovery['server']]);
             $issuerDiscoveryPipeId = sprintf('oauth2_server_issuer_discovery_pipe_%s', $id);

141) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/JwksUriEndpointRouteCompilerPass.php:27    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition(MetadataBuilder::class) || !$container->has('jose.key_set.oauth2_server.endpoint.jwks_uri')) {
+        if ($container->hasDefinition(MetadataBuilder::class) || !$container->has('jose.key_set.oauth2_server.endpoint.jwks_uri')) {
             return;
         }
         $routeName = 'jwkset_oauth2_server.endpoint.jwks_uri';
         //$container->getParameter('oauth2_server.endpoint.jwks_uri.route_name');
         $definition = $container->getDefinition(MetadataBuilder::class);
         $definition->addMethodCall('setRoute', ['jwks_uri', $routeName]);

142) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/JwksUriEndpointRouteCompilerPass.php:27    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition(MetadataBuilder::class) || !$container->has('jose.key_set.oauth2_server.endpoint.jwks_uri')) {
+        if (!$container->hasDefinition(MetadataBuilder::class) || $container->has('jose.key_set.oauth2_server.endpoint.jwks_uri')) {
             return;
         }
         $routeName = 'jwkset_oauth2_server.endpoint.jwks_uri';
         //$container->getParameter('oauth2_server.endpoint.jwks_uri.route_name');
         $definition = $container->getDefinition(MetadataBuilder::class);
         $definition->addMethodCall('setRoute', ['jwks_uri', $routeName]);

143) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/JwksUriEndpointRouteCompilerPass.php:27    [M] LogicalOr

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition(MetadataBuilder::class) || !$container->has('jose.key_set.oauth2_server.endpoint.jwks_uri')) {
+        if (!$container->hasDefinition(MetadataBuilder::class) && !$container->has('jose.key_set.oauth2_server.endpoint.jwks_uri')) {
             return;
         }
         $routeName = 'jwkset_oauth2_server.endpoint.jwks_uri';
         //$container->getParameter('oauth2_server.endpoint.jwks_uri.route_name');
         $definition = $container->getDefinition(MetadataBuilder::class);
         $definition->addMethodCall('setRoute', ['jwks_uri', $routeName]);

145) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/MetadataRouteCompilerPass.php:27    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition('metadata_endpoint_pipe')) {
+        if ($container->hasDefinition('metadata_endpoint_pipe')) {
             return;
         }
         $path = $container->getParameter('oauth2_server.endpoint.metadata.path');
         $route_loader = $container->getDefinition(RouteLoader::class);
         $route_loader->addMethodCall('addRoute', ['metadata_endpoint', 'metadata_endpoint_pipe', 'dispatch', $path, [], [], [], '', ['https'], ['GET'], '']);
     }

147) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/ParameterCheckerCompilerPass.php:28    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition(ParameterCheckerManager::class)) {
+        if ($container->hasDefinition(ParameterCheckerManager::class)) {
             return;
         }
         $definition = $container->getDefinition(ParameterCheckerManager::class);
         $taggedServices = $container->findTaggedServiceIds('oauth2_server_authorization_parameter_checker');
         foreach ($taggedServices as $id => $attributes) {
             $definition->addMethodCall('add', [new Reference($id)]);

148) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/ParameterCheckerCompilerPass.php:35    [M] Foreach_

--- Original
+++ New
@@ @@
         $taggedServices = $container->findTaggedServiceIds('oauth2_server_authorization_parameter_checker');
-        foreach ($taggedServices as $id => $attributes) {
+        foreach (array() as $id => $attributes) {
             $definition->addMethodCall('add', [new Reference($id)]);
         }
     }
 }

150) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/PKCEMethodCompilerPass.php:29    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition(PKCEMethodManager::class)) {
+        if ($container->hasDefinition(PKCEMethodManager::class)) {
             return;
         }
         $definition = $container->getDefinition(PKCEMethodManager::class);
         $taggedServices = $container->findTaggedServiceIds('oauth2_server_pkce_method');
         $loaded = [];
         foreach ($taggedServices as $id => $tags) {

151) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/PKCEMethodCompilerPass.php:38    [M] Foreach_

--- Original
+++ New
@@ @@
         foreach ($taggedServices as $id => $tags) {
-            foreach ($tags as $attributes) {
+            foreach (array() as $attributes) {
                 Assertion::keyExists($attributes, 'alias', sprintf('The PKCE method  "%s" does not have any "alias" attribute.', $id));
                 $loaded[] = $attributes['alias'];
                 $definition->addMethodCall('add', [new Reference($id)]);
             }
         }
         if (!$container->hasDefinition(MetadataBuilder::class)) {

152) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/PKCEMethodCompilerPass.php:37    [M] Foreach_

--- Original
+++ New
@@ @@
         $loaded = [];
-        foreach ($taggedServices as $id => $tags) {
+        foreach (array() as $id => $tags) {
             foreach ($tags as $attributes) {
                 Assertion::keyExists($attributes, 'alias', sprintf('The PKCE method  "%s" does not have any "alias" attribute.', $id));
                 $loaded[] = $attributes['alias'];
                 $definition->addMethodCall('add', [new Reference($id)]);
             }
         }

155) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/RequestObjectCompilerPass.php:28    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition('jose.jws_loader.request_object') || !$container->hasDefinition(AuthorizationRequestLoader::class)) {
+        if ($container->hasDefinition('jose.jws_loader.request_object') || !$container->hasDefinition(AuthorizationRequestLoader::class)) {
             return;
         }
         $metadata = $container->getDefinition(AuthorizationRequestLoader::class);
         $metadata->addMethodCall('enableRequestObjectSupport', [new Reference('jose.jws_loader.request_object'), new Reference('jose.claim_checker.request_object'), []]);
         //FIXME
         if (true === $container->getParameter('oauth2_server.endpoint.authorization.request_object.encryption.enabled')) {

156) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/RequestObjectCompilerPass.php:28    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition('jose.jws_loader.request_object') || !$container->hasDefinition(AuthorizationRequestLoader::class)) {
+        if (!$container->hasDefinition('jose.jws_loader.request_object') || $container->hasDefinition(AuthorizationRequestLoader::class)) {
             return;
         }
         $metadata = $container->getDefinition(AuthorizationRequestLoader::class);
         $metadata->addMethodCall('enableRequestObjectSupport', [new Reference('jose.jws_loader.request_object'), new Reference('jose.claim_checker.request_object'), []]);
         //FIXME
         if (true === $container->getParameter('oauth2_server.endpoint.authorization.request_object.encryption.enabled')) {

157) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/RequestObjectCompilerPass.php:28    [M] LogicalOr

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition('jose.jws_loader.request_object') || !$container->hasDefinition(AuthorizationRequestLoader::class)) {
+        if (!$container->hasDefinition('jose.jws_loader.request_object') && !$container->hasDefinition(AuthorizationRequestLoader::class)) {
             return;
         }
         $metadata = $container->getDefinition(AuthorizationRequestLoader::class);
         $metadata->addMethodCall('enableRequestObjectSupport', [new Reference('jose.jws_loader.request_object'), new Reference('jose.claim_checker.request_object'), []]);
         //FIXME
         if (true === $container->getParameter('oauth2_server.endpoint.authorization.request_object.encryption.enabled')) {

158) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/RequestObjectCompilerPass.php:34    [M] TrueValue

--- Original
+++ New
@@ @@
         //FIXME
-        if (true === $container->getParameter('oauth2_server.endpoint.authorization.request_object.encryption.enabled')) {
+        if (false === $container->getParameter('oauth2_server.endpoint.authorization.request_object.encryption.enabled')) {
             $required = $container->getParameter('oauth2_server.endpoint.authorization.request_object.encryption.required');
             $metadata->addMethodCall('enableEncryptedRequestObjectSupport', [new Reference('jose.jwe_loader.request_object'), new Reference('jose.key_set.oauth2_server.key_set.encryption'), $required]);
         }
         if (true === $container->getParameter('oauth2_server.endpoint.authorization.request_object.reference.enabled')) {
             $uriRegistration = $container->getParameter('oauth2_server.endpoint.authorization.request_object.reference.uris_registration_required');
             $metadata->addMethodCall('enableRequestObjectReferenceSupport', [new Reference('oauth2_server.http.client'), $uriRegistration]);

159) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/RequestObjectCompilerPass.php:34    [M] Identical

--- Original
+++ New
@@ @@
         //FIXME
-        if (true === $container->getParameter('oauth2_server.endpoint.authorization.request_object.encryption.enabled')) {
+        if (true !== $container->getParameter('oauth2_server.endpoint.authorization.request_object.encryption.enabled')) {
             $required = $container->getParameter('oauth2_server.endpoint.authorization.request_object.encryption.required');
             $metadata->addMethodCall('enableEncryptedRequestObjectSupport', [new Reference('jose.jwe_loader.request_object'), new Reference('jose.key_set.oauth2_server.key_set.encryption'), $required]);
         }
         if (true === $container->getParameter('oauth2_server.endpoint.authorization.request_object.reference.enabled')) {
             $uriRegistration = $container->getParameter('oauth2_server.endpoint.authorization.request_object.reference.uris_registration_required');
             $metadata->addMethodCall('enableRequestObjectReferenceSupport', [new Reference('oauth2_server.http.client'), $uriRegistration]);

160) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/RequestObjectCompilerPass.php:39    [M] TrueValue

--- Original
+++ New
@@ @@
         }
-        if (true === $container->getParameter('oauth2_server.endpoint.authorization.request_object.reference.enabled')) {
+        if (false === $container->getParameter('oauth2_server.endpoint.authorization.request_object.reference.enabled')) {
             $uriRegistration = $container->getParameter('oauth2_server.endpoint.authorization.request_object.reference.uris_registration_required');
             $metadata->addMethodCall('enableRequestObjectReferenceSupport', [new Reference('oauth2_server.http.client'), $uriRegistration]);
         }
     }
 }
