161) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/RequestObjectCompilerPass.php:39    [M] Identical

--- Original
+++ New
@@ @@
         }
-        if (true === $container->getParameter('oauth2_server.endpoint.authorization.request_object.reference.enabled')) {
+        if (true !== $container->getParameter('oauth2_server.endpoint.authorization.request_object.reference.enabled')) {
             $uriRegistration = $container->getParameter('oauth2_server.endpoint.authorization.request_object.reference.uris_registration_required');
             $metadata->addMethodCall('enableRequestObjectReferenceSupport', [new Reference('oauth2_server.http.client'), $uriRegistration]);
         }
     }
 }

163) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/ResponseFactoryCompilerPass.php:28    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition(OAuth2ResponseFactoryManager::class)) {
+        if ($container->hasDefinition(OAuth2ResponseFactoryManager::class)) {
             return;
         }
         $definition = $container->getDefinition(OAuth2ResponseFactoryManager::class);
         $taggedServices = $container->findTaggedServiceIds('oauth2_server_response_factory');
         foreach ($taggedServices as $id => $attributes) {
             $definition->addMethodCall('addResponseFactory', [new Reference($id)]);

164) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/ResponseFactoryCompilerPass.php:34    [M] Foreach_

--- Original
+++ New
@@ @@
         $taggedServices = $container->findTaggedServiceIds('oauth2_server_response_factory');
-        foreach ($taggedServices as $id => $attributes) {
+        foreach (array() as $id => $attributes) {
             $definition->addMethodCall('addResponseFactory', [new Reference($id)]);
         }
     }
 }

166) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/ResponseModeCompilerPass.php:29    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition(ResponseModeManager::class)) {
+        if ($container->hasDefinition(ResponseModeManager::class)) {
             return;
         }
         $definition = $container->getDefinition(ResponseModeManager::class);
         $taggedServices = $container->findTaggedServiceIds('oauth2_server_response_mode');
         foreach ($taggedServices as $id => $attributes) {
             $definition->addMethodCall('add', [new Reference($id)]);

167) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/ResponseModeCompilerPass.php:36    [M] Foreach_

--- Original
+++ New
@@ @@
         $taggedServices = $container->findTaggedServiceIds('oauth2_server_response_mode');
-        foreach ($taggedServices as $id => $attributes) {
+        foreach (array() as $id => $attributes) {
             $definition->addMethodCall('add', [new Reference($id)]);
         }
         if (!$container->hasDefinition(MetadataBuilder::class)) {
             return;
         }
         $metadata = $container->getDefinition(MetadataBuilder::class);

170) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/ResponseTypeCompilerPass.php:29    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition(ResponseTypeManager::class)) {
+        if ($container->hasDefinition(ResponseTypeManager::class)) {
             return;
         }
         $definition = $container->getDefinition(ResponseTypeManager::class);
         $taggedServices = $container->findTaggedServiceIds('oauth2_server_response_type');
         foreach ($taggedServices as $id => $attributes) {
             $definition->addMethodCall('add', [new Reference($id)]);

171) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/ResponseTypeCompilerPass.php:36    [M] Foreach_

--- Original
+++ New
@@ @@
         $taggedServices = $container->findTaggedServiceIds('oauth2_server_response_type');
-        foreach ($taggedServices as $id => $attributes) {
+        foreach (array() as $id => $attributes) {
             $definition->addMethodCall('add', [new Reference($id)]);
         }
         if (!$container->hasDefinition(MetadataBuilder::class)) {
             return;
         }
         $metadata = $container->getDefinition(MetadataBuilder::class);

174) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/ScopeMetadataCompilerPass.php:29    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition(MetadataBuilder::class) || !$container->hasAlias(ScopeRepositoryInterface::class)) {
+        if ($container->hasDefinition(MetadataBuilder::class) || !$container->hasAlias(ScopeRepositoryInterface::class)) {
             return;
         }
         $metadata = $container->getDefinition(MetadataBuilder::class);
         $metadata->addMethodCall('setScopeRepository', [new Reference(ScopeRepositoryInterface::class)]);
     }
 }

175) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/ScopeMetadataCompilerPass.php:29    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition(MetadataBuilder::class) || !$container->hasAlias(ScopeRepositoryInterface::class)) {
+        if (!$container->hasDefinition(MetadataBuilder::class) || $container->hasAlias(ScopeRepositoryInterface::class)) {
             return;
         }
         $metadata = $container->getDefinition(MetadataBuilder::class);
         $metadata->addMethodCall('setScopeRepository', [new Reference(ScopeRepositoryInterface::class)]);
     }
 }

176) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/ScopeMetadataCompilerPass.php:29    [M] LogicalOr

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition(MetadataBuilder::class) || !$container->hasAlias(ScopeRepositoryInterface::class)) {
+        if (!$container->hasDefinition(MetadataBuilder::class) && !$container->hasAlias(ScopeRepositoryInterface::class)) {
             return;
         }
         $metadata = $container->getDefinition(MetadataBuilder::class);
         $metadata->addMethodCall('setScopeRepository', [new Reference(ScopeRepositoryInterface::class)]);
     }
 }

178) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/ScopePolicyCompilerPass.php:28    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition(ScopePolicyManager::class)) {
+        if ($container->hasDefinition(ScopePolicyManager::class)) {
             return;
         }
         $definition = $container->getDefinition(ScopePolicyManager::class);
         $default = $container->getParameter('oauth2_server.scope.policy.by_default');
         $taggedServices = $container->findTaggedServiceIds('oauth2_server_scope_policy');
         $default_found = false;

179) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/ScopePolicyCompilerPass.php:36    [M] FalseValue

--- Original
+++ New
@@ @@
         $taggedServices = $container->findTaggedServiceIds('oauth2_server_scope_policy');
-        $default_found = false;
+        $default_found = true;
         $policy_names = [];
         foreach ($taggedServices as $id => $tags) {
             foreach ($tags as $attributes) {
                 Assertion::keyExists($attributes, 'policy_name', sprintf("The scope policy '%s' does not have any 'policy_name' attribute.", $id));
                 $is_default = $default === $attributes['policy_name'];
                 $policy_names[] = $attributes['policy_name'];

180) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/ScopePolicyCompilerPass.php:41    [M] Identical

--- Original
+++ New
@@ @@
                 Assertion::keyExists($attributes, 'policy_name', sprintf("The scope policy '%s' does not have any 'policy_name' attribute.", $id));
-                $is_default = $default === $attributes['policy_name'];
+                $is_default = $default !== $attributes['policy_name'];
                 $policy_names[] = $attributes['policy_name'];
                 if (true === $is_default) {
                     $default_found = true;
                 }
                 $definition->addMethodCall('add', [new Reference($id), $is_default]);
             }

181) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/ScopePolicyCompilerPass.php:43    [M] TrueValue

--- Original
+++ New
@@ @@
                 $policy_names[] = $attributes['policy_name'];
-                if (true === $is_default) {
+                if (false === $is_default) {
                     $default_found = true;
                 }
                 $definition->addMethodCall('add', [new Reference($id), $is_default]);
             }
         }
         Assertion::true($default_found, sprintf('Unable to find the scope policy "%s". Available policies are: %s.', $default, json_encode($policy_names, JSON_UNESCAPED_UNICODE | JSON_UNESCAPED_SLASHES)));

182) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/ScopePolicyCompilerPass.php:43    [M] Identical

--- Original
+++ New
@@ @@
                 $policy_names[] = $attributes['policy_name'];
-                if (true === $is_default) {
+                if (true !== $is_default) {
                     $default_found = true;
                 }
                 $definition->addMethodCall('add', [new Reference($id), $is_default]);
             }
         }
         Assertion::true($default_found, sprintf('Unable to find the scope policy "%s". Available policies are: %s.', $default, json_encode($policy_names, JSON_UNESCAPED_UNICODE | JSON_UNESCAPED_SLASHES)));

183) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/ScopePolicyCompilerPass.php:44    [M] TrueValue

--- Original
+++ New
@@ @@
                 if (true === $is_default) {
-                    $default_found = true;
+                    $default_found = false;
                 }
                 $definition->addMethodCall('add', [new Reference($id), $is_default]);
             }
         }
         Assertion::true($default_found, sprintf('Unable to find the scope policy "%s". Available policies are: %s.', $default, json_encode($policy_names, JSON_UNESCAPED_UNICODE | JSON_UNESCAPED_SLASHES)));
     }

185) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/ScopePolicyCompilerPass.php:38    [M] Foreach_

--- Original
+++ New
@@ @@
         $policy_names = [];
-        foreach ($taggedServices as $id => $tags) {
+        foreach (array() as $id => $tags) {
             foreach ($tags as $attributes) {
                 Assertion::keyExists($attributes, 'policy_name', sprintf("The scope policy '%s' does not have any 'policy_name' attribute.", $id));
                 $is_default = $default === $attributes['policy_name'];
                 $policy_names[] = $attributes['policy_name'];
                 if (true === $is_default) {
                     $default_found = true;

186) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/ScopePolicyCompilerPass.php:50    [M] BitwiseOr

--- Original
+++ New
@@ @@
         }
-        Assertion::true($default_found, sprintf('Unable to find the scope policy "%s". Available policies are: %s.', $default, json_encode($policy_names, JSON_UNESCAPED_UNICODE | JSON_UNESCAPED_SLASHES)));
+        Assertion::true($default_found, sprintf('Unable to find the scope policy "%s". Available policies are: %s.', $default, json_encode($policy_names, JSON_UNESCAPED_UNICODE & JSON_UNESCAPED_SLASHES)));
     }
 }

188) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/SecurityAnnotationCheckerCompilerPass.php:28    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition(AnnotationDriver::class)) {
+        if ($container->hasDefinition(AnnotationDriver::class)) {
             return;
         }
         $definition = $container->getDefinition(AnnotationDriver::class);
         $taggedServices = $container->findTaggedServiceIds('oauth2_server.security.annotation_checker');
         foreach ($taggedServices as $id => $attributes) {
             $definition->addMethodCall('addChecker', [new Reference($id)]);

189) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/SecurityAnnotationCheckerCompilerPass.php:34    [M] Foreach_

--- Original
+++ New
@@ @@
         $taggedServices = $container->findTaggedServiceIds('oauth2_server.security.annotation_checker');
-        foreach ($taggedServices as $id => $attributes) {
+        foreach (array() as $id => $attributes) {
             $definition->addMethodCall('addChecker', [new Reference($id)]);
         }
     }
 }

191) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/SessionManagementRouteCompilerPass.php:28    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition('session_management_pipe') || !$container->getParameter('oauth2_server.endpoint.session_management.enabled')) {
+        if ($container->hasDefinition('session_management_pipe') || !$container->getParameter('oauth2_server.endpoint.session_management.enabled')) {
             return;
         }
         $path = $container->getParameter('oauth2_server.endpoint.session_management.path');
         $route_loader = $container->getDefinition(RouteLoader::class);
         $route_loader->addMethodCall('addRoute', ['openid_connect_iframe_endpoint', 'session_management_pipe', 'dispatch', $path, [], [], [], '', ['https'], ['GET'], '']);
         if (!$container->hasDefinition(MetadataBuilder::class)) {

192) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/SessionManagementRouteCompilerPass.php:28    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition('session_management_pipe') || !$container->getParameter('oauth2_server.endpoint.session_management.enabled')) {
+        if (!$container->hasDefinition('session_management_pipe') || $container->getParameter('oauth2_server.endpoint.session_management.enabled')) {
             return;
         }
         $path = $container->getParameter('oauth2_server.endpoint.session_management.path');
         $route_loader = $container->getDefinition(RouteLoader::class);
         $route_loader->addMethodCall('addRoute', ['openid_connect_iframe_endpoint', 'session_management_pipe', 'dispatch', $path, [], [], [], '', ['https'], ['GET'], '']);
         if (!$container->hasDefinition(MetadataBuilder::class)) {

193) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/SessionManagementRouteCompilerPass.php:28    [M] LogicalOr

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition('session_management_pipe') || !$container->getParameter('oauth2_server.endpoint.session_management.enabled')) {
+        if (!$container->hasDefinition('session_management_pipe') && !$container->getParameter('oauth2_server.endpoint.session_management.enabled')) {
             return;
         }
         $path = $container->getParameter('oauth2_server.endpoint.session_management.path');
         $route_loader = $container->getDefinition(RouteLoader::class);
         $route_loader->addMethodCall('addRoute', ['openid_connect_iframe_endpoint', 'session_management_pipe', 'dispatch', $path, [], [], [], '', ['https'], ['GET'], '']);
         if (!$container->hasDefinition(MetadataBuilder::class)) {

194) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/SessionManagementRouteCompilerPass.php:48    [M] LogicalNot

--- Original
+++ New
@@ @@
         $route_loader->addMethodCall('addRoute', ['openid_connect_iframe_endpoint', 'session_management_pipe', 'dispatch', $path, [], [], [], '', ['https'], ['GET'], '']);
-        if (!$container->hasDefinition(MetadataBuilder::class)) {
+        if ($container->hasDefinition(MetadataBuilder::class)) {
             return;
         }
         $medata = $container->getDefinition(MetadataBuilder::class);
         $medata->addMethodCall('setRoute', ['check_session_iframe', 'oauth2_server_openid_connect_iframe_endpoint']);
     }
 }

196) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/SignedMetadataCompilerPass.php:28    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition(MetadataController::class) || false === $container->getParameter('oauth2_server.endpoint.metadata.signature.enabled')) {
+        if ($container->hasDefinition(MetadataController::class) || false === $container->getParameter('oauth2_server.endpoint.metadata.signature.enabled')) {
             return;
         }
         $signatureAlgorithm = $container->getParameter('oauth2_server.endpoint.metadata.signature.algorithm');
         //$keySey = $container->getAlias('oauth2_server.endpoint.metadata.signature.key_set');
         $metadata = $container->getDefinition(MetadataController::class);
         $metadata->addMethodCall('enableSignedMetadata', [new Reference('jose.jws_builder.metadata_signature'), $signatureAlgorithm, new Reference('jose.key_set.oauth2_server.key_set.signature')]);

197) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/SignedMetadataCompilerPass.php:28    [M] FalseValue

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition(MetadataController::class) || false === $container->getParameter('oauth2_server.endpoint.metadata.signature.enabled')) {
+        if (!$container->hasDefinition(MetadataController::class) || true === $container->getParameter('oauth2_server.endpoint.metadata.signature.enabled')) {
             return;
         }
         $signatureAlgorithm = $container->getParameter('oauth2_server.endpoint.metadata.signature.algorithm');
         //$keySey = $container->getAlias('oauth2_server.endpoint.metadata.signature.key_set');
         $metadata = $container->getDefinition(MetadataController::class);
         $metadata->addMethodCall('enableSignedMetadata', [new Reference('jose.jws_builder.metadata_signature'), $signatureAlgorithm, new Reference('jose.key_set.oauth2_server.key_set.signature')]);

198) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/SignedMetadataCompilerPass.php:28    [M] Identical

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition(MetadataController::class) || false === $container->getParameter('oauth2_server.endpoint.metadata.signature.enabled')) {
+        if (!$container->hasDefinition(MetadataController::class) || false !== $container->getParameter('oauth2_server.endpoint.metadata.signature.enabled')) {
             return;
         }
         $signatureAlgorithm = $container->getParameter('oauth2_server.endpoint.metadata.signature.algorithm');
         //$keySey = $container->getAlias('oauth2_server.endpoint.metadata.signature.key_set');
         $metadata = $container->getDefinition(MetadataController::class);
         $metadata->addMethodCall('enableSignedMetadata', [new Reference('jose.jws_builder.metadata_signature'), $signatureAlgorithm, new Reference('jose.key_set.oauth2_server.key_set.signature')]);

199) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/SignedMetadataCompilerPass.php:28    [M] LogicalOr

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition(MetadataController::class) || false === $container->getParameter('oauth2_server.endpoint.metadata.signature.enabled')) {
+        if (!$container->hasDefinition(MetadataController::class) && false === $container->getParameter('oauth2_server.endpoint.metadata.signature.enabled')) {
             return;
         }
         $signatureAlgorithm = $container->getParameter('oauth2_server.endpoint.metadata.signature.algorithm');
         //$keySey = $container->getAlias('oauth2_server.endpoint.metadata.signature.key_set');
         $metadata = $container->getDefinition(MetadataController::class);
         $metadata->addMethodCall('enableSignedMetadata', [new Reference('jose.jws_builder.metadata_signature'), $signatureAlgorithm, new Reference('jose.key_set.oauth2_server.key_set.signature')]);

201) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/TokenEndpointAuthMethodCompilerPass.php:29    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition(TokenEndpointAuthMethodManager::class)) {
+        if ($container->hasDefinition(TokenEndpointAuthMethodManager::class)) {
             return;
         }
         $definition = $container->getDefinition(TokenEndpointAuthMethodManager::class);
         $taggedServices = $container->findTaggedServiceIds('oauth2_server_token_endpoint_auth_method');
         foreach ($taggedServices as $id => $attributes) {
             $definition->addMethodCall('add', [new Reference($id)]);

202) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/TokenEndpointAuthMethodCompilerPass.php:36    [M] Foreach_

--- Original
+++ New
@@ @@
         $taggedServices = $container->findTaggedServiceIds('oauth2_server_token_endpoint_auth_method');
-        foreach ($taggedServices as $id => $attributes) {
+        foreach (array() as $id => $attributes) {
             $definition->addMethodCall('add', [new Reference($id)]);
         }
         if (!$container->hasDefinition(MetadataBuilder::class)) {
             return;
         }
         $metadata = $container->getDefinition(MetadataBuilder::class);

205) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/TokenEndpointExtensionCompilerPass.php:28    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition(TokenEndpointExtensionManager::class)) {
+        if ($container->hasDefinition(TokenEndpointExtensionManager::class)) {
             return;
         }
         $definition = $container->getDefinition(TokenEndpointExtensionManager::class);
         $taggedServices = $container->findTaggedServiceIds('oauth2_server_token_endpoint_extension');
         foreach ($taggedServices as $id => $attributes) {
             $definition->addMethodCall('add', [new Reference($id)]);

206) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/TokenEndpointExtensionCompilerPass.php:35    [M] Foreach_

--- Original
+++ New
@@ @@
         $taggedServices = $container->findTaggedServiceIds('oauth2_server_token_endpoint_extension');
-        foreach ($taggedServices as $id => $attributes) {
+        foreach (array() as $id => $attributes) {
             $definition->addMethodCall('add', [new Reference($id)]);
         }
     }
 }

208) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/TokenIntrospectionEndpointAuthMethodCompilerPass.php:28    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition(TokenIntrospectionEndpointAuthMethodManager::class)) {
+        if ($container->hasDefinition(TokenIntrospectionEndpointAuthMethodManager::class)) {
             return;
         }
         $definition = $container->getDefinition(TokenIntrospectionEndpointAuthMethodManager::class);
         $taggedServices = $container->findTaggedServiceIds('token_introspection_endpoint_auth_method');
         foreach ($taggedServices as $id => $attributes) {
             $definition->addMethodCall('addTokenIntrospectionEndpointAuthMethod', [new Reference($id)]);

209) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/TokenIntrospectionEndpointAuthMethodCompilerPass.php:34    [M] Foreach_

--- Original
+++ New
@@ @@
         $taggedServices = $container->findTaggedServiceIds('token_introspection_endpoint_auth_method');
-        foreach ($taggedServices as $id => $attributes) {
+        foreach (array() as $id => $attributes) {
             $definition->addMethodCall('addTokenIntrospectionEndpointAuthMethod', [new Reference($id)]);
         }
     }
 }

211) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/TokenIntrospectionRouteCompilerPass.php:28    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition('token_introspection_pipe')) {
+        if ($container->hasDefinition('token_introspection_pipe')) {
             return;
         }
         $path = $container->getParameter('oauth2_server.endpoint.token_introspection.path');
         $route_loader = $container->getDefinition(RouteLoader::class);
         $route_loader->addMethodCall('addRoute', ['token_introspection_endpoint', 'token_introspection_pipe', 'dispatch', $path, [], [], [], '', ['https'], ['POST'], '']);
         if (!$container->hasDefinition(MetadataBuilder::class)) {

212) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/TokenIntrospectionRouteCompilerPass.php:48    [M] LogicalNot

--- Original
+++ New
@@ @@
         $route_loader->addMethodCall('addRoute', ['token_introspection_endpoint', 'token_introspection_pipe', 'dispatch', $path, [], [], [], '', ['https'], ['POST'], '']);
-        if (!$container->hasDefinition(MetadataBuilder::class)) {
+        if ($container->hasDefinition(MetadataBuilder::class)) {
             return;
         }
         $definition = $container->getDefinition(MetadataBuilder::class);
         $definition->addMethodCall('setRoute', ['token_introspection_endpoint', 'oauth2_server_token_introspection_endpoint']);
     }
 }

214) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/TokenRevocationRouteCompilerPass.php:28    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition('token_revocation_pipe')) {
+        if ($container->hasDefinition('token_revocation_pipe')) {
             return;
         }
         $path = $container->getParameter('oauth2_server.endpoint.token_revocation.path');
         $route_loader = $container->getDefinition(RouteLoader::class);
         $route_loader->addMethodCall('addRoute', ['token_revocation_endpoint', 'token_revocation_pipe', 'dispatch', $path, [], [], [], '', ['https'], ['GET', 'POST'], '']);
         if (!$container->hasDefinition(MetadataBuilder::class)) {

215) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/TokenRevocationRouteCompilerPass.php:48    [M] LogicalNot

--- Original
+++ New
@@ @@
         $route_loader->addMethodCall('addRoute', ['token_revocation_endpoint', 'token_revocation_pipe', 'dispatch', $path, [], [], [], '', ['https'], ['GET', 'POST'], '']);
-        if (!$container->hasDefinition(MetadataBuilder::class)) {
+        if ($container->hasDefinition(MetadataBuilder::class)) {
             return;
         }
         $definition = $container->getDefinition(MetadataBuilder::class);
         $definition->addMethodCall('setRoute', ['token_revocation_endpoint', 'oauth2_server_token_revocation_endpoint']);
     }
 }

217) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/TokenRouteCompilerPass.php:28    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition('token_endpoint_pipe')) {
+        if ($container->hasDefinition('token_endpoint_pipe')) {
             return;
         }
         $path = $container->getParameter('oauth2_server.endpoint.token.path');
         $route_loader = $container->getDefinition(RouteLoader::class);
         $route_loader->addMethodCall('addRoute', ['token_endpoint', 'token_endpoint_pipe', 'dispatch', $path, [], [], [], '', ['https'], ['POST'], '']);
         if (!$container->hasDefinition(MetadataBuilder::class)) {

218) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/TokenRouteCompilerPass.php:48    [M] LogicalNot

--- Original
+++ New
@@ @@
         $route_loader->addMethodCall('addRoute', ['token_endpoint', 'token_endpoint_pipe', 'dispatch', $path, [], [], [], '', ['https'], ['POST'], '']);
-        if (!$container->hasDefinition(MetadataBuilder::class)) {
+        if ($container->hasDefinition(MetadataBuilder::class)) {
             return;
         }
         $definition = $container->getDefinition(MetadataBuilder::class);
         $definition->addMethodCall('setRoute', ['token_endpoint', 'oauth2_server_token_endpoint']);
     }
 }
