220) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/TokenTypeCompilerPass.php:28    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition(TokenTypeManager::class)) {
+        if ($container->hasDefinition(TokenTypeManager::class)) {
             return;
         }
         $definition = $container->getDefinition(TokenTypeManager::class);
         $default = $container->getParameter('oauth2_server.token_type.default');
         $taggedServices = $container->findTaggedServiceIds('oauth2_server_token_type');
         $default_found = false;

221) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/TokenTypeCompilerPass.php:35    [M] FalseValue

--- Original
+++ New
@@ @@
         $taggedServices = $container->findTaggedServiceIds('oauth2_server_token_type');
-        $default_found = false;
+        $default_found = true;
         $token_type_names = [];
         foreach ($taggedServices as $id => $tags) {
             foreach ($tags as $attributes) {
                 Assertion::keyExists($attributes, 'scheme', sprintf("The token type '%s' does not have any 'scheme' attribute.", $id));
                 $is_default = $default === $attributes['scheme'];
                 $token_type_names[] = $attributes['scheme'];

222) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/TokenTypeCompilerPass.php:40    [M] Identical

--- Original
+++ New
@@ @@
                 Assertion::keyExists($attributes, 'scheme', sprintf("The token type '%s' does not have any 'scheme' attribute.", $id));
-                $is_default = $default === $attributes['scheme'];
+                $is_default = $default !== $attributes['scheme'];
                 $token_type_names[] = $attributes['scheme'];
                 if (true === $is_default) {
                     $default_found = true;
                 }
                 $definition->addMethodCall('add', [new Reference($id), $is_default]);
             }

223) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/TokenTypeCompilerPass.php:42    [M] TrueValue

--- Original
+++ New
@@ @@
                 $token_type_names[] = $attributes['scheme'];
-                if (true === $is_default) {
+                if (false === $is_default) {
                     $default_found = true;
                 }
                 $definition->addMethodCall('add', [new Reference($id), $is_default]);
             }
         }
         Assertion::true($default_found, sprintf('Unable to find the token type "%s". Available token types are: %s.', $default, json_encode($token_type_names, JSON_UNESCAPED_UNICODE | JSON_UNESCAPED_SLASHES)));

224) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/TokenTypeCompilerPass.php:42    [M] Identical

--- Original
+++ New
@@ @@
                 $token_type_names[] = $attributes['scheme'];
-                if (true === $is_default) {
+                if (true !== $is_default) {
                     $default_found = true;
                 }
                 $definition->addMethodCall('add', [new Reference($id), $is_default]);
             }
         }
         Assertion::true($default_found, sprintf('Unable to find the token type "%s". Available token types are: %s.', $default, json_encode($token_type_names, JSON_UNESCAPED_UNICODE | JSON_UNESCAPED_SLASHES)));

227) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/TokenTypeCompilerPass.php:37    [M] Foreach_

--- Original
+++ New
@@ @@
         $token_type_names = [];
-        foreach ($taggedServices as $id => $tags) {
+        foreach (array() as $id => $tags) {
             foreach ($tags as $attributes) {
                 Assertion::keyExists($attributes, 'scheme', sprintf("The token type '%s' does not have any 'scheme' attribute.", $id));
                 $is_default = $default === $attributes['scheme'];
                 $token_type_names[] = $attributes['scheme'];
                 if (true === $is_default) {
                     $default_found = true;

228) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/TokenTypeCompilerPass.php:48    [M] BitwiseOr

--- Original
+++ New
@@ @@
         }
-        Assertion::true($default_found, sprintf('Unable to find the token type "%s". Available token types are: %s.', $default, json_encode($token_type_names, JSON_UNESCAPED_UNICODE | JSON_UNESCAPED_SLASHES)));
+        Assertion::true($default_found, sprintf('Unable to find the token type "%s". Available token types are: %s.', $default, json_encode($token_type_names, JSON_UNESCAPED_UNICODE & JSON_UNESCAPED_SLASHES)));
     }
 }

230) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/TokenTypeHintCompilerPass.php:28    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition(TokenTypeHintManager::class)) {
+        if ($container->hasDefinition(TokenTypeHintManager::class)) {
             return;
         }
         $definition = $container->getDefinition(TokenTypeHintManager::class);
         $taggedServices = $container->findTaggedServiceIds('oauth2_server_token_type_hint');
         foreach ($taggedServices as $id => $attributes) {
             $definition->addMethodCall('add', [new Reference($id)]);

231) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/TokenTypeHintCompilerPass.php:35    [M] Foreach_

--- Original
+++ New
@@ @@
         $taggedServices = $container->findTaggedServiceIds('oauth2_server_token_type_hint');
-        foreach ($taggedServices as $id => $attributes) {
+        foreach (array() as $id => $attributes) {
             $definition->addMethodCall('add', [new Reference($id)]);
         }
     }
 }

233) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/UserAccountDiscoveryCompilerPass.php:28    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition(UserAccountDiscoveryManager::class)) {
+        if ($container->hasDefinition(UserAccountDiscoveryManager::class)) {
             return;
         }
         $definition = $container->getDefinition(UserAccountDiscoveryManager::class);
         $taggedServices = $container->findTaggedServiceIds('oauth2_server_user_account_discovery');
         foreach ($taggedServices as $id => $attributes) {
             $definition->addMethodCall('add', [new Reference($id)]);

234) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/UserAccountDiscoveryCompilerPass.php:35    [M] Foreach_

--- Original
+++ New
@@ @@
         $taggedServices = $container->findTaggedServiceIds('oauth2_server_user_account_discovery');
-        foreach ($taggedServices as $id => $attributes) {
+        foreach (array() as $id => $attributes) {
             $definition->addMethodCall('add', [new Reference($id)]);
         }
     }
 }

236) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/UserinfoEndpointEncryptionCompilerPass.php:29    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition(UserInfoEndpoint::class) || !$container->hasDefinition('jose.jwe_builder.oauth2_server.userinfo')) {
+        if ($container->hasDefinition(UserInfoEndpoint::class) || !$container->hasDefinition('jose.jwe_builder.oauth2_server.userinfo')) {
             return;
         }
         $definition = $container->getDefinition(UserInfoEndpoint::class);
         $definition->addMethodCall('enableEncryption', [new Reference('jose.jwe_builder.oauth2_server.userinfo')]);
         if ($container->hasDefinition(MetadataBuilder::class)) {
             $definition = $container->getDefinition(MetadataBuilder::class);

237) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/UserinfoEndpointEncryptionCompilerPass.php:29    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition(UserInfoEndpoint::class) || !$container->hasDefinition('jose.jwe_builder.oauth2_server.userinfo')) {
+        if (!$container->hasDefinition(UserInfoEndpoint::class) || $container->hasDefinition('jose.jwe_builder.oauth2_server.userinfo')) {
             return;
         }
         $definition = $container->getDefinition(UserInfoEndpoint::class);
         $definition->addMethodCall('enableEncryption', [new Reference('jose.jwe_builder.oauth2_server.userinfo')]);
         if ($container->hasDefinition(MetadataBuilder::class)) {
             $definition = $container->getDefinition(MetadataBuilder::class);

238) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/UserinfoEndpointEncryptionCompilerPass.php:29    [M] LogicalOr

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition(UserInfoEndpoint::class) || !$container->hasDefinition('jose.jwe_builder.oauth2_server.userinfo')) {
+        if (!$container->hasDefinition(UserInfoEndpoint::class) && !$container->hasDefinition('jose.jwe_builder.oauth2_server.userinfo')) {
             return;
         }
         $definition = $container->getDefinition(UserInfoEndpoint::class);
         $definition->addMethodCall('enableEncryption', [new Reference('jose.jwe_builder.oauth2_server.userinfo')]);
         if ($container->hasDefinition(MetadataBuilder::class)) {
             $definition = $container->getDefinition(MetadataBuilder::class);

240) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/UserinfoEndpointSignatureCompilerPass.php:29    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition(UserInfoEndpoint::class) || !$container->hasDefinition('jose.jws_builder.oauth2_server.userinfo')) {
+        if ($container->hasDefinition(UserInfoEndpoint::class) || !$container->hasDefinition('jose.jws_builder.oauth2_server.userinfo')) {
             return;
         }
         $definition = $container->getDefinition(UserInfoEndpoint::class);
         $definition->addMethodCall('enableSignature', [new Reference('jose.jws_builder.oauth2_server.userinfo'), new Reference('jose.key_set.oauth2_server.key_set.signature')]);
         if ($container->hasDefinition(MetadataBuilder::class)) {
             $definition = $container->getDefinition(MetadataBuilder::class);

241) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/UserinfoEndpointSignatureCompilerPass.php:29    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition(UserInfoEndpoint::class) || !$container->hasDefinition('jose.jws_builder.oauth2_server.userinfo')) {
+        if (!$container->hasDefinition(UserInfoEndpoint::class) || $container->hasDefinition('jose.jws_builder.oauth2_server.userinfo')) {
             return;
         }
         $definition = $container->getDefinition(UserInfoEndpoint::class);
         $definition->addMethodCall('enableSignature', [new Reference('jose.jws_builder.oauth2_server.userinfo'), new Reference('jose.key_set.oauth2_server.key_set.signature')]);
         if ($container->hasDefinition(MetadataBuilder::class)) {
             $definition = $container->getDefinition(MetadataBuilder::class);

242) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/UserinfoEndpointSignatureCompilerPass.php:29    [M] LogicalOr

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition(UserInfoEndpoint::class) || !$container->hasDefinition('jose.jws_builder.oauth2_server.userinfo')) {
+        if (!$container->hasDefinition(UserInfoEndpoint::class) && !$container->hasDefinition('jose.jws_builder.oauth2_server.userinfo')) {
             return;
         }
         $definition = $container->getDefinition(UserInfoEndpoint::class);
         $definition->addMethodCall('enableSignature', [new Reference('jose.jws_builder.oauth2_server.userinfo'), new Reference('jose.key_set.oauth2_server.key_set.signature')]);
         if ($container->hasDefinition(MetadataBuilder::class)) {
             $definition = $container->getDefinition(MetadataBuilder::class);

244) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/UserInfoPairwiseSubjectCompilerPass.php:29    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasAlias('oauth2_server.openid_connect.pairwise_subject.service')) {
+        if ($container->hasAlias('oauth2_server.openid_connect.pairwise_subject.service')) {
             return;
         }
         $definition = $container->getDefinition(UserInfo::class);
         $service = $container->getAlias('oauth2_server.openid_connect.pairwise_subject.service');
         $isDefault = $container->getParameter('oauth2_server.openid_connect.pairwise_subject.is_default');
         $definition->addMethodCall('enablePairwiseSubject', [new Reference($service), $isDefault]);

246) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/UserinfoRouteCompilerPass.php:28    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition('oauth2_server_userinfo_pipe')) {
+        if ($container->hasDefinition('oauth2_server_userinfo_pipe')) {
             return;
         }
         $path = $container->getParameter('oauth2_server.openid_connect.userinfo_endpoint.path');
         $route_loader = $container->getDefinition(RouteLoader::class);
         $route_loader->addMethodCall('addRoute', ['openid_connect_userinfo_endpoint', 'oauth2_server_userinfo_pipe', 'dispatch', $path, [], [], [], '', ['https'], ['GET', 'POST'], '']);
         if (!$container->hasDefinition(MetadataBuilder::class)) {

247) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/UserinfoRouteCompilerPass.php:48    [M] LogicalNot

--- Original
+++ New
@@ @@
         $route_loader->addMethodCall('addRoute', ['openid_connect_userinfo_endpoint', 'oauth2_server_userinfo_pipe', 'dispatch', $path, [], [], [], '', ['https'], ['GET', 'POST'], '']);
-        if (!$container->hasDefinition(MetadataBuilder::class)) {
+        if ($container->hasDefinition(MetadataBuilder::class)) {
             return;
         }
         $definition = $container->getDefinition(MetadataBuilder::class);
         $definition->addMethodCall('setRoute', ['userinfo_endpoint', 'oauth2_server_openid_connect_userinfo_endpoint']);
     }
 }

249) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/UserInfoScopeSupportCompilerPass.php:28    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$container->hasDefinition(UserInfoScopeSupportManager::class)) {
+        if ($container->hasDefinition(UserInfoScopeSupportManager::class)) {
             return;
         }
         $definition = $container->getDefinition(UserInfoScopeSupportManager::class);
         $taggedServices = $container->findTaggedServiceIds('oauth2_server_userinfo_scope_support');
         foreach ($taggedServices as $id => $attributes) {
             $definition->addMethodCall('add', [new Reference($id)]);

250) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Compiler/UserInfoScopeSupportCompilerPass.php:35    [M] Foreach_

--- Original
+++ New
@@ @@
         $taggedServices = $container->findTaggedServiceIds('oauth2_server_userinfo_scope_support');
-        foreach ($taggedServices as $id => $attributes) {
+        foreach (array() as $id => $attributes) {
             $definition->addMethodCall('add', [new Reference($id)]);
         }
     }
 }

252) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Configuration.php:48    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function getConfigTreeBuilder()
+    protected function getConfigTreeBuilder()
     {
         $treeBuilder = new TreeBuilder();
         $rootNode = $treeBuilder->root($this->alias);
         $rootNode->addDefaultsIfNotSet();
         $this->buildFromSources($this->sourceMap, $rootNode);
         return $treeBuilder;

253) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Configuration.php:68    [M] LogicalAnd

--- Original
+++ New
@@ @@
                 $source->addConfiguration($node);
-            } elseif (is_string($k) && is_array($source)) {
+            } elseif (is_string($k) || is_array($source)) {
                 $childNode = $node->children()->arrayNode($k);
                 $this->buildFromSources($source, $childNode);
             }
         }
     }
 }

254) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Configuration.php:65    [M] Foreach_

--- Original
+++ New
@@ @@
     {
-        foreach ($sources as $k => $source) {
+        foreach (array() as $k => $source) {
             if ($source instanceof SourceInterface) {
                 $source->addConfiguration($node);
             } elseif (is_string($k) && is_array($source)) {
                 $childNode = $node->children()->arrayNode($k);
                 $this->buildFromSources($source, $childNode);
             }

255) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/OAuth2FrameworkServerExtension.php:63    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function getAlias()
+    protected function getAlias()
     {
         return $this->alias;
     }
     /**
      * {@inheritdoc}
      */

256) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/OAuth2FrameworkServerExtension.php:71    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function load(array $configs, ContainerBuilder $container)
+    protected function load(array $configs, ContainerBuilder $container)
     {
         $configuration = new Configuration($this->alias, $this->sourceMap);
         $mergedConfig = $this->processConfiguration($configuration, $configs);
         $path = 'oauth2_server';
         $this->loadSources($path, $this->sourceMap, $mergedConfig, $container);
         $this->loadInternal($mergedConfig, $container);

257) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/OAuth2FrameworkServerExtension.php:83    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function prepend(ContainerBuilder $container)
+    protected function prepend(ContainerBuilder $container)
     {
         $bundleConfig = current($container->getExtensionConfig($this->getAlias()));
         $this->prependSources($bundleConfig, '', $this->sourceMap, $container);
     }
     /**
      * @param string            $path

258) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/OAuth2FrameworkServerExtension.php:100    [M] LogicalAnd

--- Original
+++ New
@@ @@
                 $source->load($path, $container, $mergedConfig);
-            } elseif (is_string($k) && is_array($source)) {
+            } elseif (is_string($k) || is_array($source)) {
                 $this->loadSources($path . '.' . $k, $source, $mergedConfig[$k], $container);
             }
         }
     }
     /**
      * @param array             $bundleConfig

260) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/OAuth2FrameworkServerExtension.php:117    [M] LogicalAnd

--- Original
+++ New
@@ @@
                 $source->prepend($bundleConfig, $path, $container);
-            } elseif (is_string($k) && is_array($source)) {
+            } elseif (is_string($k) || is_array($source)) {
                 $this->prependSources($bundleConfig, $path . '[' . $k . ']', $source, $container);
             }
         }
     }
     /**
      * @param array            $mergedConfig

262) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/OAuth2FrameworkServerExtension.php:139    [M] Foreach_

--- Original
+++ New
@@ @@
         $files = ['access_token', 'access_token_handler', 'route_loader', 'token_type_hint', 'oauth2_response', 'user_account_discovery', 'content_parser_middleware'];
-        foreach ($files as $basename) {
+        foreach (array() as $basename) {
             $loader->load(sprintf('%s.php', $basename));
         }
     }
     private function initSourceMap()
     {

263) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/OAuth2FrameworkServerExtension.php:127    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
      */
-    protected function loadInternal(array $mergedConfig, ContainerBuilder $container)
+    private function loadInternal(array $mergedConfig, ContainerBuilder $container)
     {
         $loader = new PhpConfigFileLoader($container, new FileLocator(__DIR__ . '/../Resources/config'));
         $files = ['access_token', 'access_token_handler', 'route_loader', 'token_type_hint', 'oauth2_response', 'user_account_discovery', 'content_parser_middleware'];
         foreach ($files as $basename) {
             $loader->load(sprintf('%s.php', $basename));
         }

264) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/AccessTokenRepositorySource.php:24    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
      */
-    protected function name() : string
+    private function name() : string
     {
         return 'access_token';
     }
     /**
      * {@inheritdoc}
      */

265) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/AccessTokenRepositorySource.php:34    [M] Foreach_

--- Original
+++ New
@@ @@
     {
-        foreach (['repository'] as $k) {
+        foreach (array() as $k) {
             $container->setAlias($path . '.' . $k, $config[$k]);
         }
     }
     /**
      * {@inheritdoc}
      */

266) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/AccessTokenRepositorySource.php:32    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
      */
-    protected function continueLoading(string $path, ContainerBuilder $container, array $config)
+    private function continueLoading(string $path, ContainerBuilder $container, array $config)
     {
         foreach (['repository'] as $k) {
             $container->setAlias($path . '.' . $k, $config[$k]);
         }
     }
     /**

267) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/AccessTokenRepositorySource.php:42    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
      */
-    protected function continueConfiguration(NodeDefinition $node)
+    private function continueConfiguration(NodeDefinition $node)
     {
         parent::continueConfiguration($node);
         $node->children()->scalarNode('repository')->info('The access token repository.')->isRequired()->end()->end();
     }
 }

268) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/ActionableSource.php:27    [M] TrueValue

--- Original
+++ New
@@ @@
         $container->setParameter($path . '.' . $this->name() . '.enabled', $config[$this->name()]['enabled']);
-        if (true === $config[$this->name()]['enabled']) {
+        if (false === $config[$this->name()]['enabled']) {
             parent::load($path, $container, $config);
         }
     }
     /**
      * {@inheritdoc}
      */

269) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/ActionableSource.php:27    [M] Identical

--- Original
+++ New
@@ @@
         $container->setParameter($path . '.' . $this->name() . '.enabled', $config[$this->name()]['enabled']);
-        if (true === $config[$this->name()]['enabled']) {
+        if (true !== $config[$this->name()]['enabled']) {
             parent::load($path, $container, $config);
         }
     }
     /**
      * {@inheritdoc}
      */

270) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/ActionableSource.php:24    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function load(string $path, ContainerBuilder $container, array $config)
+    protected function load(string $path, ContainerBuilder $container, array $config)
     {
         $container->setParameter($path . '.' . $this->name() . '.enabled', $config[$this->name()]['enabled']);
         if (true === $config[$this->name()]['enabled']) {
             parent::load($path, $container, $config);
         }
     }

272) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/ArraySource.php:33    [M] Foreach_

--- Original
+++ New
@@ @@
     {
-        foreach ($this->subSources as $subSource) {
+        foreach (array() as $subSource) {
             $subSource->load($path . '.' . $this->name(), $container, $config[$this->name()]);
         }
         $this->continueLoading($path . '.' . $this->name(), $container, $config[$this->name()]);
     }
     /**
      * {@inheritdoc}

275) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/ArraySource.php:42    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function prepend(array $bundleConfig, string $path, ContainerBuilder $container)
+    protected function prepend(array $bundleConfig, string $path, ContainerBuilder $container)
     {
         foreach ($this->subSources as $subSource) {
             $subSource->prepend($bundleConfig, $path . '[' . $this->name() . ']', $container);
         }
     }
     /**

276) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/ArraySource.php:59    [M] Foreach_

--- Original
+++ New
@@ @@
         $this->continueConfiguration($sourceNode);
-        foreach ($this->subSources as $subSource) {
+        foreach (array() as $subSource) {
             $subSource->addConfiguration($sourceNode);
         }
     }
     /**
      * @param string           $path
      * @param ContainerBuilder $container

277) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/ArraySource.php:52    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function addConfiguration(NodeDefinition $node)
+    protected function addConfiguration(NodeDefinition $node)
     {
         $sourceNode = $node->children()->arrayNode($this->name())->addDefaultsIfNotSet();
         $this->continueConfiguration($sourceNode);
         foreach ($this->subSources as $subSource) {
             $subSource->addConfiguration($sourceNode);
         }

280) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/ArraySource.php:89    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
      */
-    protected function addSubSource(SourceInterface $source)
+    private function addSubSource(SourceInterface $source)
     {
         $this->subSources[] = $source;
     }
 }

284) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Endpoint/AuthorizationEndpointFormPostResponseModeSource.php:29    [M] Foreach_

--- Original
+++ New
@@ @@
     {
-        foreach ($config as $k => $v) {
+        foreach (array() as $k => $v) {
             $container->setParameter($path . '.' . $k, $v);
         }
         $loader = new PhpConfigFileLoader($container, new FileLocator(__DIR__ . '/../../../Resources/config/endpoint'));
         $loader->load('form_post_response_mode.php');
     }
     /**

290) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Endpoint/AuthorizationEndpointPreConfiguredAuthorizationSource.php:52    [M] TrueValue

--- Original
+++ New
@@ @@
         $node->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && empty($config['event_store']);
+            return false === $config['enabled'] && empty($config['event_store']);
         })->thenInvalid('The option "event_store" must be set.')->end()->children()->scalarNode('event_store')->defaultNull()->end()->end();
     }
 }

291) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Endpoint/AuthorizationEndpointPreConfiguredAuthorizationSource.php:52    [M] Identical

--- Original
+++ New
@@ @@
         $node->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && empty($config['event_store']);
+            return true !== $config['enabled'] && empty($config['event_store']);
         })->thenInvalid('The option "event_store" must be set.')->end()->children()->scalarNode('event_store')->defaultNull()->end()->end();
     }
 }
