292) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Endpoint/AuthorizationEndpointPreConfiguredAuthorizationSource.php:52    [M] LogicalAnd

--- Original
+++ New
@@ @@
         $node->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && empty($config['event_store']);
+            return true === $config['enabled'] || empty($config['event_store']);
         })->thenInvalid('The option "event_store" must be set.')->end()->children()->scalarNode('event_store')->defaultNull()->end()->end();
     }
 }

294) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Endpoint/AuthorizationEndpointRequestObjectEncryptionSource.php:27    [M] Foreach_

--- Original
+++ New
@@ @@
     {
-        foreach (['required', 'key_encryption_algorithms', 'content_encryption_algorithms'] as $k) {
+        foreach (array() as $k) {
             $container->setParameter($path . '.' . $k, $config[$k]);
         }
         //$container->setAlias($path.'.key_set', 'jose.key_set.authorization_request_object.key_set.encryption');
     }
     /**
      * {@inheritdoc}

307) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Endpoint/AuthorizationEndpointRequestObjectSource.php:77    [M] TrueValue

--- Original
+++ New
@@ @@
         $sourceConfig = $accessor->getValue($bundleConfig, $currentPath);
-        if (true === $sourceConfig['enabled']) {
+        if (false === $sourceConfig['enabled']) {
             $claim_checkers = ['exp', 'iat', 'nbf'];
             // FIXME
             $header_checkers = ['crit'];
             // FIXME
             ConfigurationHelper::addJWSLoader($container, $this->name(), $sourceConfig['signature_algorithms'], [], ['jws_compact'], false);
             ConfigurationHelper::addClaimChecker($container, $this->name(), $claim_checkers, false);

308) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Endpoint/AuthorizationEndpointRequestObjectSource.php:77    [M] Identical

--- Original
+++ New
@@ @@
         $sourceConfig = $accessor->getValue($bundleConfig, $currentPath);
-        if (true === $sourceConfig['enabled']) {
+        if (true !== $sourceConfig['enabled']) {
             $claim_checkers = ['exp', 'iat', 'nbf'];
             // FIXME
             $header_checkers = ['crit'];
             // FIXME
             ConfigurationHelper::addJWSLoader($container, $this->name(), $sourceConfig['signature_algorithms'], [], ['jws_compact'], false);
             ConfigurationHelper::addClaimChecker($container, $this->name(), $claim_checkers, false);

309) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Endpoint/AuthorizationEndpointRequestObjectSource.php:80    [M] FalseValue

--- Original
+++ New
@@ @@
             // FIXME
-            ConfigurationHelper::addJWSLoader($container, $this->name(), $sourceConfig['signature_algorithms'], [], ['jws_compact'], false);
+            ConfigurationHelper::addJWSLoader($container, $this->name(), $sourceConfig['signature_algorithms'], [], ['jws_compact'], true);
             ConfigurationHelper::addClaimChecker($container, $this->name(), $claim_checkers, false);
             if (true === $sourceConfig['encryption']['enabled']) {
                 ConfigurationHelper::addJWELoader($container, $this->name(), $sourceConfig['encryption']['key_encryption_algorithms'], $sourceConfig['encryption']['content_encryption_algorithms'], ['DEF'], [], ['jwe_compact'], false);
             }
         }
     }

310) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Endpoint/AuthorizationEndpointRequestObjectSource.php:81    [M] FalseValue

--- Original
+++ New
@@ @@
             ConfigurationHelper::addJWSLoader($container, $this->name(), $sourceConfig['signature_algorithms'], [], ['jws_compact'], false);
-            ConfigurationHelper::addClaimChecker($container, $this->name(), $claim_checkers, false);
+            ConfigurationHelper::addClaimChecker($container, $this->name(), $claim_checkers, true);
             if (true === $sourceConfig['encryption']['enabled']) {
                 ConfigurationHelper::addJWELoader($container, $this->name(), $sourceConfig['encryption']['key_encryption_algorithms'], $sourceConfig['encryption']['content_encryption_algorithms'], ['DEF'], [], ['jwe_compact'], false);
             }
         }
     }
 }

311) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Endpoint/AuthorizationEndpointRequestObjectSource.php:82    [M] TrueValue

--- Original
+++ New
@@ @@
             ConfigurationHelper::addClaimChecker($container, $this->name(), $claim_checkers, false);
-            if (true === $sourceConfig['encryption']['enabled']) {
+            if (false === $sourceConfig['encryption']['enabled']) {
                 ConfigurationHelper::addJWELoader($container, $this->name(), $sourceConfig['encryption']['key_encryption_algorithms'], $sourceConfig['encryption']['content_encryption_algorithms'], ['DEF'], [], ['jwe_compact'], false);
             }
         }
     }
 }

312) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Endpoint/AuthorizationEndpointRequestObjectSource.php:82    [M] Identical

--- Original
+++ New
@@ @@
             ConfigurationHelper::addClaimChecker($container, $this->name(), $claim_checkers, false);
-            if (true === $sourceConfig['encryption']['enabled']) {
+            if (true !== $sourceConfig['encryption']['enabled']) {
                 ConfigurationHelper::addJWELoader($container, $this->name(), $sourceConfig['encryption']['key_encryption_algorithms'], $sourceConfig['encryption']['content_encryption_algorithms'], ['DEF'], [], ['jwe_compact'], false);
             }
         }
     }
 }

313) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Endpoint/AuthorizationEndpointRequestObjectSource.php:83    [M] FalseValue

--- Original
+++ New
@@ @@
             if (true === $sourceConfig['encryption']['enabled']) {
-                ConfigurationHelper::addJWELoader($container, $this->name(), $sourceConfig['encryption']['key_encryption_algorithms'], $sourceConfig['encryption']['content_encryption_algorithms'], ['DEF'], [], ['jwe_compact'], false);
+                ConfigurationHelper::addJWELoader($container, $this->name(), $sourceConfig['encryption']['key_encryption_algorithms'], $sourceConfig['encryption']['content_encryption_algorithms'], ['DEF'], [], ['jwe_compact'], true);
             }
         }
     }
 }

326) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Endpoint/ClientConfigurationSource.php:54    [M] TrueValue

--- Original
+++ New
@@ @@
         $node->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && empty($config['realm']);
+            return false === $config['enabled'] && empty($config['realm']);
     }
 }

327) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Endpoint/ClientConfigurationSource.php:54    [M] Identical

--- Original
+++ New
@@ @@
         $node->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && empty($config['realm']);
+            return true !== $config['enabled'] && empty($config['realm']);
     }
 }

328) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Endpoint/ClientConfigurationSource.php:54    [M] LogicalAnd

--- Original
+++ New
@@ @@
         $node->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && empty($config['realm']);
+            return true === $config['enabled'] || empty($config['realm']);
     }
 }

330) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Endpoint/ClientRegistrationInitialAccessTokenSource.php:29    [M] Foreach_

--- Original
+++ New
@@ @@
     {
-        foreach (['required', 'realm', 'authorization_header', 'query_string', 'request_body', 'min_length', 'max_length'] as $k) {
+        foreach (array() as $k) {
             $container->setParameter($path . '.' . $k, $config[$k]);
         }
         $container->setAlias($path . '.event_store', $config['event_store']);
         $loader = new PhpConfigFileLoader($container, new FileLocator(__DIR__ . '/../../../Resources/config/endpoint'));
         $loader->load('client_registration_initial_access_token.php');
     }

336) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Endpoint/ClientRegistrationInitialAccessTokenSource.php:61    [M] TrueValue

--- Original
+++ New
@@ @@
         })->thenInvalid('The option "realm" must be set.')->end()->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && empty($config['event_store']);
+            return false === $config['enabled'] && empty($config['event_store']);
         })->thenInvalid('The option "event_store" must be set.')->end()->validate()->ifTrue(function ($config) {
             return true === $config['enabled'] && $config['max_length'] < $config['min_length'];
     }
 }

337) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Endpoint/ClientRegistrationInitialAccessTokenSource.php:61    [M] Identical

--- Original
+++ New
@@ @@
         })->thenInvalid('The option "realm" must be set.')->end()->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && empty($config['event_store']);
+            return true !== $config['enabled'] && empty($config['event_store']);
         })->thenInvalid('The option "event_store" must be set.')->end()->validate()->ifTrue(function ($config) {
             return true === $config['enabled'] && $config['max_length'] < $config['min_length'];
     }
 }

338) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Endpoint/ClientRegistrationInitialAccessTokenSource.php:61    [M] LogicalAnd

--- Original
+++ New
@@ @@
         })->thenInvalid('The option "realm" must be set.')->end()->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && empty($config['event_store']);
+            return true === $config['enabled'] || empty($config['event_store']);
         })->thenInvalid('The option "event_store" must be set.')->end()->validate()->ifTrue(function ($config) {
             return true === $config['enabled'] && $config['max_length'] < $config['min_length'];
     }
 }

339) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Endpoint/ClientRegistrationInitialAccessTokenSource.php:67    [M] TrueValue

--- Original
+++ New
@@ @@
         })->thenInvalid('The option "event_store" must be set.')->end()->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && $config['max_length'] < $config['min_length'];
+            return false === $config['enabled'] && $config['max_length'] < $config['min_length'];
     }
 }

340) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Endpoint/ClientRegistrationInitialAccessTokenSource.php:67    [M] Identical

--- Original
+++ New
@@ @@
         })->thenInvalid('The option "event_store" must be set.')->end()->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && $config['max_length'] < $config['min_length'];
+            return true !== $config['enabled'] && $config['max_length'] < $config['min_length'];
     }
 }

341) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Endpoint/ClientRegistrationInitialAccessTokenSource.php:67    [M] LessThan

--- Original
+++ New
@@ @@
         })->thenInvalid('The option "event_store" must be set.')->end()->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && $config['max_length'] < $config['min_length'];
+            return true === $config['enabled'] && $config['max_length'] <= $config['min_length'];
     }
 }

342) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Endpoint/ClientRegistrationInitialAccessTokenSource.php:67    [M] LessThanNegotiation

--- Original
+++ New
@@ @@
         })->thenInvalid('The option "event_store" must be set.')->end()->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && $config['max_length'] < $config['min_length'];
+            return true === $config['enabled'] && $config['max_length'] >= $config['min_length'];
     }
 }

343) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Endpoint/ClientRegistrationInitialAccessTokenSource.php:67    [M] LogicalAnd

--- Original
+++ New
@@ @@
         })->thenInvalid('The option "event_store" must be set.')->end()->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && $config['max_length'] < $config['min_length'];
+            return true === $config['enabled'] || $config['max_length'] < $config['min_length'];
     }
 }

347) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Endpoint/ClientRegistrationSoftwareStatementSource.php:31    [M] Foreach_

--- Original
+++ New
@@ @@
     {
-        foreach (['required', 'allowed_signature_algorithms'] as $k) {
+        foreach (array() as $k) {
             $container->setParameter($path . '.' . $k, $config[$k]);
         }
         $container->setAlias($path . '.key_set', 'jose.key_set.client_registration_software_statement.key_set.signature');
         $loader = new PhpConfigFileLoader($container, new FileLocator(__DIR__ . '/../../../Resources/config/endpoint'));
         $loader->load('client_registration_software_statement.php');
     }

350) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Endpoint/ClientRegistrationSoftwareStatementSource.php:57    [M] TrueValue

--- Original
+++ New
@@ @@
         $node->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && empty($config['key_set']);
+            return false === $config['enabled'] && empty($config['key_set']);
         })->thenInvalid('The option "key_set" must be set.')->end()->validate()->ifTrue(function ($config) {
             return true === $config['enabled'] && empty($config['allowed_signature_algorithms']);
     }
     /**
      * {@inheritdoc}

351) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Endpoint/ClientRegistrationSoftwareStatementSource.php:57    [M] Identical

--- Original
+++ New
@@ @@
         $node->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && empty($config['key_set']);
+            return true !== $config['enabled'] && empty($config['key_set']);
         })->thenInvalid('The option "key_set" must be set.')->end()->validate()->ifTrue(function ($config) {
             return true === $config['enabled'] && empty($config['allowed_signature_algorithms']);
     }
     /**
      * {@inheritdoc}

352) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Endpoint/ClientRegistrationSoftwareStatementSource.php:57    [M] LogicalAnd

--- Original
+++ New
@@ @@
         $node->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && empty($config['key_set']);
+            return true === $config['enabled'] || empty($config['key_set']);
         })->thenInvalid('The option "key_set" must be set.')->end()->validate()->ifTrue(function ($config) {
             return true === $config['enabled'] && empty($config['allowed_signature_algorithms']);
     }
     /**
      * {@inheritdoc}

353) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Endpoint/ClientRegistrationSoftwareStatementSource.php:63    [M] TrueValue

--- Original
+++ New
@@ @@
         })->thenInvalid('The option "key_set" must be set.')->end()->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && empty($config['allowed_signature_algorithms']);
+            return false === $config['enabled'] && empty($config['allowed_signature_algorithms']);
     }
     /**
      * {@inheritdoc}
      */
     public function prepend(array $bundleConfig, string $path, ContainerBuilder $container)

354) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Endpoint/ClientRegistrationSoftwareStatementSource.php:63    [M] Identical

--- Original
+++ New
@@ @@
         })->thenInvalid('The option "key_set" must be set.')->end()->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && empty($config['allowed_signature_algorithms']);
+            return true !== $config['enabled'] && empty($config['allowed_signature_algorithms']);
     }
     /**
      * {@inheritdoc}
      */
     public function prepend(array $bundleConfig, string $path, ContainerBuilder $container)

355) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Endpoint/ClientRegistrationSoftwareStatementSource.php:63    [M] LogicalAnd

--- Original
+++ New
@@ @@
         })->thenInvalid('The option "key_set" must be set.')->end()->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && empty($config['allowed_signature_algorithms']);
+            return true === $config['enabled'] || empty($config['allowed_signature_algorithms']);
     }
     /**
      * {@inheritdoc}
      */
     public function prepend(array $bundleConfig, string $path, ContainerBuilder $container)

359) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Endpoint/ClientRegistrationSoftwareStatementSource.php:91    [M] FalseValue

--- Original
+++ New
@@ @@
             // FIXME
-            ConfigurationHelper::addJWSLoader($container, $this->name(), $sourceConfig['allowed_signature_algorithms'], [], ['jws_compact'], false);
+            ConfigurationHelper::addJWSLoader($container, $this->name(), $sourceConfig['allowed_signature_algorithms'], [], ['jws_compact'], true);
             ConfigurationHelper::addKeyset($container, 'client_registration_software_statement.key_set.signature', 'jwkset', ['value' => $sourceConfig['key_set']]);
         }
     }
 }

371) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Endpoint/JwksUriEndpointSource.php:49    [M] TrueValue

--- Original
+++ New
@@ @@
         $node->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && (empty($config['path']) || empty($config['key_set']));
+            return false === $config['enabled'] && (empty($config['path']) || empty($config['key_set']));
     }
     public function prepend(array $bundleConfig, string $path, ContainerBuilder $container)
     {
         parent::prepend($bundleConfig, $path, $container);
         $currentPath = $path . '[' . $this->name() . ']';

372) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Endpoint/JwksUriEndpointSource.php:49    [M] Identical

--- Original
+++ New
@@ @@
         $node->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && (empty($config['path']) || empty($config['key_set']));
+            return true !== $config['enabled'] && (empty($config['path']) || empty($config['key_set']));
     }
     public function prepend(array $bundleConfig, string $path, ContainerBuilder $container)
     {
         parent::prepend($bundleConfig, $path, $container);
         $currentPath = $path . '[' . $this->name() . ']';

373) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Endpoint/JwksUriEndpointSource.php:49    [M] LogicalOr

--- Original
+++ New
@@ @@
         $node->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && (empty($config['path']) || empty($config['key_set']));
+            return true === $config['enabled'] && (empty($config['path']) && empty($config['key_set']));
     }
     public function prepend(array $bundleConfig, string $path, ContainerBuilder $container)
     {
         parent::prepend($bundleConfig, $path, $container);
         $currentPath = $path . '[' . $this->name() . ']';

374) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Endpoint/JwksUriEndpointSource.php:49    [M] LogicalAnd

--- Original
+++ New
@@ @@
         $node->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && (empty($config['path']) || empty($config['key_set']));
+            return true === $config['enabled'] || (empty($config['path']) || empty($config['key_set']));
     }
     public function prepend(array $bundleConfig, string $path, ContainerBuilder $container)
     {
         parent::prepend($bundleConfig, $path, $container);
         $currentPath = $path . '[' . $this->name() . ']';

378) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Endpoint/JwksUriEndpointSource.php:67    [M] PublicVisibility

--- Original
+++ New
@@ @@
     }
-    public function prepend(array $bundleConfig, string $path, ContainerBuilder $container)
+    protected function prepend(array $bundleConfig, string $path, ContainerBuilder $container)
     {
         parent::prepend($bundleConfig, $path, $container);
         $currentPath = $path . '[' . $this->name() . ']';
         $accessor = PropertyAccess::createPropertyAccessor();
         $sourceConfig = $accessor->getValue($bundleConfig, $currentPath);
         if (true === $sourceConfig['enabled']) {

379) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Endpoint/MetadataEndpointSource.php:37    [M] Foreach_

--- Original
+++ New
@@ @@
     {
-        foreach (['path', 'custom_values', 'custom_routes'] as $key) {
+        foreach (array() as $key) {
             $container->setParameter($path . '.' . $key, $config[$key]);
         }
         $loader = new PhpConfigFileLoader($container, new FileLocator(__DIR__ . '/../../../Resources/config/endpoint'));
         $loader->load('metadata.php');
     }
     /**

382) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Endpoint/MetadataEndpointSource.php:61    [M] TrueValue

--- Original
+++ New
@@ @@
         $node->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && empty($config['path']);
+            return false === $config['enabled'] && empty($config['path']);
     }
 }

383) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Endpoint/MetadataEndpointSource.php:61    [M] Identical

--- Original
+++ New
@@ @@
         $node->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && empty($config['path']);
+            return true !== $config['enabled'] && empty($config['path']);
     }
 }

384) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Endpoint/MetadataEndpointSource.php:61    [M] LogicalAnd

--- Original
+++ New
@@ @@
         $node->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && empty($config['path']);
+            return true === $config['enabled'] || empty($config['path']);
     }
 }

386) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Endpoint/SessionManagementEndpointSource.php:29    [M] Foreach_

--- Original
+++ New
@@ @@
     {
-        foreach (['path', 'storage_name', 'template'] as $key) {
+        foreach (array() as $key) {
             $container->setParameter($path . '.' . $key, $config[$key]);
         }
         $loader = new PhpConfigFileLoader($container, new FileLocator(__DIR__ . '/../../../Resources/config/endpoint'));
         $loader->load('session_management.php');
     }
     /**

392) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Endpoint/SessionManagementEndpointSource.php:59    [M] TrueValue

--- Original
+++ New
@@ @@
         })->thenInvalid('The route name must be set.')->end()->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && empty($config['storage_name']);
+            return false === $config['enabled'] && empty($config['storage_name']);
         })->thenInvalid('The option "storage_name" must be set.')->end()->validate()->ifTrue(function ($config) {
             return true === $config['enabled'] && empty($config['template']);
     }
 }

393) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Endpoint/SessionManagementEndpointSource.php:59    [M] Identical

--- Original
+++ New
@@ @@
         })->thenInvalid('The route name must be set.')->end()->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && empty($config['storage_name']);
+            return true !== $config['enabled'] && empty($config['storage_name']);
         })->thenInvalid('The option "storage_name" must be set.')->end()->validate()->ifTrue(function ($config) {
             return true === $config['enabled'] && empty($config['template']);
     }
 }

394) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Endpoint/SessionManagementEndpointSource.php:59    [M] LogicalAnd

--- Original
+++ New
@@ @@
         })->thenInvalid('The route name must be set.')->end()->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && empty($config['storage_name']);
+            return true === $config['enabled'] || empty($config['storage_name']);
         })->thenInvalid('The option "storage_name" must be set.')->end()->validate()->ifTrue(function ($config) {
             return true === $config['enabled'] && empty($config['template']);
     }
 }

395) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Endpoint/SessionManagementEndpointSource.php:64    [M] TrueValue

--- Original
+++ New
@@ @@
         })->thenInvalid('The option "storage_name" must be set.')->end()->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && empty($config['template']);
+            return false === $config['enabled'] && empty($config['template']);
     }
 }

396) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Endpoint/SessionManagementEndpointSource.php:64    [M] Identical

--- Original
+++ New
@@ @@
         })->thenInvalid('The option "storage_name" must be set.')->end()->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && empty($config['template']);
+            return true !== $config['enabled'] && empty($config['template']);
     }
 }

397) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Endpoint/SessionManagementEndpointSource.php:64    [M] LogicalAnd

--- Original
+++ New
@@ @@
         })->thenInvalid('The option "storage_name" must be set.')->end()->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && empty($config['template']);
+            return true === $config['enabled'] || empty($config['template']);
     }
 }

401) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Endpoint/SignedMetadataEndpointSource.php:50    [M] TrueValue

--- Original
+++ New
@@ @@
         $node->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && empty($config['algorithm']);
+            return false === $config['enabled'] && empty($config['algorithm']);
         })->thenInvalid('The parameter "algorithm" must be set.')->end()->children()->scalarNode('algorithm')->info('Signature algorithm used to sign the metadata.')->end()->end();
     }
     public function prepend(array $bundleConfig, string $path, ContainerBuilder $container)
     {
         parent::prepend($bundleConfig, $path, $container);
         $currentPath = $path . '[' . $this->name() . ']';

402) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Endpoint/SignedMetadataEndpointSource.php:50    [M] Identical

--- Original
+++ New
@@ @@
         $node->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && empty($config['algorithm']);
+            return true !== $config['enabled'] && empty($config['algorithm']);
         })->thenInvalid('The parameter "algorithm" must be set.')->end()->children()->scalarNode('algorithm')->info('Signature algorithm used to sign the metadata.')->end()->end();
     }
     public function prepend(array $bundleConfig, string $path, ContainerBuilder $container)
     {
         parent::prepend($bundleConfig, $path, $container);
         $currentPath = $path . '[' . $this->name() . ']';
