403) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Endpoint/SignedMetadataEndpointSource.php:50    [M] LogicalAnd

--- Original
+++ New
@@ @@
         $node->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && empty($config['algorithm']);
+            return true === $config['enabled'] || empty($config['algorithm']);
         })->thenInvalid('The parameter "algorithm" must be set.')->end()->children()->scalarNode('algorithm')->info('Signature algorithm used to sign the metadata.')->end()->end();
     }
     public function prepend(array $bundleConfig, string $path, ContainerBuilder $container)
     {
         parent::prepend($bundleConfig, $path, $container);
         $currentPath = $path . '[' . $this->name() . ']';

405) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Endpoint/SignedMetadataEndpointSource.php:68    [M] FalseValue

--- Original
+++ New
@@ @@
         $sourceConfig = $accessor->getValue($bundleConfig, $currentPath);
-        ConfigurationHelper::addJWSBuilder($container, 'metadata_signature', [$sourceConfig['algorithm']], false);
+        ConfigurationHelper::addJWSBuilder($container, 'metadata_signature', [$sourceConfig['algorithm']], true);
         Assertion::keyExists($bundleConfig['key_set'], 'signature', 'The signature key set must be enabled.');
         //ConfigurationHelper::addKeyset($container, 'signed_metadata_endpoint.key_set.signature', 'jwkset', ['value' => $bundleConfig['key_set']['signature']]);
     }
 }

419) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Grant/AuthorizationCodeSource.php:29    [M] Foreach_

--- Original
+++ New
@@ @@
     {
-        foreach (['min_length', 'max_length', 'lifetime', 'enforce_pkce'] as $k) {
+        foreach (array() as $k) {
             $container->setParameter($path . '.' . $k, $config[$k]);
         }
         $container->setAlias($path . '.event_store', $config['event_store']);
         $loader = new PhpConfigFileLoader($container, new FileLocator(__DIR__ . '/../../../Resources/config/grant'));
         $loader->load('authorization_code.php');
     }

441) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Grant/JwtBearerEncryptionSource.php:28    [M] Foreach_

--- Original
+++ New
@@ @@
     {
-        foreach (['key_encryption_algorithms', 'content_encryption_algorithms', 'required'] as $k) {
+        foreach (array() as $k) {
             $container->setParameter($path . '.' . $k, $config[$k]);
         }
         //$container->setAlias($path.'.key_set', 'jose.key_set.jwt_bearer.key_set.encryption');
     }
     /**
      * {@inheritdoc}

444) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Grant/JwtBearerEncryptionSource.php:42    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
     }
-    protected function continueConfiguration(NodeDefinition $node)
+    private function continueConfiguration(NodeDefinition $node)
     {
         parent::continueConfiguration($node);
     }
     /**
      * {@inheritdoc}

449) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Grant/JwtBearerSource.php:61    [M] TrueValue

--- Original
+++ New
@@ @@
         $node->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && empty($config['signature_algorithms']);
+            return false === $config['enabled'] && empty($config['signature_algorithms']);
     }
     /**
      * {@inheritdoc}
      */
     public function prepend(array $bundleConfig, string $path, ContainerBuilder $container)

450) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Grant/JwtBearerSource.php:61    [M] Identical

--- Original
+++ New
@@ @@
         $node->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && empty($config['signature_algorithms']);
+            return true !== $config['enabled'] && empty($config['signature_algorithms']);
     }
     /**
      * {@inheritdoc}
      */
     public function prepend(array $bundleConfig, string $path, ContainerBuilder $container)

451) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Grant/JwtBearerSource.php:61    [M] LogicalAnd

--- Original
+++ New
@@ @@
         $node->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && empty($config['signature_algorithms']);
+            return true === $config['enabled'] || empty($config['signature_algorithms']);
     }
     /**
      * {@inheritdoc}
      */
     public function prepend(array $bundleConfig, string $path, ContainerBuilder $container)

456) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Grant/JwtBearerSource.php:112    [M] FalseValue

--- Original
+++ New
@@ @@
     {
-        ConfigurationHelper::addJWSLoader($container, $this->name(), $sourceConfig['signature_algorithms'], [], ['jws_compact'], false);
+        ConfigurationHelper::addJWSLoader($container, $this->name(), $sourceConfig['signature_algorithms'], [], ['jws_compact'], true);
         ConfigurationHelper::addClaimChecker($container, $this->name(), [], false);
     }
     /**
      * @param ContainerBuilder $container
      * @param array            $sourceConfig
      */

457) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Grant/JwtBearerSource.php:113    [M] FalseValue

--- Original
+++ New
@@ @@
         ConfigurationHelper::addJWSLoader($container, $this->name(), $sourceConfig['signature_algorithms'], [], ['jws_compact'], false);
-        ConfigurationHelper::addClaimChecker($container, $this->name(), [], false);
+        ConfigurationHelper::addClaimChecker($container, $this->name(), [], true);
     }
     /**
      * @param ContainerBuilder $container
      * @param array            $sourceConfig
      */
     private function updateJoseBundleConfigurationForDecrypter(ContainerBuilder $container, array $sourceConfig)

458) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Grant/JwtBearerSource.php:122    [M] TrueValue

--- Original
+++ New
@@ @@
     {
-        if (true === $sourceConfig['encryption']['enabled']) {
+        if (false === $sourceConfig['encryption']['enabled']) {
             ConfigurationHelper::addJWELoader($container, $this->name(), $sourceConfig['encryption']['key_encryption_algorithms'], $sourceConfig['encryption']['content_encryption_algorithms'], ['DEF'], [], ['jwe_compact'], false);
         }
     }
 }

459) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Grant/JwtBearerSource.php:122    [M] Identical

--- Original
+++ New
@@ @@
     {
-        if (true === $sourceConfig['encryption']['enabled']) {
+        if (true !== $sourceConfig['encryption']['enabled']) {
             ConfigurationHelper::addJWELoader($container, $this->name(), $sourceConfig['encryption']['key_encryption_algorithms'], $sourceConfig['encryption']['content_encryption_algorithms'], ['DEF'], [], ['jwe_compact'], false);
         }
     }
 }

463) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Grant/NoneSource.php:50    [M] TrueValue

--- Original
+++ New
@@ @@
         $node->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'];
+            return false === $config['enabled'];
         })->thenInvalid('The grant type "none" is not fully implemented. Please disable it.')->end();
     }
 }

464) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Grant/NoneSource.php:50    [M] Identical

--- Original
+++ New
@@ @@
         $node->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'];
+            return true !== $config['enabled'];
         })->thenInvalid('The grant type "none" is not fully implemented. Please disable it.')->end();
     }
 }

466) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Grant/RefreshTokenSource.php:29    [M] Foreach_

--- Original
+++ New
@@ @@
     {
-        foreach (['min_length', 'max_length', 'lifetime'] as $k) {
+        foreach (array() as $k) {
             $container->setParameter($path . '.' . $k, $config[$k]);
         }
         $container->setAlias($path . '.event_store', $config['event_store']);
         $loader = new PhpConfigFileLoader($container, new FileLocator(__DIR__ . '/../../../Resources/config/grant'));
         $loader->load('refresh_token.php');
     }

494) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/KeySet.php:48    [M] NotIdentical

--- Original
+++ New
@@ @@
         parent::prepend($bundleConfig, $path, $container);
-        if (null !== $bundleConfig['key_set']['signature']) {
+        if (null === $bundleConfig['key_set']['signature']) {
             ConfigurationHelper::addKeyset($container, 'oauth2_server.key_set.signature', 'jwkset', ['value' => $bundleConfig['key_set']['signature']]);
         }
         if (null !== $bundleConfig['key_set']['encryption']) {
             ConfigurationHelper::addKeyset($container, 'oauth2_server.key_set.encryption', 'jwkset', ['value' => $bundleConfig['key_set']['encryption']]);
         }
     }

495) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/KeySet.php:51    [M] NotIdentical

--- Original
+++ New
@@ @@
         }
-        if (null !== $bundleConfig['key_set']['encryption']) {
+        if (null === $bundleConfig['key_set']['encryption']) {
             ConfigurationHelper::addKeyset($container, 'oauth2_server.key_set.encryption', 'jwkset', ['value' => $bundleConfig['key_set']['encryption']]);
         }
     }
 }

499) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/OpenIdConnect/IdTokenEncryptionSource.php:29    [M] Foreach_

--- Original
+++ New
@@ @@
     {
-        foreach (['key_encryption_algorithms', 'content_encryption_algorithms'] as $k) {
+        foreach (array() as $k) {
             $container->setParameter($path . '.' . $k, $config[$k]);
         }
         //$container->setAlias($path.'.key_set', 'jose.key_set.id_token.key_set.encryption');
     }
     /**
      * {@inheritdoc}

503) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/OpenIdConnect/IdTokenEncryptionSource.php:46    [M] FalseValue

--- Original
+++ New
@@ @@
         if (true === $sourceConfig['enabled']) {
-            ConfigurationHelper::addJWEBuilder($container, 'id_token', $sourceConfig['key_encryption_algorithms'], $sourceConfig['content_encryption_algorithms'], ['DEF'], false);
+            ConfigurationHelper::addJWEBuilder($container, 'id_token', $sourceConfig['key_encryption_algorithms'], $sourceConfig['content_encryption_algorithms'], ['DEF'], true);
             ConfigurationHelper::addJWELoader($container, 'id_token', $sourceConfig['key_encryption_algorithms'], $sourceConfig['content_encryption_algorithms'], ['DEF'], [], ['jwe_compact'], false);
             Assertion::keyExists($bundleConfig['key_set'], 'encryption', 'The encryption key set must be enabled.');
             //ConfigurationHelper::addKeyset($container, 'id_token.key_set.encryption', 'jwkset', ['value' => $bundleConfig['key_set']['encryption']]);
         }
     }
     /**

504) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/OpenIdConnect/IdTokenEncryptionSource.php:47    [M] FalseValue

--- Original
+++ New
@@ @@
             ConfigurationHelper::addJWEBuilder($container, 'id_token', $sourceConfig['key_encryption_algorithms'], $sourceConfig['content_encryption_algorithms'], ['DEF'], false);
-            ConfigurationHelper::addJWELoader($container, 'id_token', $sourceConfig['key_encryption_algorithms'], $sourceConfig['content_encryption_algorithms'], ['DEF'], [], ['jwe_compact'], false);
+            ConfigurationHelper::addJWELoader($container, 'id_token', $sourceConfig['key_encryption_algorithms'], $sourceConfig['content_encryption_algorithms'], ['DEF'], [], ['jwe_compact'], true);
             Assertion::keyExists($bundleConfig['key_set'], 'encryption', 'The encryption key set must be enabled.');
             //ConfigurationHelper::addKeyset($container, 'id_token.key_set.encryption', 'jwkset', ['value' => $bundleConfig['key_set']['encryption']]);
         }
     }
     /**
      * {@inheritdoc}

510) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/OpenIdConnect/IdTokenSource.php:44    [M] FalseValue

--- Original
+++ New
@@ @@
         $sourceConfig = $accessor->getValue($bundleConfig, $currentPath);
-        ConfigurationHelper::addJWSBuilder($container, $this->name(), $sourceConfig['signature_algorithms'], false);
+        ConfigurationHelper::addJWSBuilder($container, $this->name(), $sourceConfig['signature_algorithms'], true);
         ConfigurationHelper::addJWSLoader($container, $this->name(), $sourceConfig['signature_algorithms'], [], ['jws_compact'], false);
         Assertion::keyExists($bundleConfig['key_set'], 'signature', 'The signature key set must be enabled.');
         //ConfigurationHelper::addKeyset($container, 'id_token.key_set.signature', 'jwkset', ['value' => $bundleConfig['key_set']['signature']]);
     }
     /**
      * {@inheritdoc}

511) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/OpenIdConnect/IdTokenSource.php:45    [M] FalseValue

--- Original
+++ New
@@ @@
         ConfigurationHelper::addJWSBuilder($container, $this->name(), $sourceConfig['signature_algorithms'], false);
-        ConfigurationHelper::addJWSLoader($container, $this->name(), $sourceConfig['signature_algorithms'], [], ['jws_compact'], false);
+        ConfigurationHelper::addJWSLoader($container, $this->name(), $sourceConfig['signature_algorithms'], [], ['jws_compact'], true);
         Assertion::keyExists($bundleConfig['key_set'], 'signature', 'The signature key set must be enabled.');
         //ConfigurationHelper::addKeyset($container, 'id_token.key_set.signature', 'jwkset', ['value' => $bundleConfig['key_set']['signature']]);
     }
     /**
      * {@inheritdoc}
      */

513) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/OpenIdConnect/IdTokenSource.php:56    [M] Foreach_

--- Original
+++ New
@@ @@
     {
-        foreach (['lifetime', 'default_signature_algorithm', 'signature_algorithms', 'claim_checkers', 'header_checkers'] as $k) {
+        foreach (array() as $k) {
             $container->setParameter($path . '.' . $k, $config[$k]);
         }
         //$container->setAlias($path.'.key_set', 'jose.key_set.id_token.key_set.signature');
         $loader = new PhpConfigFileLoader($container, new FileLocator(__DIR__ . '/../../../Resources/config/openid_connect'));
         $loader->load('userinfo_scope_support.php');
     }

516) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/OpenIdConnect/IdTokenSource.php:91    [M] LogicalNot

--- Original
+++ New
@@ @@
         })->thenInvalid('The option "signature_algorithm" must contain at least one signature algorithm.')->end()->validate()->ifTrue(function ($config) {
-            return !in_array($config['default_signature_algorithm'], $config['signature_algorithms']);
+            return in_array($config['default_signature_algorithm'], $config['signature_algorithms']);
     }
 }

523) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/OpenIdConnect/PairwiseSubjectSource.php:48    [M] TrueValue

--- Original
+++ New
@@ @@
         $node->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && empty($config['service']);
+            return false === $config['enabled'] && empty($config['service']);
         })->thenInvalid('The pairwise subject service must be set.')->end()->children()->scalarNode('service')->end()->booleanNode('is_default')->defaultTrue()->end()->end();
     }
 }

524) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/OpenIdConnect/PairwiseSubjectSource.php:48    [M] Identical

--- Original
+++ New
@@ @@
         $node->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && empty($config['service']);
+            return true !== $config['enabled'] && empty($config['service']);
         })->thenInvalid('The pairwise subject service must be set.')->end()->children()->scalarNode('service')->end()->booleanNode('is_default')->defaultTrue()->end()->end();
     }
 }

525) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/OpenIdConnect/PairwiseSubjectSource.php:48    [M] LogicalAnd

--- Original
+++ New
@@ @@
         $node->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && empty($config['service']);
+            return true === $config['enabled'] || empty($config['service']);
         })->thenInvalid('The pairwise subject service must be set.')->end()->children()->scalarNode('service')->end()->booleanNode('is_default')->defaultTrue()->end()->end();
     }
 }

529) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/OpenIdConnect/UserinfoEndpointEncryptionSource.php:50    [M] TrueValue

--- Original
+++ New
@@ @@
         $node->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && empty($config['key_encryption_algorithms']);
+            return false === $config['enabled'] && empty($config['key_encryption_algorithms']);
         })->thenInvalid('You must set at least one key encryption algorithm.')->end()->validate()->ifTrue(function ($config) {
             return true === $config['enabled'] && empty($config['content_encryption_algorithms']);
     }
     /**
      * {@inheritdoc}

530) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/OpenIdConnect/UserinfoEndpointEncryptionSource.php:50    [M] Identical

--- Original
+++ New
@@ @@
         $node->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && empty($config['key_encryption_algorithms']);
+            return true !== $config['enabled'] && empty($config['key_encryption_algorithms']);
         })->thenInvalid('You must set at least one key encryption algorithm.')->end()->validate()->ifTrue(function ($config) {
             return true === $config['enabled'] && empty($config['content_encryption_algorithms']);
     }
     /**
      * {@inheritdoc}

531) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/OpenIdConnect/UserinfoEndpointEncryptionSource.php:50    [M] LogicalAnd

--- Original
+++ New
@@ @@
         $node->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && empty($config['key_encryption_algorithms']);
+            return true === $config['enabled'] || empty($config['key_encryption_algorithms']);
         })->thenInvalid('You must set at least one key encryption algorithm.')->end()->validate()->ifTrue(function ($config) {
             return true === $config['enabled'] && empty($config['content_encryption_algorithms']);
     }
     /**
      * {@inheritdoc}

532) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/OpenIdConnect/UserinfoEndpointEncryptionSource.php:56    [M] TrueValue

--- Original
+++ New
@@ @@
         })->thenInvalid('You must set at least one key encryption algorithm.')->end()->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && empty($config['content_encryption_algorithms']);
+            return false === $config['enabled'] && empty($config['content_encryption_algorithms']);
     }
     /**
      * {@inheritdoc}
      */
     public function prepend(array $bundleConfig, string $path, ContainerBuilder $container)

533) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/OpenIdConnect/UserinfoEndpointEncryptionSource.php:56    [M] Identical

--- Original
+++ New
@@ @@
         })->thenInvalid('You must set at least one key encryption algorithm.')->end()->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && empty($config['content_encryption_algorithms']);
+            return true !== $config['enabled'] && empty($config['content_encryption_algorithms']);
     }
     /**
      * {@inheritdoc}
      */
     public function prepend(array $bundleConfig, string $path, ContainerBuilder $container)

534) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/OpenIdConnect/UserinfoEndpointEncryptionSource.php:56    [M] LogicalAnd

--- Original
+++ New
@@ @@
         })->thenInvalid('You must set at least one key encryption algorithm.')->end()->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && empty($config['content_encryption_algorithms']);
+            return true === $config['enabled'] || empty($config['content_encryption_algorithms']);
     }
     /**
      * {@inheritdoc}
      */
     public function prepend(array $bundleConfig, string $path, ContainerBuilder $container)

536) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/OpenIdConnect/UserinfoEndpointEncryptionSource.php:86    [M] FalseValue

--- Original
+++ New
@@ @@
         $sourceConfig = $accessor->getValue($bundleConfig, $currentPath);
-        ConfigurationHelper::addJWEBuilder($container, 'oauth2_server.userinfo', $sourceConfig['key_encryption_algorithms'], $sourceConfig['content_encryption_algorithms'], ['DEF'], false);
+        ConfigurationHelper::addJWEBuilder($container, 'oauth2_server.userinfo', $sourceConfig['key_encryption_algorithms'], $sourceConfig['content_encryption_algorithms'], ['DEF'], true);
     }
 }

544) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/OpenIdConnect/UserinfoEndpointSignatureSource.php:74    [M] FalseValue

--- Original
+++ New
@@ @@
         $sourceConfig = $accessor->getValue($bundleConfig, $currentPath);
-        ConfigurationHelper::addJWSBuilder($container, 'oauth2_server.userinfo', $sourceConfig['signature_algorithms'], false);
+        ConfigurationHelper::addJWSBuilder($container, 'oauth2_server.userinfo', $sourceConfig['signature_algorithms'], true);
     }
 }

552) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/ResourceServerRepositorySource.php:48    [M] TrueValue

--- Original
+++ New
@@ @@
         $node->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && empty($config['repository']);
+            return false === $config['enabled'] && empty($config['repository']);
         })->thenInvalid('The option "repository" must be set.')->end()->children()->scalarNode('repository')->info('The resource server repository.')->isRequired()->end()->end();
     }
 }

553) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/ResourceServerRepositorySource.php:48    [M] Identical

--- Original
+++ New
@@ @@
         $node->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && empty($config['repository']);
+            return true !== $config['enabled'] && empty($config['repository']);
         })->thenInvalid('The option "repository" must be set.')->end()->children()->scalarNode('repository')->info('The resource server repository.')->isRequired()->end()->end();
     }
 }

554) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/ResourceServerRepositorySource.php:48    [M] LogicalAnd

--- Original
+++ New
@@ @@
         $node->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && empty($config['repository']);
+            return true === $config['enabled'] || empty($config['repository']);
         })->thenInvalid('The option "repository" must be set.')->end()->children()->scalarNode('repository')->info('The resource server repository.')->isRequired()->end()->end();
     }
 }

557) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Scope/ScopePolicyDefaultSource.php:37    [M] Foreach_

--- Original
+++ New
@@ @@
     {
-        foreach (['scope'] as $k) {
+        foreach (array() as $k) {
             $container->setParameter($path . '.' . $k, $config[$k]);
         }
         $loader = new PhpConfigFileLoader($container, new FileLocator(__DIR__ . '/../../../Resources/config/scope'));
         $loader->load('policy_default.php');
     }
     /**

563) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Scope/ScopePolicySource.php:46    [M] Foreach_

--- Original
+++ New
@@ @@
     {
-        foreach (['by_default'] as $k) {
+        foreach (array() as $k) {
             $container->setParameter($path . '.' . $k, $config[$k]);
         }
         $loader = new PhpConfigFileLoader($container, new FileLocator(__DIR__ . '/../../../Resources/config/scope'));
         $loader->load('policy.php');
     }
     /**

565) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Scope/ScopePolicySource.php:62    [M] TrueValue

--- Original
+++ New
@@ @@
         $node->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && empty($config['by_default']);
+            return false === $config['enabled'] && empty($config['by_default']);
         })->thenInvalid('The option "repository" must be set.')->end()->children()->scalarNode('by_default')->info('Default scope policy.')->defaultValue('none')->end()->end();
     }
 }

566) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Scope/ScopePolicySource.php:62    [M] Identical

--- Original
+++ New
@@ @@
         $node->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && empty($config['by_default']);
+            return true !== $config['enabled'] && empty($config['by_default']);
         })->thenInvalid('The option "repository" must be set.')->end()->children()->scalarNode('by_default')->info('Default scope policy.')->defaultValue('none')->end()->end();
     }
 }

567) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/Scope/ScopePolicySource.php:62    [M] LogicalAnd

--- Original
+++ New
@@ @@
         $node->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && empty($config['by_default']);
+            return true === $config['enabled'] || empty($config['by_default']);
         })->thenInvalid('The option "repository" must be set.')->end()->children()->scalarNode('by_default')->info('Default scope policy.')->defaultValue('none')->end()->end();
     }
 }

584) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/TokenEndpointAuthMethod/ClientAssertionJwtTokenEndpointAuthMethodEncryptionSupportSource.php:56    [M] TrueValue

--- Original
+++ New
@@ @@
         })->thenInvalid('At least one key encryption algorithm must be set.')->end()->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && empty($config['content_encryption_algorithms']);
+            return false === $config['enabled'] && empty($config['content_encryption_algorithms']);
     }
     /**
      * {@inheritdoc}
      */
     public function prepend(array $bundleConfig, string $path, ContainerBuilder $container)

585) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/TokenEndpointAuthMethod/ClientAssertionJwtTokenEndpointAuthMethodEncryptionSupportSource.php:56    [M] Identical

--- Original
+++ New
@@ @@
         })->thenInvalid('At least one key encryption algorithm must be set.')->end()->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && empty($config['content_encryption_algorithms']);
+            return true !== $config['enabled'] && empty($config['content_encryption_algorithms']);
     }
     /**
      * {@inheritdoc}
      */
     public function prepend(array $bundleConfig, string $path, ContainerBuilder $container)

586) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/TokenEndpointAuthMethod/ClientAssertionJwtTokenEndpointAuthMethodEncryptionSupportSource.php:56    [M] LogicalAnd

--- Original
+++ New
@@ @@
         })->thenInvalid('At least one key encryption algorithm must be set.')->end()->validate()->ifTrue(function ($config) {
-            return true === $config['enabled'] && empty($config['content_encryption_algorithms']);
+            return true === $config['enabled'] || empty($config['content_encryption_algorithms']);
     }
     /**
      * {@inheritdoc}
      */
     public function prepend(array $bundleConfig, string $path, ContainerBuilder $container)
