609) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/TokenEndpointAuthMethod/ClientSecretBasicTokenEndpointAuthMethodSource.php:53    [M] Multiplication

--- Original
+++ New
@@ @@
         parent::continueConfiguration($node);
-        $node->children()->scalarNode('realm')->isRequired()->end()->integerNode('secret_lifetime')->defaultValue(60 * 60 * 24 * 14)->min(0)->end()->end();
+        $node->children()->scalarNode('realm')->isRequired()->end()->integerNode('secret_lifetime')->defaultValue(60 / 60 * 24 * 14)->min(0)->end()->end();
     }
 }

610) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/TokenEndpointAuthMethod/ClientSecretBasicTokenEndpointAuthMethodSource.php:53    [M] Multiplication

--- Original
+++ New
@@ @@
         parent::continueConfiguration($node);
-        $node->children()->scalarNode('realm')->isRequired()->end()->integerNode('secret_lifetime')->defaultValue(60 * 60 * 24 * 14)->min(0)->end()->end();
+        $node->children()->scalarNode('realm')->isRequired()->end()->integerNode('secret_lifetime')->defaultValue(60 * 60 / 24 * 14)->min(0)->end()->end();
     }
 }

611) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/TokenEndpointAuthMethod/ClientSecretBasicTokenEndpointAuthMethodSource.php:53    [M] Multiplication

--- Original
+++ New
@@ @@
         parent::continueConfiguration($node);
-        $node->children()->scalarNode('realm')->isRequired()->end()->integerNode('secret_lifetime')->defaultValue(60 * 60 * 24 * 14)->min(0)->end()->end();
+        $node->children()->scalarNode('realm')->isRequired()->end()->integerNode('secret_lifetime')->defaultValue(60 * 60 * 24 / 14)->min(0)->end()->end();
     }
 }

612) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/TokenEndpointAuthMethod/ClientSecretBasicTokenEndpointAuthMethodSource.php:53    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         parent::continueConfiguration($node);
-        $node->children()->scalarNode('realm')->isRequired()->end()->integerNode('secret_lifetime')->defaultValue(60 * 60 * 24 * 14)->min(0)->end()->end();
+        $node->children()->scalarNode('realm')->isRequired()->end()->integerNode('secret_lifetime')->defaultValue(60 * 60 * 24 * 14)->min(1)->end()->end();
     }
 }

616) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/TokenEndpointAuthMethod/ClientSecretPostTokenEndpointAuthMethodSource.php:51    [M] Multiplication

--- Original
+++ New
@@ @@
         parent::continueConfiguration($node);
-        $node->children()->integerNode('secret_lifetime')->defaultValue(60 * 60 * 24 * 14)->min(0)->end()->end();
+        $node->children()->integerNode('secret_lifetime')->defaultValue(60 / 60 * 24 * 14)->min(0)->end()->end();
     }
 }

617) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/TokenEndpointAuthMethod/ClientSecretPostTokenEndpointAuthMethodSource.php:51    [M] Multiplication

--- Original
+++ New
@@ @@
         parent::continueConfiguration($node);
-        $node->children()->integerNode('secret_lifetime')->defaultValue(60 * 60 * 24 * 14)->min(0)->end()->end();
+        $node->children()->integerNode('secret_lifetime')->defaultValue(60 * 60 / 24 * 14)->min(0)->end()->end();
     }
 }

618) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/TokenEndpointAuthMethod/ClientSecretPostTokenEndpointAuthMethodSource.php:51    [M] Multiplication

--- Original
+++ New
@@ @@
         parent::continueConfiguration($node);
-        $node->children()->integerNode('secret_lifetime')->defaultValue(60 * 60 * 24 * 14)->min(0)->end()->end();
+        $node->children()->integerNode('secret_lifetime')->defaultValue(60 * 60 * 24 / 14)->min(0)->end()->end();
     }
 }

619) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/TokenEndpointAuthMethod/ClientSecretPostTokenEndpointAuthMethodSource.php:51    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         parent::continueConfiguration($node);
-        $node->children()->integerNode('secret_lifetime')->defaultValue(60 * 60 * 24 * 14)->min(0)->end()->end();
+        $node->children()->integerNode('secret_lifetime')->defaultValue(60 * 60 * 24 * 14)->min(1)->end()->end();
     }
 }

635) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/TokenType/MacTokenTypeSource.php:54    [M] GreaterThan

--- Original
+++ New
@@ @@
         $node->validate()->ifTrue(function ($config) {
-            return $config['min_length'] > $config['max_length'];
+            return $config['min_length'] >= $config['max_length'];
         })->thenInvalid('The option "min_length" must not be greater than "max_length".')->end()->validate()->ifTrue(function ($config) {
             return !in_array($config['algorithm'], ['hmac-sha-256', 'hmac-sha-1']);
     }
 }

636) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/TokenType/MacTokenTypeSource.php:54    [M] GreaterThanNegotiation

--- Original
+++ New
@@ @@
         $node->validate()->ifTrue(function ($config) {
-            return $config['min_length'] > $config['max_length'];
+            return $config['min_length'] <= $config['max_length'];
         })->thenInvalid('The option "min_length" must not be greater than "max_length".')->end()->validate()->ifTrue(function ($config) {
             return !in_array($config['algorithm'], ['hmac-sha-256', 'hmac-sha-1']);
     }
 }

637) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/TokenType/MacTokenTypeSource.php:60    [M] LogicalNot

--- Original
+++ New
@@ @@
         })->thenInvalid('The option "min_length" must not be greater than "max_length".')->end()->validate()->ifTrue(function ($config) {
-            return !in_array($config['algorithm'], ['hmac-sha-256', 'hmac-sha-1']);
+            return in_array($config['algorithm'], ['hmac-sha-256', 'hmac-sha-1']);
     }
 }

646) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/DependencyInjection/Source/UserAccountSource.php:34    [M] Foreach_

--- Original
+++ New
@@ @@
     {
-        foreach (['repository', 'manager'] as $k) {
+        foreach (array() as $k) {
             $container->setAlias($path . '.' . $k, $config[$k]);
         }
     }
     /**
      * {@inheritdoc}
      */

649) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Form/FormFactory.php:73    [M] Plus

--- Original
+++ New
@@ @@
     {
-        $options = ['validation_groups' => $this->validationGroups, 'translator' => $this->translator] + $options;
+        $options = ['validation_groups' => $this->validationGroups, 'translator' => $this->translator] - $options;
         $form = $this->formFactory->createNamed($this->name, $this->type, null, $options);
         if (null !== $data) {
             $form->setData($data);
         }
         return $form;
     }

650) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Form/FormFactory.php:76    [M] NotIdentical

--- Original
+++ New
@@ @@
         $form = $this->formFactory->createNamed($this->name, $this->type, null, $options);
-        if (null !== $data) {
+        if (null === $data) {
             $form->setData($data);
         }
         return $form;
     }
 }

651) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Form/FormFactory.php:71    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function createForm(array $options = [], $data = null) : FormInterface
+    protected function createForm(array $options = [], $data = null) : FormInterface
     {
         $options = ['validation_groups' => $this->validationGroups, 'translator' => $this->translator] + $options;
         $form = $this->formFactory->createNamed($this->name, $this->type, null, $options);
         if (null !== $data) {
             $form->setData($data);
         }

653) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Form/Handler/AuthorizationFormHandler.php:50    [M] LogicalNot

--- Original
+++ New
@@ @@
         $form->submit($symfonyRequest->get($form->getName()));
-        if (!$form->isValid()) {
+        if ($form->isValid()) {
             return $authorization;
         }
         $button = $form->get('accept');
         if (!$button instanceof ClickableInterface) {
             throw new InvalidArgumentException('Unable to find the button named "accept".');
         }

654) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Form/Handler/AuthorizationFormHandler.php:55    [M] LogicalNot

--- Original
+++ New
@@ @@
         $button = $form->get('accept');
-        if (!$button instanceof ClickableInterface) {
+        if ($button instanceof ClickableInterface) {
             throw new InvalidArgumentException('Unable to find the button named "accept".');
         }
         if (true === $button->isClicked()) {
             $authorization = $authorization->allow();
         } else {
             $authorization = $authorization->deny();

655) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Form/Handler/AuthorizationFormHandler.php:58    [M] TrueValue

--- Original
+++ New
@@ @@
         }
-        if (true === $button->isClicked()) {
+        if (false === $button->isClicked()) {
             $authorization = $authorization->allow();
         } else {
             $authorization = $authorization->deny();
         }
         $refused_scopes = array_diff($authorization->getScopes(), $authorization_model->getScopes());
         foreach ($refused_scopes as $refused_scope) {

656) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Form/Handler/AuthorizationFormHandler.php:58    [M] Identical

--- Original
+++ New
@@ @@
         }
-        if (true === $button->isClicked()) {
+        if (true !== $button->isClicked()) {
             $authorization = $authorization->allow();
         } else {
             $authorization = $authorization->deny();
         }
         $refused_scopes = array_diff($authorization->getScopes(), $authorization_model->getScopes());
         foreach ($refused_scopes as $refused_scope) {

657) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Form/Handler/AuthorizationFormHandler.php:67    [M] Foreach_

--- Original
+++ New
@@ @@
         $refused_scopes = array_diff($authorization->getScopes(), $authorization_model->getScopes());
-        foreach ($refused_scopes as $refused_scope) {
+        foreach (array() as $refused_scope) {
             $authorization = $authorization->withoutScope($refused_scope);
         }
         return $authorization;
     }
 }

658) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Form/Handler/AuthorizationFormHandler.php:37    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function handle(FormInterface $form, ServerRequestInterface $request, Authorization $authorization, AuthorizationModel $authorization_model) : Authorization
+    protected function handle(FormInterface $form, ServerRequestInterface $request, Authorization $authorization, AuthorizationModel $authorization_model) : Authorization
     {
         if ('POST' !== $request->getMethod()) {
             throw new OAuth2Exception(405, []);
         }
         $httpFoundationFactory = new HttpFoundationFactory();
         $symfonyRequest = $httpFoundationFactory->createRequest($request);

659) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Form/Model/AuthorizationModel.php:31    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function isConfigurationSaved()
+    protected function isConfigurationSaved()
     {
         return $this->saveConfiguration;
     }
     /**
      * @param bool $saveConfiguration
      */

660) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Form/Model/AuthorizationModel.php:39    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function setSaveConfiguration(bool $saveConfiguration)
+    protected function setSaveConfiguration(bool $saveConfiguration)
     {
         $this->saveConfiguration = $saveConfiguration;
     }
     /**
      * @return string[]
      */

662) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Form/Model/AuthorizationModel.php:55    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function setScopes(array $scopes)
+    protected function setScopes(array $scopes)
     {
         $this->scopes = $scopes;
     }
 }

663) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Form/Type/AuthorizationType.php:26    [M] PublicVisibility

--- Original
+++ New
@@ @@
 {
-    public function buildForm(FormBuilderInterface $builder, array $options)
+    protected function buildForm(FormBuilderInterface $builder, array $options)
     {
         $translator = $options['translator'];
         /*if (true === $options['allow_scope_selection']) {
               $builder->add('scopes', ChoiceType::class, [
                   'label'             => $translator->trans('authorization.form.scope', [], $options['translation_domain'], $options['locale']),
                   'multiple'          => 'true',

666) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Form/Type/AuthorizationType.php:64    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function configureOptions(OptionsResolver $resolver)
+    protected function configureOptions(OptionsResolver $resolver)
     {
         $resolver->setAllowedTypes('locale', ['string', 'null']);
         $resolver->setAllowedTypes('scopes', 'array');
         $resolver->setAllowedTypes('allow_scope_selection', 'bool');
         $resolver->setAllowedTypes('is_pre_configured_authorization_enabled', 'bool');

667) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Form/Type/AuthorizationType.php:82    [M] PublicVisibility

--- Original
+++ New
@@ @@
     }
-    public function getBlockPrefix()
+    protected function getBlockPrefix()
     {
         return 'oauth2_server_authorization';
     }
 }

668) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Model/AccessTokenByReferenceRepository.php:88    [M] Identical

--- Original
+++ New
@@ @@
         $accessToken = $this->getFromCache($accessTokenId);
-        if (null === $accessToken) {
+        if (null !== $accessToken) {
             $events = $this->eventStore->getEvents($accessTokenId);
             if (!empty($events)) {
                 $accessToken = $this->getFromEvents($events);
                 $this->cacheObject($accessToken);
             }
         }

669) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Model/AccessTokenByReferenceRepository.php:90    [M] LogicalNot

--- Original
+++ New
@@ @@
             $events = $this->eventStore->getEvents($accessTokenId);
-            if (!empty($events)) {
+            if (empty($events)) {
                 $accessToken = $this->getFromEvents($events);
                 $this->cacheObject($accessToken);
             }
         }
         return $accessToken;
     }

670) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Model/AccessTokenByReferenceRepository.php:85    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function find(AccessTokenId $accessTokenId)
+    protected function find(AccessTokenId $accessTokenId)
     {
         $accessToken = $this->getFromCache($accessTokenId);
         if (null === $accessToken) {
             $events = $this->eventStore->getEvents($accessTokenId);
             if (!empty($events)) {
                 $accessToken = $this->getFromEvents($events);

671) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Model/AccessTokenByReferenceRepository.php:105    [M] Foreach_

--- Original
+++ New
@@ @@
         $events = $accessToken->recordedMessages();
-        foreach ($events as $event) {
+        foreach (array() as $event) {
             $this->eventStore->save($event);
             $this->eventBus->handle($event);
         }
         $accessToken->eraseMessages();
         $this->cacheObject($accessToken);
     }

672) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Model/AccessTokenByReferenceRepository.php:102    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function save(AccessToken $accessToken)
+    protected function save(AccessToken $accessToken)
     {
         $events = $accessToken->recordedMessages();
         foreach ($events as $event) {
             $this->eventStore->save($event);
             $this->eventBus->handle($event);
         }

673) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Model/AccessTokenByReferenceRepository.php:118    [M] Identical

--- Original
+++ New
@@ @@
     {
-        if (null === $expiresAt) {
+        if (null !== $expiresAt) {
             $expiresAt = new \DateTimeImmutable(sprintf('now +%u seconds', $this->lifetime));
         }
         $accessTokenId = AccessTokenId::create(RandomIdGenerator::generate($this->minLength, $this->maxLength));
         $accessToken = AccessToken::createEmpty();
         $accessToken = $accessToken->create($accessTokenId, $resourceOwnerId, $clientId, $parameters, $metadatas, $scopes, $expiresAt, $refreshTokenId, $resourceServerId);
         return $accessToken;

674) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Model/AccessTokenByReferenceRepository.php:116    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function create(ResourceOwnerId $resourceOwnerId, ClientId $clientId, DataBag $parameters, DataBag $metadatas, array $scopes, ?RefreshTokenId $refreshTokenId, ?ResourceServerId $resourceServerId, ?\DateTimeImmutable $expiresAt) : AccessToken
+    protected function create(ResourceOwnerId $resourceOwnerId, ClientId $clientId, DataBag $parameters, DataBag $metadatas, array $scopes, ?RefreshTokenId $refreshTokenId, ?ResourceServerId $resourceServerId, ?\DateTimeImmutable $expiresAt) : AccessToken
     {
         if (null === $expiresAt) {
             $expiresAt = new \DateTimeImmutable(sprintf('now +%u seconds', $this->lifetime));
         }
         $accessTokenId = AccessTokenId::create(RandomIdGenerator::generate($this->minLength, $this->maxLength));
         $accessToken = AccessToken::createEmpty();

675) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Model/AccessTokenByReferenceRepository.php:137    [M] Foreach_

--- Original
+++ New
@@ @@
         $accessToken = AccessToken::createEmpty();
-        foreach ($events as $event) {
+        foreach (array() as $event) {
             $accessToken = $accessToken->apply($event);
         }
         return $accessToken;
     }
     /**
      * @param AccessTokenId $accessTokenId

677) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Model/AuthCodeRepository.php:84    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function create(ClientId $clientId, UserAccountId $userAccountId, array $queryParameters, string $redirectUri, DataBag $parameters, DataBag $metadatas, array $scopes, bool $withRefreshToken, ?ResourceServerId $resourceServerId, ?\DateTimeImmutable $expiresAt) : AuthCode
+    protected function create(ClientId $clientId, UserAccountId $userAccountId, array $queryParameters, string $redirectUri, DataBag $parameters, DataBag $metadatas, array $scopes, bool $withRefreshToken, ?ResourceServerId $resourceServerId, ?\DateTimeImmutable $expiresAt) : AuthCode
     {
         if (null === $expiresAt) {
             $expiresAt = new \DateTimeImmutable(sprintf('now +%u seconds', $this->lifetime));
         }
         $authCodeId = AuthCodeId::create(RandomIdGenerator::generate($this->minLength, $this->maxLength));
         $authCode = AuthCode::createEmpty();

678) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Model/AuthCodeRepository.php:103    [M] Identical

--- Original
+++ New
@@ @@
         $authCode = $this->getFromCache($authCodeId);
-        if (null === $authCode) {
+        if (null !== $authCode) {
             $events = $this->eventStore->getEvents($authCodeId);
             if (!empty($events)) {
                 $authCode = $this->getFromEvents($events);
                 $this->cacheObject($authCode);
             }
         }

679) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Model/AuthCodeRepository.php:105    [M] LogicalNot

--- Original
+++ New
@@ @@
             $events = $this->eventStore->getEvents($authCodeId);
-            if (!empty($events)) {
+            if (empty($events)) {
                 $authCode = $this->getFromEvents($events);
                 $this->cacheObject($authCode);
             }
         }
         return $authCode;
     }

680) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Model/AuthCodeRepository.php:100    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function find(AuthCodeId $authCodeId) : ?AuthCode
+    protected function find(AuthCodeId $authCodeId) : ?AuthCode
     {
         $authCode = $this->getFromCache($authCodeId);
         if (null === $authCode) {
             $events = $this->eventStore->getEvents($authCodeId);
             if (!empty($events)) {
                 $authCode = $this->getFromEvents($events);

681) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Model/AuthCodeRepository.php:120    [M] Foreach_

--- Original
+++ New
@@ @@
         $events = $authCode->recordedMessages();
-        foreach ($events as $event) {
+        foreach (array() as $event) {
             $this->eventStore->save($event);
             $this->eventBus->handle($event);
         }
         $authCode->eraseMessages();
         $this->cacheObject($authCode);
     }

682) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Model/AuthCodeRepository.php:117    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function save(AuthCode $authCode)
+    protected function save(AuthCode $authCode)
     {
         $events = $authCode->recordedMessages();
         foreach ($events as $event) {
             $this->eventStore->save($event);
             $this->eventBus->handle($event);
         }

683) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Model/AuthCodeRepository.php:136    [M] Foreach_

--- Original
+++ New
@@ @@
         $authCode = AuthCode::createEmpty();
-        foreach ($events as $event) {
+        foreach (array() as $event) {
             $authCode = $authCode->apply($event);
         }
         return $authCode;
     }
     /**
      * @param AuthCodeId $authCodeId

684) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Model/ClientRepository.php:61    [M] Identical

--- Original
+++ New
@@ @@
         $client = $this->getFromCache($clientId);
-        if (null === $client) {
+        if (null !== $client) {
             $events = $this->eventStore->getEvents($clientId);
             if (!empty($events)) {
                 $client = $this->getFromEvents($events);
                 $this->cacheObject($client);
             }
         }

685) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Model/ClientRepository.php:63    [M] LogicalNot

--- Original
+++ New
@@ @@
             $events = $this->eventStore->getEvents($clientId);
-            if (!empty($events)) {
+            if (empty($events)) {
                 $client = $this->getFromEvents($events);
                 $this->cacheObject($client);
             }
         }
         return $client;
     }

686) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Model/ClientRepository.php:58    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function find(ClientId $clientId) : ?Client
+    protected function find(ClientId $clientId) : ?Client
     {
         $client = $this->getFromCache($clientId);
         if (null === $client) {
             $events = $this->eventStore->getEvents($clientId);
             if (!empty($events)) {
                 $client = $this->getFromEvents($events);

687) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Model/ClientRepository.php:78    [M] Foreach_

--- Original
+++ New
@@ @@
         $events = $client->recordedMessages();
-        foreach ($events as $event) {
+        foreach (array() as $event) {
             $this->eventStore->save($event);
             $this->eventRecorder->record($event);
         }
         $client->eraseMessages();
         $this->cacheObject($client);
     }

688) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Model/ClientRepository.php:75    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function save(Client $client)
+    protected function save(Client $client)
     {
         $events = $client->recordedMessages();
         foreach ($events as $event) {
             $this->eventStore->save($event);
             $this->eventRecorder->record($event);
         }

689) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Model/ClientRepository.php:94    [M] Foreach_

--- Original
+++ New
@@ @@
         $client = Client::createEmpty();
-        foreach ($events as $event) {
+        foreach (array() as $event) {
             $client = $client->apply($event);
         }
         return $client;
     }
     /**
      * @param ClientId $clientId

690) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Model/InitialAccessTokenRepository.php:74    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function create(?UserAccountId $userAccountId, ?\DateTimeImmutable $expiresAt) : InitialAccessToken
+    protected function create(?UserAccountId $userAccountId, ?\DateTimeImmutable $expiresAt) : InitialAccessToken
     {
         $initialAccessTokeId = InitialAccessTokenId::create(RandomIdGenerator::generate($this->minLength, $this->maxLength));
         $initialAccessToken = InitialAccessToken::createEmpty();
         $initialAccessToken = $initialAccessToken->create($initialAccessTokeId, $userAccountId, $expiresAt);
         return $initialAccessToken;
     }

691) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Model/InitialAccessTokenRepository.php:89    [M] Identical

--- Original
+++ New
@@ @@
         $initialAccessToken = $this->getFromCache($initialAccessTokenId);
-        if (null === $initialAccessToken) {
+        if (null !== $initialAccessToken) {
             $events = $this->eventStore->getEvents($initialAccessTokenId);
             if (!empty($events)) {
                 $initialAccessToken = $this->getFromEvents($events);
                 $this->cacheObject($initialAccessToken);
             }
         }

692) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Model/InitialAccessTokenRepository.php:91    [M] LogicalNot

--- Original
+++ New
@@ @@
             $events = $this->eventStore->getEvents($initialAccessTokenId);
-            if (!empty($events)) {
+            if (empty($events)) {
                 $initialAccessToken = $this->getFromEvents($events);
                 $this->cacheObject($initialAccessToken);
             }
         }
         return $initialAccessToken;
     }

693) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Model/InitialAccessTokenRepository.php:86    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function find(InitialAccessTokenId $initialAccessTokenId) : ?InitialAccessToken
+    protected function find(InitialAccessTokenId $initialAccessTokenId) : ?InitialAccessToken
     {
         $initialAccessToken = $this->getFromCache($initialAccessTokenId);
         if (null === $initialAccessToken) {
             $events = $this->eventStore->getEvents($initialAccessTokenId);
             if (!empty($events)) {
                 $initialAccessToken = $this->getFromEvents($events);

694) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Model/InitialAccessTokenRepository.php:106    [M] Foreach_

--- Original
+++ New
@@ @@
         $events = $initialAccessToken->recordedMessages();
-        foreach ($events as $event) {
+        foreach (array() as $event) {
             $this->eventStore->save($event);
             $this->eventRecorder->record($event);
         }
         $initialAccessToken->eraseMessages();
         $this->cacheObject($initialAccessToken);
     }

695) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Model/InitialAccessTokenRepository.php:103    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function save(InitialAccessToken $initialAccessToken)
+    protected function save(InitialAccessToken $initialAccessToken)
     {
         $events = $initialAccessToken->recordedMessages();
         foreach ($events as $event) {
             $this->eventStore->save($event);
             $this->eventRecorder->record($event);
         }
