696) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Model/InitialAccessTokenRepository.php:122    [M] Foreach_

--- Original
+++ New
@@ @@
         $initialAccessToken = InitialAccessToken::createEmpty();
-        foreach ($events as $event) {
+        foreach (array() as $event) {
             $initialAccessToken = $initialAccessToken->apply($event);
         }
         return $initialAccessToken;
     }
     /**
      * @param InitialAccessTokenId $initialAccessTokenId

697) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Model/PreConfiguredAuthorizationRepository.php:62    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function create(UserAccountId $userAccountId, ClientId $clientId, array $scopes, ?ResourceServerId $resourceServerId) : PreConfiguredAuthorization
+    protected function create(UserAccountId $userAccountId, ClientId $clientId, array $scopes, ?ResourceServerId $resourceServerId) : PreConfiguredAuthorization
     {
         $hash = $this->calculateHash($userAccountId, $clientId, $scopes, $resourceServerId);
         $preConfiguredAuthorization = PreConfiguredAuthorization::createEmpty();
         $preConfiguredAuthorization = $preConfiguredAuthorization->create($hash, $userAccountId, $clientId, $scopes);
         return $preConfiguredAuthorization;
     }

698) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Model/PreConfiguredAuthorizationRepository.php:78    [M] Identical

--- Original
+++ New
@@ @@
         $preConfiguredAuthorization = $this->getFromCache($hash);
-        if (null === $preConfiguredAuthorization) {
+        if (null !== $preConfiguredAuthorization) {
             $events = $this->eventStore->getEvents($hash);
             if (!empty($events)) {
                 $preConfiguredAuthorization = $this->getFromEvents($events);
                 $this->cacheObject($preConfiguredAuthorization);
             }
         }

699) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Model/PreConfiguredAuthorizationRepository.php:80    [M] LogicalNot

--- Original
+++ New
@@ @@
             $events = $this->eventStore->getEvents($hash);
-            if (!empty($events)) {
+            if (empty($events)) {
                 $preConfiguredAuthorization = $this->getFromEvents($events);
                 $this->cacheObject($preConfiguredAuthorization);
             }
         }
         return $preConfiguredAuthorization;
     }

700) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Model/PreConfiguredAuthorizationRepository.php:74    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function find(UserAccountId $userAccountId, ClientId $clientId, array $scopes, ?ResourceServerId $resourceServerId) : ?PreConfiguredAuthorization
+    protected function find(UserAccountId $userAccountId, ClientId $clientId, array $scopes, ?ResourceServerId $resourceServerId) : ?PreConfiguredAuthorization
     {
         $hash = $this->calculateHash($userAccountId, $clientId, $scopes, $resourceServerId);
         $preConfiguredAuthorization = $this->getFromCache($hash);
         if (null === $preConfiguredAuthorization) {
             $events = $this->eventStore->getEvents($hash);
             if (!empty($events)) {

701) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Model/PreConfiguredAuthorizationRepository.php:95    [M] Foreach_

--- Original
+++ New
@@ @@
         $events = $preConfiguredAuthorization->recordedMessages();
-        foreach ($events as $event) {
+        foreach (array() as $event) {
             $this->eventStore->save($event);
             $this->eventRecorder->record($event);
         }
         $preConfiguredAuthorization->eraseMessages();
         $this->cacheObject($preConfiguredAuthorization);
     }

702) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Model/PreConfiguredAuthorizationRepository.php:92    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function save(PreConfiguredAuthorization $preConfiguredAuthorization)
+    protected function save(PreConfiguredAuthorization $preConfiguredAuthorization)
     {
         $events = $preConfiguredAuthorization->recordedMessages();
         foreach ($events as $event) {
             $this->eventStore->save($event);
             $this->eventRecorder->record($event);
         }

703) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Model/PreConfiguredAuthorizationRepository.php:127    [M] Foreach_

--- Original
+++ New
@@ @@
         $preConfiguredAuthorization = PreConfiguredAuthorization::createEmpty();
-        foreach ($events as $event) {
+        foreach (array() as $event) {
             $preConfiguredAuthorization = $preConfiguredAuthorization->apply($event);
         }
         return $preConfiguredAuthorization;
     }
     /**
      * @param PreConfiguredAuthorization $preConfiguredAuthorization

705) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Model/RefreshTokenRepository.php:84    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function create(ResourceOwnerId $resourceOwnerId, ClientId $clientId, DataBag $parameters, DataBag $metadatas, array $scopes, ?ResourceServerId $resourceServerId, ?\DateTimeImmutable $expiresAt) : RefreshToken
+    protected function create(ResourceOwnerId $resourceOwnerId, ClientId $clientId, DataBag $parameters, DataBag $metadatas, array $scopes, ?ResourceServerId $resourceServerId, ?\DateTimeImmutable $expiresAt) : RefreshToken
     {
         if (null === $expiresAt) {
             $expiresAt = new \DateTimeImmutable(sprintf('now +%u seconds', $this->lifetime));
         }
         $refreshTokenId = RefreshTokenId::create(RandomIdGenerator::generate($this->minLength, $this->maxLength));
         $refreshToken = RefreshToken::createEmpty();

706) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Model/RefreshTokenRepository.php:103    [M] Identical

--- Original
+++ New
@@ @@
         $refreshToken = $this->getFromCache($refreshTokenId);
-        if (null === $refreshToken) {
+        if (null !== $refreshToken) {
             $events = $this->eventStore->getEvents($refreshTokenId);
             if (!empty($events)) {
                 $refreshToken = $this->getFromEvents($events);
                 $this->cacheObject($refreshToken);
             }
         }

707) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Model/RefreshTokenRepository.php:105    [M] LogicalNot

--- Original
+++ New
@@ @@
             $events = $this->eventStore->getEvents($refreshTokenId);
-            if (!empty($events)) {
+            if (empty($events)) {
                 $refreshToken = $this->getFromEvents($events);
                 $this->cacheObject($refreshToken);
             }
         }
         return $refreshToken;
     }

708) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Model/RefreshTokenRepository.php:100    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function find(RefreshTokenId $refreshTokenId)
+    protected function find(RefreshTokenId $refreshTokenId)
     {
         $refreshToken = $this->getFromCache($refreshTokenId);
         if (null === $refreshToken) {
             $events = $this->eventStore->getEvents($refreshTokenId);
             if (!empty($events)) {
                 $refreshToken = $this->getFromEvents($events);

709) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Model/RefreshTokenRepository.php:120    [M] Foreach_

--- Original
+++ New
@@ @@
         $events = $refreshToken->recordedMessages();
-        foreach ($events as $event) {
+        foreach (array() as $event) {
             $this->eventStore->save($event);
             $this->eventBus->handle($event);
         }
         $refreshToken->eraseMessages();
         $this->cacheObject($refreshToken);
     }

710) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Model/RefreshTokenRepository.php:117    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function save(RefreshToken $refreshToken)
+    protected function save(RefreshToken $refreshToken)
     {
         $events = $refreshToken->recordedMessages();
         foreach ($events as $event) {
             $this->eventStore->save($event);
             $this->eventBus->handle($event);
         }

711) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Model/RefreshTokenRepository.php:136    [M] Foreach_

--- Original
+++ New
@@ @@
         $refreshToken = RefreshToken::createEmpty();
-        foreach ($events as $event) {
+        foreach (array() as $event) {
             $refreshToken = $refreshToken->apply($event);
         }
         return $refreshToken;
     }
     /**
      * @param RefreshTokenId $refreshTokenId

713) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/OAuth2FrameworkServerBundle.php:40    [M] NewObject

--- Original
+++ New
@@ @@
     {
-        return new OAuth2FrameworkServerExtension($alias);
+        new OAuth2FrameworkServerExtension($alias);
+        return null;
     }
     /**
      * {@inheritdoc}
      */
     public function build(ContainerBuilder $container)

714) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/OAuth2FrameworkServerBundle.php:38    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function getContainerExtension($alias = 'oauth2_server')
+    protected function getContainerExtension($alias = 'oauth2_server')
     {
         return new OAuth2FrameworkServerExtension($alias);
     }
     /**
      * {@inheritdoc}
      */

715) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/OAuth2FrameworkServerBundle.php:48    [M] Foreach_

--- Original
+++ New
@@ @@
     {
-        foreach ($this->getCompilerPasses() as $pass) {
+        foreach (array() as $pass) {
             $container->addCompilerPass($pass);
         }
         /** @var SecurityExtension $extension */
         $extension = $container->getExtension('security');
         $extension->addSecurityListenerFactory(new OAuth2SecurityFactory());
     }

716) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/OAuth2FrameworkServerBundle.php:46    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function build(ContainerBuilder $container)
+    protected function build(ContainerBuilder $container)
     {
         foreach ($this->getCompilerPasses() as $pass) {
             $container->addCompilerPass($pass);
         }
         /** @var SecurityExtension $extension */
         $extension = $container->getExtension('security');

717) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Resolver/AccessTokenResolver.php:45    [M] NotIdentical

--- Original
+++ New
@@ @@
     {
-        if (AccessToken::class !== $argument->getType()) {
+        if (AccessToken::class === $argument->getType()) {
             return false;
         }
         return $this->tokenStorage->getToken() instanceof OAuth2Token;
     }
     /**
      * {@inheritdoc}

718) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Resolver/AccessTokenResolver.php:46    [M] FalseValue

--- Original
+++ New
@@ @@
         if (AccessToken::class !== $argument->getType()) {
-            return false;
+            return true;
         }
         return $this->tokenStorage->getToken() instanceof OAuth2Token;
     }
     /**
      * {@inheritdoc}
      */

719) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Resolver/AccessTokenResolver.php:43    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function supports(Request $request, ArgumentMetadata $argument)
+    protected function supports(Request $request, ArgumentMetadata $argument)
     {
         if (AccessToken::class !== $argument->getType()) {
             return false;
         }
         return $this->tokenStorage->getToken() instanceof OAuth2Token;
     }

720) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Resolver/AccessTokenResolver.php:55    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function resolve(Request $request, ArgumentMetadata $argument)
+    protected function resolve(Request $request, ArgumentMetadata $argument)
     {
         (yield $this->tokenStorage->getToken()->getAccessToken());
     }
 }

721) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Response/AuthenticateResponseFactory.php:42    [M] Foreach_

--- Original
+++ New
@@ @@
         $schemes = [];
-        foreach ($this->tokenEndpointAuthMethodManager->getTokenEndpointAuthMethods() as $method) {
+        foreach (array() as $method) {
             $scheme = $method->getSchemesParameters();
             $schemes = array_merge($schemes, $scheme);
         }
         return $schemes;
     }
 }

722) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Response/AuthenticateResponseFactory.php:39    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
      */
-    protected function getSchemes() : array
+    private function getSchemes() : array
     {
         $schemes = [];
         foreach ($this->tokenEndpointAuthMethodManager->getTokenEndpointAuthMethods() as $method) {
             $scheme = $method->getSchemesParameters();
             $schemes = array_merge($schemes, $scheme);
         }

723) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Routing/RouteLoader.php:49    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function addRoute($name, $controllerId, $methodName, $path, array $defaults = [], array $requirements = [], array $options = [], $host = '', $schemes = [], $methods = [], $condition = '')
+    protected function addRoute($name, $controllerId, $methodName, $path, array $defaults = [], array $requirements = [], array $options = [], $host = '', $schemes = [], $methods = [], $condition = '')
     {
         $defaults['_controller'] = sprintf('%s:%s', $controllerId, $methodName);
         $route = new Route($path, $defaults, $requirements, $options, $host, $schemes, $methods, $condition);
         $this->routes->add(sprintf('oauth2_server_%s', $name), $route);
     }
     /**

724) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Routing/RouteLoader.php:59    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function load($resource, $type = null)
+    protected function load($resource, $type = null)
     {
         return $this->routes;
     }
     /**
      * {@inheritdoc}
      */

725) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Routing/RouteLoader.php:69    [M] Identical

--- Original
+++ New
@@ @@
     {
-        return 'oauth2_server' === $type;
+        return 'oauth2_server' !== $type;
     }
     /**
      * {@inheritdoc}
      */
     public function getResolver()
     {

726) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Routing/RouteLoader.php:67    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function supports($resource, $type = null)
+    protected function supports($resource, $type = null)
     {
         return 'oauth2_server' === $type;
     }
     /**
      * {@inheritdoc}
      */

727) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Routing/RouteLoader.php:75    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function getResolver()
+    protected function getResolver()
     {
     }
     /**
      * {@inheritdoc}
      */
     public function setResolver(LoaderResolverInterface $resolver)

728) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Routing/RouteLoader.php:82    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function setResolver(LoaderResolverInterface $resolver)
+    protected function setResolver(LoaderResolverInterface $resolver)
     {
     }
 }

729) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Rule/ClientRegistrationManagementRule.php:42    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
      */
-    protected function getRegistrationClientUri(ClientId $clientId) : string
+    private function getRegistrationClientUri(ClientId $clientId) : string
     {
         return $this->router->generate('oauth2_server_client_configuration', ['client_id' => $clientId->getValue()], UrlGeneratorInterface::ABSOLUTE_URL);
     }
     /**
      * {@inheritdoc}
      */

730) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Rule/ClientRegistrationManagementRule.php:50    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
      */
-    protected function generateRegistrationAccessToken() : string
+    private function generateRegistrationAccessToken() : string
     {
         return Base64Url::encode(random_bytes(512));
     }
 }

731) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Security/Authentication/Provider/OAuth2Provider.php:29    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$this->supports($token)) {
+        if ($this->supports($token)) {
             return null;
         }
         /** @var OAuth2Token $token */
         $accessToken = $token->getAccessToken();
         if (true === $accessToken->hasExpired()) {
             throw new BadCredentialsException('The access token has expired.');

732) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Security/Authentication/Provider/OAuth2Provider.php:36    [M] TrueValue

--- Original
+++ New
@@ @@
         $accessToken = $token->getAccessToken();
-        if (true === $accessToken->hasExpired()) {
+        if (false === $accessToken->hasExpired()) {
             throw new BadCredentialsException('The access token has expired.');
         }
         try {
             $token->setAuthenticated(true);
             return $token;
         } catch (\Exception $e) {

733) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Security/Authentication/Provider/OAuth2Provider.php:36    [M] Identical

--- Original
+++ New
@@ @@
         $accessToken = $token->getAccessToken();
-        if (true === $accessToken->hasExpired()) {
+        if (true !== $accessToken->hasExpired()) {
             throw new BadCredentialsException('The access token has expired.');
         }
         try {
             $token->setAuthenticated(true);
             return $token;
         } catch (\Exception $e) {

734) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Security/Authentication/Provider/OAuth2Provider.php:41    [M] TrueValue

--- Original
+++ New
@@ @@
         try {
-            $token->setAuthenticated(true);
+            $token->setAuthenticated(false);
             return $token;
         } catch (\Exception $e) {
             throw new AuthenticationException($e->getMessage(), $e->getCode(), $e);
         }
     }
     /**

735) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Security/Authentication/Provider/OAuth2Provider.php:27    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function authenticate(TokenInterface $token)
+    protected function authenticate(TokenInterface $token)
     {
         if (!$this->supports($token)) {
             return null;
         }
         /** @var OAuth2Token $token */
         $accessToken = $token->getAccessToken();

736) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Security/Authentication/Provider/OAuth2Provider.php:52    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function supports(TokenInterface $token)
+    protected function supports(TokenInterface $token)
     {
         return $token instanceof OAuth2Token;
     }
 }

738) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Security/Authentication/Token/OAuth2Token.php:43    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function getAccessToken() : AccessToken
+    protected function getAccessToken() : AccessToken
     {
         return $this->accessToken;
     }
     /**
      * @return string
      */

739) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Security/Authentication/Token/OAuth2Token.php:51    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function getClientId() : string
+    protected function getClientId() : string
     {
         return $this->accessToken->getClientId()->getValue();
     }
     /**
      * @return string
      */

740) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Security/Authentication/Token/OAuth2Token.php:59    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function getResourceOwnerId() : string
+    protected function getResourceOwnerId() : string
     {
         return $this->accessToken->getResourceOwnerId()->getValue();
     }
     /**
      * {@inheritdoc}
      */

741) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Security/Authentication/Token/OAuth2Token.php:67    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function getCredentials()
+    protected function getCredentials()
     {
         return $this->getToken();
     }
 }

742) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Security/EntryPoint/OAuth2EntryPoint.php:50    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function start(Request $request, AuthenticationException $authException = null)
+    protected function start(Request $request, AuthenticationException $authException = null)
     {
         $response = $this->messageFactory->createResponse();
         $factory = new HttpFoundationFactory();
         $oauth2Response = $this->authenticateResponseFactory->createResponse(['error' => 'invalid_grant', 'error_description' => 'Access token is missing.'], $response);
         return $factory->createResponse($oauth2Response->getResponse());
     }

743) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Security/Factory/OAuth2SecurityFactory.php:33    [M] TrueValue

--- Original
+++ New
@@ @@
         $providerId = 'security.authentication.provider.oauth2.' . $id;
-        $container->setDefinition($providerId, new ChildDefinition(OAuth2Provider::class))->setAutowired(true);
+        $container->setDefinition($providerId, new ChildDefinition(OAuth2Provider::class))->setAutowired(false);
         $listenerId = 'security.authentication.listener.oauth2.' . $id;
         $listener = $container->setDefinition($listenerId, new ChildDefinition(OAuth2Listener::class))->setArguments([new Reference(TokenStorageInterface::class), new Reference('security.authentication.manager')]);
         return array($providerId, $listenerId, OAuth2EntryPoint::class);
     }
     /**
      * {@inheritdoc}

744) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Security/Factory/OAuth2SecurityFactory.php:28    [M] PublicVisibility

--- Original
+++ New
@@ @@
 {
-    public function create(ContainerBuilder $container, $id, $config, $userProvider, $defaultEntryPoint)
+    protected function create(ContainerBuilder $container, $id, $config, $userProvider, $defaultEntryPoint)
     {
         $providerId = 'security.authentication.provider.oauth2.' . $id;
         $container->setDefinition($providerId, new ChildDefinition(OAuth2Provider::class))->setAutowired(true);
         $listenerId = 'security.authentication.listener.oauth2.' . $id;
         $listener = $container->setDefinition($listenerId, new ChildDefinition(OAuth2Listener::class))->setArguments([new Reference(TokenStorageInterface::class), new Reference('security.authentication.manager')]);
         return array($providerId, $listenerId, OAuth2EntryPoint::class);

745) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Security/Factory/OAuth2SecurityFactory.php:51    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function getPosition()
+    protected function getPosition()
     {
         return 'pre_auth';
     }
     /**
      * {@inheritdoc}
      */

746) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Security/Factory/OAuth2SecurityFactory.php:59    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function getKey()
+    protected function getKey()
     {
         return 'oauth2';
     }
     /**
      * {@inheritdoc}
      */

748) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Security/Firewall/OAuth2Listener.php:89    [M] Identical

--- Original
+++ New
@@ @@
             $accessTokenId = $this->tokenTypeManager->findToken($request, $additionalCredentialValues);
-            if (null === $accessTokenId) {
+            if (null !== $accessTokenId) {
                 return;
             }
         } catch (\Exception $e) {
             return;
         }
         try {

749) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Security/Firewall/OAuth2Listener.php:98    [M] Identical

--- Original
+++ New
@@ @@
             $accessToken = $this->accessTokenHandlerManager->find(AccessTokenId::create($accessTokenId));
-            if (null === $accessToken || true === $accessToken->isRevoked()) {
+            if (null !== $accessToken || true === $accessToken->isRevoked()) {
                 throw new AuthenticationException('Invalid access token.');
             }
             $token = new OAuth2Token($accessToken);
             $result = $this->authenticationManager->authenticate($token);
             $this->tokenStorage->setToken($result);
         } catch (AuthenticationException $e) {

750) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Security/Firewall/OAuth2Listener.php:98    [M] TrueValue

--- Original
+++ New
@@ @@
             $accessToken = $this->accessTokenHandlerManager->find(AccessTokenId::create($accessTokenId));
-            if (null === $accessToken || true === $accessToken->isRevoked()) {
+            if (null === $accessToken || false === $accessToken->isRevoked()) {
                 throw new AuthenticationException('Invalid access token.');
             }
             $token = new OAuth2Token($accessToken);
             $result = $this->authenticationManager->authenticate($token);
             $this->tokenStorage->setToken($result);
         } catch (AuthenticationException $e) {

751) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Security/Firewall/OAuth2Listener.php:98    [M] Identical

--- Original
+++ New
@@ @@
             $accessToken = $this->accessTokenHandlerManager->find(AccessTokenId::create($accessTokenId));
-            if (null === $accessToken || true === $accessToken->isRevoked()) {
+            if (null === $accessToken || true !== $accessToken->isRevoked()) {
                 throw new AuthenticationException('Invalid access token.');
             }
             $token = new OAuth2Token($accessToken);
             $result = $this->authenticationManager->authenticate($token);
             $this->tokenStorage->setToken($result);
         } catch (AuthenticationException $e) {

752) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Security/Firewall/OAuth2Listener.php:98    [M] LogicalOr

--- Original
+++ New
@@ @@
             $accessToken = $this->accessTokenHandlerManager->find(AccessTokenId::create($accessTokenId));
-            if (null === $accessToken || true === $accessToken->isRevoked()) {
+            if (null === $accessToken && true === $accessToken->isRevoked()) {
                 throw new AuthenticationException('Invalid access token.');
             }
             $token = new OAuth2Token($accessToken);
             $result = $this->authenticationManager->authenticate($token);
             $this->tokenStorage->setToken($result);
         } catch (AuthenticationException $e) {

753) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Security/Firewall/OAuth2Listener.php:107    [M] NotIdentical

--- Original
+++ New
@@ @@
         } catch (AuthenticationException $e) {
-            if (null !== $e->getPrevious()) {
+            if (null === $e->getPrevious()) {
                 $e = $e->getPrevious();
             }
             $oauth2Response = $this->oauth2ResponseFactoryManager->getResponse(401, ['error' => 'invalid_grant', 'error_description' => $e->getMessage()]);
             $response = $oauth2Response->getResponse();
             $factory = new HttpFoundationFactory();
             $event->setResponse($factory->createResponse($response));

754) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Security/Firewall/OAuth2Listener.php:81    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function handle(GetResponseEvent $event)
+    protected function handle(GetResponseEvent $event)
     {
         $factory = new DiactorosFactory();
         $request = $factory->createRequest($event->getRequest());
         try {
             $additionalCredentialValues = [];
             $accessTokenId = $this->tokenTypeManager->findToken($request, $additionalCredentialValues);
