755) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Service/FormPostResponseRenderer.php:46    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function render(string $redirect_uri, array $data) : string
+    protected function render(string $redirect_uri, array $data) : string
     {
         return $this->templateEngine->render($this->template, ['redirect_uri' => $redirect_uri, 'inputs' => $data]);
     }
 }

756) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Service/IFrameEndpoint.php:68    [M] Foreach_

--- Original
+++ New
@@ @@
         $headers = ['Content-Type' => 'text/html; charset=UTF-8', 'Cache-Control' => 'no-cache, no-store, max-age=0, must-revalidate, private', 'Pragma' => 'no-cache'];
-        foreach ($headers as $k => $v) {
+        foreach (array() as $k => $v) {
             $response = $response->withHeader($k, $v);
         }
         $response->getBody()->write($content);
         return $response;
     }
 }

758) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Service/IssuerDiscoveryFactory.php:51    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function create(ResourceRepositoryInterface $resourceManager, string $server) : IssuerDiscoveryEndpoint
+    protected function create(ResourceRepositoryInterface $resourceManager, string $server) : IssuerDiscoveryEndpoint
     {
         return new IssuerDiscoveryEndpoint($resourceManager, $this->messageFactory, $this->uriFactory, $server);
     }
 }

759) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Service/MetadataBuilder.php:54    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function getMetadata() : Metadata
+    protected function getMetadata() : Metadata
     {
         return $this->metadata;
     }
     /**
      * @param string $name
      * @param string $routeName

760) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Service/MetadataBuilder.php:64    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function setRoute(string $name, string $routeName, array $routeParameters = [])
+    protected function setRoute(string $name, string $routeName, array $routeParameters = [])
     {
         $path = $this->router->generate($routeName, $routeParameters, RouterInterface::ABSOLUTE_URL);
         $this->metadata->set($name, $path);
     }
     /**
      * @param PKCEMethodManager $PKCEMethodManager

761) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Service/MetadataBuilder.php:73    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function setCodeChallengeMethodsSupported(PKCEMethodManager $PKCEMethodManager)
+    protected function setCodeChallengeMethodsSupported(PKCEMethodManager $PKCEMethodManager)
     {
         $this->metadata->set('code_challenge_methods_supported', $PKCEMethodManager->names());
     }
     /**
      * @param ClientAssertionJwt $clientAssertionJwt
      */

762) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Service/MetadataBuilder.php:81    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function setClientAssertionJwt(ClientAssertionJwt $clientAssertionJwt)
+    protected function setClientAssertionJwt(ClientAssertionJwt $clientAssertionJwt)
     {
         $this->metadata->set('token_endpoint_auth_signing_alg_values_supported', $clientAssertionJwt->getSupportedSignatureAlgorithms());
         $this->metadata->set('token_endpoint_auth_encryption_alg_values_supported', $clientAssertionJwt->getSupportedKeyEncryptionAlgorithms());
         $this->metadata->set('token_endpoint_auth_encryption_enc_values_supported', $clientAssertionJwt->getSupportedContentEncryptionAlgorithms());
     }
     /**

763) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Service/MetadataBuilder.php:91    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function setGrantTypeManager(GrantTypeManager $grantTypeManager)
+    protected function setGrantTypeManager(GrantTypeManager $grantTypeManager)
     {
         $this->metadata->set('grant_types_supported', $grantTypeManager->getSupportedGrantTypes());
     }
     /**
      * @param ResponseTypeManager $responseTypeManager
      */

764) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Service/MetadataBuilder.php:99    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function setResponseTypeManager(ResponseTypeManager $responseTypeManager)
+    protected function setResponseTypeManager(ResponseTypeManager $responseTypeManager)
     {
         $this->metadata->set('response_types_supported', $responseTypeManager->all());
     }
     /**
      * @param ResponseModeManager $responseModeManager
      */

765) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Service/MetadataBuilder.php:107    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function setResponseModeManager(ResponseModeManager $responseModeManager)
+    protected function setResponseModeManager(ResponseModeManager $responseModeManager)
     {
         $this->metadata->set('response_modes_supported', $responseModeManager->all());
     }
     /**
      * @param TokenEndpointAuthMethodManager $tokenEndpointAuthMethodManager
      */

766) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Service/MetadataBuilder.php:115    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function setTokenEndpointAuthMethodManager(TokenEndpointAuthMethodManager $tokenEndpointAuthMethodManager)
+    protected function setTokenEndpointAuthMethodManager(TokenEndpointAuthMethodManager $tokenEndpointAuthMethodManager)
     {
         $this->metadata->set('token_endpoint_auth_methods_supported', $tokenEndpointAuthMethodManager->all());
     }
     /**
      * @param ScopeRepositoryInterface $scopeRepository
      */

767) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Service/MetadataBuilder.php:123    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function setScopeRepository(ScopeRepositoryInterface $scopeRepository)
+    protected function setScopeRepository(ScopeRepositoryInterface $scopeRepository)
     {
         $this->metadata->set('scopes_supported', $scopeRepository->getSupportedScopes());
     }
     /**
      * @param UserInfo $userInfo
      */

768) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Service/MetadataBuilder.php:131    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function setUserinfo(UserInfo $userInfo)
+    protected function setUserinfo(UserInfo $userInfo)
     {
         $this->metadata->set('subject_types_supported', $userInfo->isPairwiseSubjectIdentifierSupported() ? ['public', 'pairwise'] : ['public']);
         $this->metadata->set('claims_supported', $userInfo->getClaimsSupported());
     }
     /**
      * @param string $name

769) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Service/MetadataBuilder.php:141    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function addKeyValuePair(string $name, $value)
+    protected function addKeyValuePair(string $name, $value)
     {
         $this->metadata->set($name, $value);
     }
     /**
      * @param AuthorizationRequestLoader $authorizationRequestLoader
      */

770) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Service/MetadataBuilder.php:149    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function setAuthorizationRequestLoader(AuthorizationRequestLoader $authorizationRequestLoader)
+    protected function setAuthorizationRequestLoader(AuthorizationRequestLoader $authorizationRequestLoader)
     {
         $requestObjectSupported = $authorizationRequestLoader->isRequestObjectSupportEnabled();
         $this->metadata->set('request_parameter_supported', $authorizationRequestLoader->isRequestObjectSupportEnabled());
         if ($requestObjectSupported) {
             $this->metadata->set('request_uri_parameter_supported', $authorizationRequestLoader->isRequestObjectReferenceSupportEnabled());
             $this->metadata->set('require_request_uri_registration', $authorizationRequestLoader->isRequestUriRegistrationRequired());

771) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Service/RandomIdGenerator.php:26    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public static function generate(int $min, int $max) : string
+    protected static function generate(int $min, int $max) : string
     {
         $length = random_int($min, $max);
         return Base64Url::encode(random_bytes($length));
     }
 }

772) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Service/SessionStateParameterExtension.php:50    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
      */
-    protected function getBrowserState(ServerRequestInterface $request, Authorization &$authorization) : string
+    private function getBrowserState(ServerRequestInterface $request, Authorization &$authorization) : string
     {
         if ($this->session->has($this->storageName)) {
             return $this->session->get($this->storageName);
         }
         $browserState = Base64Url::encode(random_bytes(64));
         $this->session->set($this->storageName, $browserState);

773) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Service/SessionStateParameterExtension.php:67    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
      */
-    protected function calculateSessionState(ServerRequestInterface $request, Authorization $authorization, string $browserState) : string
+    private function calculateSessionState(ServerRequestInterface $request, Authorization $authorization, string $browserState) : string
     {
         $origin = $this->getOriginUri($authorization->getRedirectUri());
         $salt = Base64Url::encode(random_bytes(16));
         $hash = hash('sha256', sprintf('%s%s%s%s', $authorization->getClient()->getPublicId(), $origin, $browserState, $salt));
         return sprintf('%s.%s', $hash, $salt);
     }

774) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Service/SymfonyUserDiscovery.php:57    [M] NotIdentical

--- Original
+++ New
@@ @@
     {
-        if (null !== ($token = $this->tokenStorage->getToken())) {
+        if (null === ($token = $this->tokenStorage->getToken())) {
             $userAccount = $token->getUser();
             if ($userAccount instanceof UserAccountInterface) {
                 $this->checkUserAccount($userAccount, $authorization);
                 $isFullyAuthenticated = $this->authorizationChecker->isGranted('IS_AUTHENTICATED_FULLY');
                 if (true === $authorization->isUserAccountFullyAuthenticated()) {
                     $isFullyAuthenticated = true;

775) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Service/SymfonyUserDiscovery.php:62    [M] TrueValue

--- Original
+++ New
@@ @@
                 $isFullyAuthenticated = $this->authorizationChecker->isGranted('IS_AUTHENTICATED_FULLY');
-                if (true === $authorization->isUserAccountFullyAuthenticated()) {
+                if (false === $authorization->isUserAccountFullyAuthenticated()) {
                     $isFullyAuthenticated = true;
                 }
                 $authorization = $authorization->withUserAccount($userAccount, $isFullyAuthenticated);
             }
         }
         return $next($request, $authorization);

776) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Service/SymfonyUserDiscovery.php:62    [M] Identical

--- Original
+++ New
@@ @@
                 $isFullyAuthenticated = $this->authorizationChecker->isGranted('IS_AUTHENTICATED_FULLY');
-                if (true === $authorization->isUserAccountFullyAuthenticated()) {
+                if (true !== $authorization->isUserAccountFullyAuthenticated()) {
                     $isFullyAuthenticated = true;
                 }
                 $authorization = $authorization->withUserAccount($userAccount, $isFullyAuthenticated);
             }
         }
         return $next($request, $authorization);

777) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Service/SymfonyUserDiscovery.php:63    [M] TrueValue

--- Original
+++ New
@@ @@
                 if (true === $authorization->isUserAccountFullyAuthenticated()) {
-                    $isFullyAuthenticated = true;
+                    $isFullyAuthenticated = false;
                 }
                 $authorization = $authorization->withUserAccount($userAccount, $isFullyAuthenticated);
             }
         }
         return $next($request, $authorization);
     }

778) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Service/SymfonyUserDiscovery.php:55    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function find(ServerRequestInterface $request, Authorization $authorization, callable $next) : Authorization
+    protected function find(ServerRequestInterface $request, Authorization $authorization, callable $next) : Authorization
     {
         if (null !== ($token = $this->tokenStorage->getToken())) {
             $userAccount = $token->getUser();
             if ($userAccount instanceof UserAccountInterface) {
                 $this->checkUserAccount($userAccount, $authorization);
                 $isFullyAuthenticated = $this->authorizationChecker->isGranted('IS_AUTHENTICATED_FULLY');

779) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Service/SymfonyUserDiscovery.php:80    [M] NotIdentical

--- Original
+++ New
@@ @@
     {
-        if (null !== $authorization->getUserAccount() && $userAccount->getPublicId()->getValue() !== $authorization->getUserAccount()->getPublicId()->getValue()) {
+        if (null === $authorization->getUserAccount() && $userAccount->getPublicId()->getValue() !== $authorization->getUserAccount()->getPublicId()->getValue()) {
             throw new RedirectToLoginPageException($authorization);
         }
     }
 }

780) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Service/SymfonyUserDiscovery.php:80    [M] NotIdentical

--- Original
+++ New
@@ @@
     {
-        if (null !== $authorization->getUserAccount() && $userAccount->getPublicId()->getValue() !== $authorization->getUserAccount()->getPublicId()->getValue()) {
+        if (null !== $authorization->getUserAccount() && $userAccount->getPublicId()->getValue() === $authorization->getUserAccount()->getPublicId()->getValue()) {
             throw new RedirectToLoginPageException($authorization);
         }
     }
 }

781) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/Service/SymfonyUserDiscovery.php:80    [M] LogicalAnd

--- Original
+++ New
@@ @@
     {
-        if (null !== $authorization->getUserAccount() && $userAccount->getPublicId()->getValue() !== $authorization->getUserAccount()->getPublicId()->getValue()) {
+        if (null !== $authorization->getUserAccount() || $userAccount->getPublicId()->getValue() !== $authorization->getUserAccount()->getPublicId()->getValue()) {
             throw new RedirectToLoginPageException($authorization);
         }
     }
 }

782) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/TokenEndpointAuthMethod/ClientAssertionJwt.php:24    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
      */
-    protected function createClientSecret() : string
+    private function createClientSecret() : string
     {
         return Base64Url::encode(random_bytes(64));
     }
 }

785) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Bundle/Server/TokenType/MacToken.php:49    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
      */
-    protected function generateMacKey() : string
+    private function generateMacKey() : string
     {
         return Base64Url::encode(random_bytes($this->getMacKeyLength()));
     }
     /**
      * @return int
      */

786) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCode.php:170    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function getQueryParam(string $key)
+    protected function getQueryParam(string $key)
     {
         if ($this->hasQueryParams($key)) {
             throw new \RuntimeException(sprintf('Query parameter with key "%s" does not exist.', $key));
         }
         return $this->queryParameters[$key];
     }

787) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCode.php:184    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function hasQueryParams(string $key) : bool
+    protected function hasQueryParams(string $key) : bool
     {
         return array_key_exists($key, $this->getQueryParams());
     }
     /**
      * @return string
      */

789) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCodeGrantType.php:146    [M] LogicalNot

--- Original
+++ New
@@ @@
         if (true === $client->isPublic()) {
-            if (!array_key_exists('client_id', $parameters) || $client->getPublicId()->getValue() !== $parameters['client_id']) {
+            if (array_key_exists('client_id', $parameters) || $client->getPublicId()->getValue() !== $parameters['client_id']) {
                 throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, 'The "client_id" parameter is required for non-confidential clients.');
             }
         }
     }
     /**
      * @param AuthorizationCode $authorizationCode

790) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCodeGrantType.php:146    [M] NotIdentical

--- Original
+++ New
@@ @@
         if (true === $client->isPublic()) {
-            if (!array_key_exists('client_id', $parameters) || $client->getPublicId()->getValue() !== $parameters['client_id']) {
+            if (!array_key_exists('client_id', $parameters) || $client->getPublicId()->getValue() === $parameters['client_id']) {
                 throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, 'The "client_id" parameter is required for non-confidential clients.');
             }
         }
     }
     /**
      * @param AuthorizationCode $authorizationCode

791) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCodeGrantType.php:146    [M] LogicalOr

--- Original
+++ New
@@ @@
         if (true === $client->isPublic()) {
-            if (!array_key_exists('client_id', $parameters) || $client->getPublicId()->getValue() !== $parameters['client_id']) {
+            if (!array_key_exists('client_id', $parameters) && $client->getPublicId()->getValue() !== $parameters['client_id']) {
                 throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, 'The "client_id" parameter is required for non-confidential clients.');
             }
         }
     }
     /**
      * @param AuthorizationCode $authorizationCode

792) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCodeResponseType.php:93    [M] TrueValue

--- Original
+++ New
@@ @@
         if (!array_key_exists('code_challenge', $queryParams)) {
-            if (true === $this->pkceForPublicClientsEnforced && $authorization->getClient()->isPublic()) {
+            if (false === $this->pkceForPublicClientsEnforced && $authorization->getClient()->isPublic()) {
                 throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, 'Non-confidential clients must set a proof key (PKCE) for code exchange.');
             }
         } else {
             $codeChallengeMethod = array_key_exists('code_challenge_method', $queryParams) ? $queryParams['code_challenge_method'] : 'plain';
             if (!$this->pkceMethodManager->has($codeChallengeMethod)) {
                 throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, sprintf('The challenge method "%s" is not supported.', $codeChallengeMethod));

793) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCodeResponseType.php:93    [M] Identical

--- Original
+++ New
@@ @@
         if (!array_key_exists('code_challenge', $queryParams)) {
-            if (true === $this->pkceForPublicClientsEnforced && $authorization->getClient()->isPublic()) {
+            if (true !== $this->pkceForPublicClientsEnforced && $authorization->getClient()->isPublic()) {
                 throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, 'Non-confidential clients must set a proof key (PKCE) for code exchange.');
             }
         } else {
             $codeChallengeMethod = array_key_exists('code_challenge_method', $queryParams) ? $queryParams['code_challenge_method'] : 'plain';
             if (!$this->pkceMethodManager->has($codeChallengeMethod)) {
                 throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, sprintf('The challenge method "%s" is not supported.', $codeChallengeMethod));

794) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCodeResponseType.php:93    [M] LogicalAnd

--- Original
+++ New
@@ @@
         if (!array_key_exists('code_challenge', $queryParams)) {
-            if (true === $this->pkceForPublicClientsEnforced && $authorization->getClient()->isPublic()) {
+            if (true === $this->pkceForPublicClientsEnforced || $authorization->getClient()->isPublic()) {
                 throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, 'Non-confidential clients must set a proof key (PKCE) for code exchange.');
             }
         } else {
             $codeChallengeMethod = array_key_exists('code_challenge_method', $queryParams) ? $queryParams['code_challenge_method'] : 'plain';
             if (!$this->pkceMethodManager->has($codeChallengeMethod)) {
                 throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, sprintf('The challenge method "%s" is not supported.', $codeChallengeMethod));

795) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/AuthorizationCodeTypeHint.php:81    [M] FalseValue

--- Original
+++ New
@@ @@
         if ($token->isRevoked()) {
-            return ['active' => false];
+            return ['active' => true];
         }
         $result = ['active' => !$token->hasExpired(), 'client_id' => $token->getClientId(), 'exp' => $token->getExpiresAt()->getTimestamp()];
         if (!empty($token->getScopes())) {
             $result['scp'] = $token->getScopes();
         }
         return $result;

798) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationCodeGrant/Event/AuthorizationCodeCreatedEvent.php:227    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function getPayload()
+    protected function getPayload()
     {
     }
     /**
      * {@inheritdoc}
      */

803) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AfterConsentScreen/AfterConsentScreenManager.php:29    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function add(AfterConsentScreen $extension)
+    protected function add(AfterConsentScreen $extension)
     {
         $this->extensions[] = $extension;
     }
     /**
      * @param ServerRequestInterface $request
      * @param Authorization          $authorization

804) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AfterConsentScreen/AfterConsentScreenManager.php:42    [M] Foreach_

--- Original
+++ New
@@ @@
     {
-        foreach ($this->extensions as $extension) {
+        foreach (array() as $extension) {
             $authorization = $extension->process($request, $authorization);
         }
         return $authorization;
     }
 }

805) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AfterConsentScreen/AfterConsentScreenManager.php:40    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function process(ServerRequestInterface $request, Authorization $authorization) : Authorization
+    protected function process(ServerRequestInterface $request, Authorization $authorization) : Authorization
     {
         foreach ($this->extensions as $extension) {
             $authorization = $extension->process($request, $authorization);
         }
         return $authorization;
     }

808) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:135    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function hasQueryParam(string $param) : bool
+    protected function hasQueryParam(string $param) : bool
     {
         return array_key_exists($param, $this->queryParameters);
     }
     /**
      * @param string $param
      *

809) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:147    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$this->hasQueryParam($param)) {
+        if ($this->hasQueryParam($param)) {
             throw new \InvalidArgumentException(sprintf('Invalid parameter "%s".', $param));
         }
         return $this->queryParameters[$param];
     }
     /**
      * @return Client

810) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:145    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function getQueryParam(string $param)
+    protected function getQueryParam(string $param)
     {
         if (!$this->hasQueryParam($param)) {
             throw new \InvalidArgumentException(sprintf('Invalid parameter "%s".', $param));
         }
         return $this->queryParameters[$param];
     }

811) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:188    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function withResponseTypes(array $responseTypes) : self
+    protected function withResponseTypes(array $responseTypes) : self
     {
         $clone = clone $this;
         $clone->responseTypes = $responseTypes;
         return $clone;
     }
     /**

812) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:199    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function getResponseTypes() : array
+    protected function getResponseTypes() : array
     {
         return $this->responseTypes;
     }
     /**
      * @param ResponseMode $responseMode
      *

813) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:209    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function withResponseMode(ResponseMode $responseMode) : self
+    protected function withResponseMode(ResponseMode $responseMode) : self
     {
         $clone = clone $this;
         $clone->responseMode = $responseMode;
         return $clone;
     }
     /**

814) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:220    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function getResponseMode() : ?ResponseMode
+    protected function getResponseMode() : ?ResponseMode
     {
         return $this->responseMode;
     }
     /**
      * @param string $redirectUri
      *

815) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:321    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function withResponseHeader(string $responseHeader, $value) : self
+    protected function withResponseHeader(string $responseHeader, $value) : self
     {
         $clone = clone $this;
         $clone->responseHeaders[$responseHeader] = $value;
         return $clone;
     }
     /**

816) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:332    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function getResponseHeaders() : array
+    protected function getResponseHeaders() : array
     {
         return $this->responseHeaders;
     }
     /**
      * @return bool|null
      */

817) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:340    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function isUserAccountFullyAuthenticated() : ?bool
+    protected function isUserAccountFullyAuthenticated() : ?bool
     {
         return $this->userAccountFullyAuthenticated;
     }
     /**
      * @return string[]
      */

818) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:350    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$this->hasQueryParam('prompt')) {
+        if ($this->hasQueryParam('prompt')) {
             return [];
         }
         return explode(' ', $this->getQueryParam('prompt'));
     }
     /**
      * @return bool
