819) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:348    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function getPrompt() : array
+    protected function getPrompt() : array
     {
         if (!$this->hasQueryParam('prompt')) {
             return [];
         }
         return explode(' ', $this->getQueryParam('prompt'));
     }

820) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:360    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function hasUiLocales() : bool
+    protected function hasUiLocales() : bool
     {
         return $this->hasQueryParam('ui_locales');
     }
     /**
      * @return string[]
      */

821) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:368    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function getUiLocales() : array
+    protected function getUiLocales() : array
     {
         return $this->hasQueryParam('ui_locales') ? explode(' ', $this->getQueryParam('ui_locales')) : [];
     }
     /**
      * @param string $prompt
      *

822) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:378    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function hasPrompt(string $prompt) : bool
+    protected function hasPrompt(string $prompt) : bool
     {
         return in_array($prompt, $this->getPrompt());
     }
     /**
      * @param array $scope
      *

823) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:388    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function withScopes(array $scope) : self
+    protected function withScopes(array $scope) : self
     {
         $clone = clone $this;
         $clone->scopes = $scope;
         return $clone;
     }
     /**

824) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:411    [M] NotIdentical

--- Original
+++ New
@@ @@
     {
-        return null !== $this->scopes && in_array($scope, $this->scopes);
+        return null === $this->scopes && in_array($scope, $this->scopes);
     }
     /**
      * @param string $scope
      *
      * @return Authorization
      */

825) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:411    [M] LogicalAnd

--- Original
+++ New
@@ @@
     {
-        return null !== $this->scopes && in_array($scope, $this->scopes);
+        return null !== $this->scopes || in_array($scope, $this->scopes);
     }
     /**
      * @param string $scope
      *
      * @return Authorization
      */

826) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:409    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function hasScope(string $scope) : bool
+    protected function hasScope(string $scope) : bool
     {
         return null !== $this->scopes && in_array($scope, $this->scopes);
     }
     /**
      * @param string $scope
      *

827) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:421    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$this->hasScope($scope)) {
+        if ($this->hasScope($scope)) {
             return $this;
         }
         $clone = clone $this;
         unset($clone->scopes[array_search($scope, $clone->scopes)]);
         return $clone;
     }

828) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:419    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function withoutScope(string $scope) : self
+    protected function withoutScope(string $scope) : self
     {
         if (!$this->hasScope($scope)) {
             return $this;
         }
         $clone = clone $this;
         unset($clone->scopes[array_search($scope, $clone->scopes)]);

829) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:435    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function addScope(string $scope) : self
+    protected function addScope(string $scope) : self
     {
         if ($this->hasScope($scope)) {
             return $this;
         }
         $clone = clone $this;
         $clone->scopes[] = $scope;

830) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:449    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function isAuthorized() : ?bool
+    protected function isAuthorized() : ?bool
     {
         return $this->authorized;
     }
     /**
      * @return Authorization
      */

831) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:460    [M] TrueValue

--- Original
+++ New
@@ @@
         $clone = clone $this;
-        $clone->authorized = true;
+        $clone->authorized = false;
         return $clone;
     }
     /**
      * @return Authorization
      */
     public function deny() : self

832) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:457    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function allow() : self
+    protected function allow() : self
     {
         $clone = clone $this;
         $clone->authorized = true;
         return $clone;
     }
     /**

833) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:471    [M] FalseValue

--- Original
+++ New
@@ @@
         $clone = clone $this;
-        $clone->authorized = false;
+        $clone->authorized = true;
         return $clone;
     }
     /**
      * @param string $key
      *
      * @return bool

834) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:468    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function deny() : self
+    protected function deny() : self
     {
         $clone = clone $this;
         $clone->authorized = false;
         return $clone;
     }
     /**

835) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:481    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function hasData(string $key) : bool
+    protected function hasData(string $key) : bool
     {
         return array_key_exists($key, $this->data);
     }
     /**
      * @param string $key
      *

836) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:493    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$this->hasData($key)) {
+        if ($this->hasData($key)) {
             throw new \InvalidArgumentException(sprintf('Invalid data "%s".', $key));
         }
         return $this->data[$key];
     }
     /**
      * @param string $key

837) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:491    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function getData(string $key)
+    protected function getData(string $key)
     {
         if (!$this->hasData($key)) {
             throw new \InvalidArgumentException(sprintf('Invalid data "%s".', $key));
         }
         return $this->data[$key];
     }

838) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:506    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function withData(string $key, $data) : self
+    protected function withData(string $key, $data) : self
     {
         $clone = clone $this;
         $clone->data[$key] = $data;
         return $clone;
     }
     /**

839) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:527    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function withResourceServer(ResourceServer $resourceServer) : self
+    protected function withResourceServer(ResourceServer $resourceServer) : self
     {
         $clone = clone $this;
         $clone->resourceServer = $resourceServer;
         return $clone;
     }
     /**

840) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:541    [M] LogicalNot

--- Original
+++ New
@@ @@
         // The scope offline_access is not requested
-        if (!in_array('offline_access', $this->getScopes())) {
+        if (in_array('offline_access', $this->getScopes())) {
             return false;
         }
         // The scope offline_access is requested but prompt is not consent
         // The scope offline_access is ignored
         if (!$this->hasQueryParam('prompt') || false === mb_strpos('consent', $this->getQueryParam('prompt'), 0, '8bit')) {
             return false;

841) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:542    [M] FalseValue

--- Original
+++ New
@@ @@
         if (!in_array('offline_access', $this->getScopes())) {
-            return false;
+            return true;
         }
         // The scope offline_access is requested but prompt is not consent
         // The scope offline_access is ignored
         if (!$this->hasQueryParam('prompt') || false === mb_strpos('consent', $this->getQueryParam('prompt'), 0, '8bit')) {
             return false;
         }

842) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:547    [M] LogicalNot

--- Original
+++ New
@@ @@
         // The scope offline_access is ignored
-        if (!$this->hasQueryParam('prompt') || false === mb_strpos('consent', $this->getQueryParam('prompt'), 0, '8bit')) {
+        if ($this->hasQueryParam('prompt') || false === mb_strpos('consent', $this->getQueryParam('prompt'), 0, '8bit')) {
             return false;
         }
         return true;
     }
     /**
      * @param string $option

843) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:547    [M] FalseValue

--- Original
+++ New
@@ @@
         // The scope offline_access is ignored
-        if (!$this->hasQueryParam('prompt') || false === mb_strpos('consent', $this->getQueryParam('prompt'), 0, '8bit')) {
+        if (!$this->hasQueryParam('prompt') || true === mb_strpos('consent', $this->getQueryParam('prompt'), 0, '8bit')) {
             return false;
         }
         return true;
     }
     /**
      * @param string $option

844) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:547    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         // The scope offline_access is ignored
-        if (!$this->hasQueryParam('prompt') || false === mb_strpos('consent', $this->getQueryParam('prompt'), 0, '8bit')) {
+        if (!$this->hasQueryParam('prompt') || false === mb_strpos('consent', $this->getQueryParam('prompt'), 1, '8bit')) {
             return false;
         }
         return true;
     }
     /**
      * @param string $option

845) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:547    [M] Identical

--- Original
+++ New
@@ @@
         // The scope offline_access is ignored
-        if (!$this->hasQueryParam('prompt') || false === mb_strpos('consent', $this->getQueryParam('prompt'), 0, '8bit')) {
+        if (!$this->hasQueryParam('prompt') || false !== mb_strpos('consent', $this->getQueryParam('prompt'), 0, '8bit')) {
             return false;
         }
         return true;
     }
     /**
      * @param string $option

846) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:547    [M] LogicalOr

--- Original
+++ New
@@ @@
         // The scope offline_access is ignored
-        if (!$this->hasQueryParam('prompt') || false === mb_strpos('consent', $this->getQueryParam('prompt'), 0, '8bit')) {
+        if (!$this->hasQueryParam('prompt') && false === mb_strpos('consent', $this->getQueryParam('prompt'), 0, '8bit')) {
             return false;
         }
         return true;
     }
     /**
      * @param string $option

847) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:548    [M] FalseValue

--- Original
+++ New
@@ @@
         if (!$this->hasQueryParam('prompt') || false === mb_strpos('consent', $this->getQueryParam('prompt'), 0, '8bit')) {
-            return false;
+            return true;
         }
         return true;
     }
     /**
      * @param string $option
      * @param mixed  $value

849) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:538    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function hasOfflineAccess() : bool
+    protected function hasOfflineAccess() : bool
     {
         // The scope offline_access is not requested
         if (!in_array('offline_access', $this->getScopes())) {
             return false;
         }
         // The scope offline_access is requested but prompt is not consent

850) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:560    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function withConsentScreenOption(string $option, $value) : self
+    protected function withConsentScreenOption(string $option, $value) : self
     {
         $clone = clone $this;
         $clone->consentScreenOptions[$option] = $value;
         return $clone;
     }
     /**

851) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:575    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!array_key_exists($option, $this->consentScreenOptions)) {
+        if (array_key_exists($option, $this->consentScreenOptions)) {
             return $this;
         }
         $clone = clone $this;
         unset($clone->consentScreenOptions[$option]);
         return $clone;
     }

852) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Authorization.php:573    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function withoutConsentScreenOption(string $option) : self
+    protected function withoutConsentScreenOption(string $option) : self
     {
         if (!array_key_exists($option, $this->consentScreenOptions)) {
             return $this;
         }
         $clone = clone $this;
         unset($clone->consentScreenOptions[$option]);

853) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationEndpoint.php:88    [M] Identical

--- Original
+++ New
@@ @@
             $authorization = $this->userAccountDiscoveryManager->find($request, $authorization);
-            if (null === $authorization->getUserAccount()) {
+            if (null !== $authorization->getUserAccount()) {
                 return $this->redirectToLoginPage($authorization, $request);
             }
             $authorization = $this->beforeConsentScreenManager->process($request, $authorization);
             return $this->processConsentScreen($request, $authorization);
         } catch (OAuth2Exception $e) {
             $data = $e->getData();

854) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationEndpoint.php:97    [M] NotIdentical

--- Original
+++ New
@@ @@
             $data = $e->getData();
-            if (null !== $e->getAuthorization()) {
+            if (null === $e->getAuthorization()) {
                 $redirectUri = $e->getAuthorization()->getRedirectUri();
                 $responseMode = $e->getAuthorization()->getResponseMode();
                 if (null !== $redirectUri && null !== $responseMode) {
                     $data['redirect_uri'] = $redirectUri;
                     $data['response_mode'] = $responseMode;
                     throw new OAuth2Exception(302, $data, $e->getAuthorization(), $e);

855) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationEndpoint.php:100    [M] NotIdentical

--- Original
+++ New
@@ @@
                 $responseMode = $e->getAuthorization()->getResponseMode();
-                if (null !== $redirectUri && null !== $responseMode) {
+                if (null === $redirectUri && null !== $responseMode) {
                     $data['redirect_uri'] = $redirectUri;
                     $data['response_mode'] = $responseMode;
                     throw new OAuth2Exception(302, $data, $e->getAuthorization(), $e);
                 }
             }
             throw $e;

856) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationEndpoint.php:100    [M] NotIdentical

--- Original
+++ New
@@ @@
                 $responseMode = $e->getAuthorization()->getResponseMode();
-                if (null !== $redirectUri && null !== $responseMode) {
+                if (null !== $redirectUri && null === $responseMode) {
                     $data['redirect_uri'] = $redirectUri;
                     $data['response_mode'] = $responseMode;
                     throw new OAuth2Exception(302, $data, $e->getAuthorization(), $e);
                 }
             }
             throw $e;

857) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationEndpoint.php:100    [M] LogicalAnd

--- Original
+++ New
@@ @@
                 $responseMode = $e->getAuthorization()->getResponseMode();
-                if (null !== $redirectUri && null !== $responseMode) {
+                if (null !== $redirectUri || null !== $responseMode) {
                     $data['redirect_uri'] = $redirectUri;
                     $data['response_mode'] = $responseMode;
                     throw new OAuth2Exception(302, $data, $e->getAuthorization(), $e);
                 }
             }
             throw $e;

858) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationEndpoint.php:112    [M] FalseValue

--- Original
+++ New
@@ @@
             $authorization = $this->afterConsentScreenManager->process($request, $authorization);
-            if (false === $authorization->isAuthorized()) {
+            if (true === $authorization->isAuthorized()) {
                 $this->throwRedirectionException($authorization, OAuth2Exception::ERROR_ACCESS_DENIED, 'The resource owner denied access to your client.');
             }
             $responseTypeProcessor = ResponseTypeProcessor::create($authorization);
             try {
                 $authorization = $responseTypeProcessor->process();
             } catch (OAuth2Exception $e) {

859) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationEndpoint.php:112    [M] Identical

--- Original
+++ New
@@ @@
             $authorization = $this->afterConsentScreenManager->process($request, $authorization);
-            if (false === $authorization->isAuthorized()) {
+            if (false !== $authorization->isAuthorized()) {
                 $this->throwRedirectionException($authorization, OAuth2Exception::ERROR_ACCESS_DENIED, 'The resource owner denied access to your client.');
             }
             $responseTypeProcessor = ResponseTypeProcessor::create($authorization);
             try {
                 $authorization = $responseTypeProcessor->process();
             } catch (OAuth2Exception $e) {

861) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationEndpoint.php:143    [M] Identical

--- Original
+++ New
@@ @@
     {
-        if (null === $authorization->getResponseMode() || null === $authorization->getRedirectUri()) {
+        if (null !== $authorization->getResponseMode() || null === $authorization->getRedirectUri()) {
             throw new OAuth2Exception(400, ['error' => 'EEE', 'error_description' => 'FFF']);
         }
         $response = $authorization->getResponseMode()->buildResponse($authorization->getRedirectUri(), $authorization->getResponseParameters());
         foreach ($authorization->getResponseHeaders() as $k => $v) {
             $response = $response->withHeader($k, $v);
         }

862) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationEndpoint.php:143    [M] Identical

--- Original
+++ New
@@ @@
     {
-        if (null === $authorization->getResponseMode() || null === $authorization->getRedirectUri()) {
+        if (null === $authorization->getResponseMode() || null !== $authorization->getRedirectUri()) {
             throw new OAuth2Exception(400, ['error' => 'EEE', 'error_description' => 'FFF']);
         }
         $response = $authorization->getResponseMode()->buildResponse($authorization->getRedirectUri(), $authorization->getResponseParameters());
         foreach ($authorization->getResponseHeaders() as $k => $v) {
             $response = $response->withHeader($k, $v);
         }

863) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationEndpoint.php:143    [M] LogicalOr

--- Original
+++ New
@@ @@
     {
-        if (null === $authorization->getResponseMode() || null === $authorization->getRedirectUri()) {
+        if (null === $authorization->getResponseMode() && null === $authorization->getRedirectUri()) {
             throw new OAuth2Exception(400, ['error' => 'EEE', 'error_description' => 'FFF']);
         }
         $response = $authorization->getResponseMode()->buildResponse($authorization->getRedirectUri(), $authorization->getResponseParameters());
         foreach ($authorization->getResponseHeaders() as $k => $v) {
             $response = $response->withHeader($k, $v);
         }

864) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationEndpoint.php:151    [M] Foreach_

--- Original
+++ New
@@ @@
         $response = $authorization->getResponseMode()->buildResponse($authorization->getRedirectUri(), $authorization->getResponseParameters());
-        foreach ($authorization->getResponseHeaders() as $k => $v) {
+        foreach (array() as $k => $v) {
             $response = $response->withHeader($k, $v);
         }
         return $response;
     }
     /**
      * @param Authorization $authorization

865) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationEndpoint.php:168    [M] Identical

--- Original
+++ New
@@ @@
         $params = $authorization->getResponseParameters();
-        if (null === $authorization->getResponseMode() || null === $authorization->getRedirectUri()) {
+        if (null !== $authorization->getResponseMode() || null === $authorization->getRedirectUri()) {
             throw new OAuth2Exception(400, $error, $error_description, $params);
         }
         $params += ['response_mode' => $authorization->getResponseMode(), 'redirect_uri' => $authorization->getRedirectUri()];
         throw new OAuth2Exception(302, $error, $error_description, $params);
     }
 }

866) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationEndpoint.php:168    [M] Identical

--- Original
+++ New
@@ @@
         $params = $authorization->getResponseParameters();
-        if (null === $authorization->getResponseMode() || null === $authorization->getRedirectUri()) {
+        if (null === $authorization->getResponseMode() || null !== $authorization->getRedirectUri()) {
             throw new OAuth2Exception(400, $error, $error_description, $params);
         }
         $params += ['response_mode' => $authorization->getResponseMode(), 'redirect_uri' => $authorization->getRedirectUri()];
         throw new OAuth2Exception(302, $error, $error_description, $params);
     }
 }

867) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationEndpoint.php:168    [M] LogicalOr

--- Original
+++ New
@@ @@
         $params = $authorization->getResponseParameters();
-        if (null === $authorization->getResponseMode() || null === $authorization->getRedirectUri()) {
+        if (null === $authorization->getResponseMode() && null === $authorization->getRedirectUri()) {
             throw new OAuth2Exception(400, $error, $error_description, $params);
         }
         $params += ['response_mode' => $authorization->getResponseMode(), 'redirect_uri' => $authorization->getRedirectUri()];
         throw new OAuth2Exception(302, $error, $error_description, $params);
     }
 }

868) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationEndpoint.php:171    [M] PlusEqual

--- Original
+++ New
@@ @@
         }
-        $params += ['response_mode' => $authorization->getResponseMode(), 'redirect_uri' => $authorization->getRedirectUri()];
+        $params -= ['response_mode' => $authorization->getResponseMode(), 'redirect_uri' => $authorization->getRedirectUri()];
         throw new OAuth2Exception(302, $error, $error_description, $params);
     }
 }

869) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationFactory.php:48    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function createAuthorizationFromRequest(ServerRequestInterface $request) : Authorization
+    protected function createAuthorizationFromRequest(ServerRequestInterface $request) : Authorization
     {
         list($client, $queryParameters) = $this->authorizationRequestLoader->loadParametersFromRequest($request);
         $authorization = Authorization::create($client, $queryParameters);
         $authorization = $this->parameterCheckerManager->process($authorization);
         return $authorization;
     }

870) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationRequestLoader.php:99    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function isRequestUriRegistrationRequired() : bool
+    protected function isRequestUriRegistrationRequired() : bool
     {
         return $this->requireRequestUriRegistration;
     }
     /**
      * @return bool
      */

871) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationRequestLoader.php:107    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function isRequestObjectSupportEnabled() : bool
+    protected function isRequestObjectSupportEnabled() : bool
     {
         return $this->requestObjectAllowed;
     }
     /**
      * @return bool
      */

872) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationRequestLoader.php:115    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function isRequestObjectReferenceSupportEnabled() : bool
+    protected function isRequestObjectReferenceSupportEnabled() : bool
     {
         return $this->requestObjectReferenceAllowed;
     }
     /**
      * @return string[]
      */

873) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationRequestLoader.php:125    [M] Identical

--- Original
+++ New
@@ @@
     {
-        return null === $this->jwsLoader ? [] : $this->jwsLoader->getSignatureAlgorithmManager()->list();
+        return null !== $this->jwsLoader ? [] : $this->jwsLoader->getSignatureAlgorithmManager()->list();
     }
     /**
      * @return string[]
      */
     public function getSupportedKeyEncryptionAlgorithms() : array
     {

874) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationRequestLoader.php:123    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function getSupportedSignatureAlgorithms() : array
+    protected function getSupportedSignatureAlgorithms() : array
     {
         return null === $this->jwsLoader ? [] : $this->jwsLoader->getSignatureAlgorithmManager()->list();
     }
     /**
      * @return string[]
      */

875) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationRequestLoader.php:133    [M] Identical

--- Original
+++ New
@@ @@
     {
-        return null === $this->jweLoader ? [] : $this->jweLoader->getKeyEncryptionAlgorithmManager()->list();
+        return null !== $this->jweLoader ? [] : $this->jweLoader->getKeyEncryptionAlgorithmManager()->list();
     }
     /**
      * @return string[]
      */
     public function getSupportedContentEncryptionAlgorithms() : array
     {
