876) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationRequestLoader.php:131    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function getSupportedKeyEncryptionAlgorithms() : array
+    protected function getSupportedKeyEncryptionAlgorithms() : array
     {
         return null === $this->jweLoader ? [] : $this->jweLoader->getKeyEncryptionAlgorithmManager()->list();
     }
     /**
      * @return string[]
      */

877) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationRequestLoader.php:141    [M] Identical

--- Original
+++ New
@@ @@
     {
-        return null === $this->jweLoader ? [] : $this->jweLoader->getContentEncryptionAlgorithmManager()->list();
+        return null !== $this->jweLoader ? [] : $this->jweLoader->getContentEncryptionAlgorithmManager()->list();
     }
     /**
      * @param JWSLoader           $jwsLoader
      * @param ClaimCheckerManager $claimCheckerManager
      * @param string[]            $mandatoryClaims
      */

878) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationRequestLoader.php:139    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function getSupportedContentEncryptionAlgorithms() : array
+    protected function getSupportedContentEncryptionAlgorithms() : array
     {
         return null === $this->jweLoader ? [] : $this->jweLoader->getContentEncryptionAlgorithmManager()->list();
     }
     /**
      * @param JWSLoader           $jwsLoader
      * @param ClaimCheckerManager $claimCheckerManager

879) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationRequestLoader.php:154    [M] TrueValue

--- Original
+++ New
@@ @@
         $this->claimCheckerManager = $claimCheckerManager;
-        $this->requestObjectAllowed = true;
+        $this->requestObjectAllowed = false;
         $this->mandatoryClaims = $mandatoryClaims;
     }
     /**
      * @param HttpClient $client
      * @param bool       $requireRequestUriRegistration
      */

880) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationRequestLoader.php:149    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function enableRequestObjectSupport(JWSLoader $jwsLoader, ClaimCheckerManager $claimCheckerManager, array $mandatoryClaims = [])
+    protected function enableRequestObjectSupport(JWSLoader $jwsLoader, ClaimCheckerManager $claimCheckerManager, array $mandatoryClaims = [])
     {
         Assertion::allString($mandatoryClaims, 'The mandatory claims array should contain only claims.');
         $this->jwsLoader = $jwsLoader;
         $this->claimCheckerManager = $claimCheckerManager;
         $this->requestObjectAllowed = true;
         $this->mandatoryClaims = $mandatoryClaims;

881) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationRequestLoader.php:165    [M] TrueValue

--- Original
+++ New
@@ @@
         Assertion::true($this->isRequestObjectSupportEnabled(), 'Request object support must be enabled first.');
-        $this->requestObjectReferenceAllowed = true;
+        $this->requestObjectReferenceAllowed = false;
         $this->requireRequestUriRegistration = $requireRequestUriRegistration;
         $this->client = $client;
     }
     /**
      * @param JWELoader $jweLoader
      * @param JWKSet    $keyEncryptionKeySet

882) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationRequestLoader.php:162    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function enableRequestObjectReferenceSupport(HttpClient $client, bool $requireRequestUriRegistration)
+    protected function enableRequestObjectReferenceSupport(HttpClient $client, bool $requireRequestUriRegistration)
     {
         Assertion::true($this->isRequestObjectSupportEnabled(), 'Request object support must be enabled first.');
         $this->requestObjectReferenceAllowed = true;
         $this->requireRequestUriRegistration = $requireRequestUriRegistration;
         $this->client = $client;
     }

883) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationRequestLoader.php:178    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         Assertion::true($this->isRequestObjectSupportEnabled(), 'Request object support must be enabled first.');
-        Assertion::greaterThan($keyEncryptionKeySet->count(), 0, 'The encryption key set must have at least one key.');
+        Assertion::greaterThan($keyEncryptionKeySet->count(), 1, 'The encryption key set must have at least one key.');
         $this->jweLoader = $jweLoader;
         $this->requireEncryption = $requireEncryption;
         $this->keyEncryptionKeySet = $keyEncryptionKeySet;
     }
     /**
      * @return bool

884) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationRequestLoader.php:175    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function enableEncryptedRequestObjectSupport(JWELoader $jweLoader, JWKSet $keyEncryptionKeySet, bool $requireEncryption)
+    protected function enableEncryptedRequestObjectSupport(JWELoader $jweLoader, JWKSet $keyEncryptionKeySet, bool $requireEncryption)
     {
         Assertion::true($this->isRequestObjectSupportEnabled(), 'Request object support must be enabled first.');
         Assertion::greaterThan($keyEncryptionKeySet->count(), 0, 'The encryption key set must have at least one key.');
         $this->jweLoader = $jweLoader;
         $this->requireEncryption = $requireEncryption;
         $this->keyEncryptionKeySet = $keyEncryptionKeySet;

885) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationRequestLoader.php:189    [M] NotIdentical

--- Original
+++ New
@@ @@
     {
-        return null !== $this->keyEncryptionKeySet;
+        return null === $this->keyEncryptionKeySet;
     }
     /**
      * @param ServerRequestInterface $request
      *
      * @return array
      */

886) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationRequestLoader.php:187    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function isEncryptedRequestsSupportEnabled() : bool
+    protected function isEncryptedRequestsSupportEnabled() : bool
     {
         return null !== $this->keyEncryptionKeySet;
     }
     /**
      * @param ServerRequestInterface $request
      *

887) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationRequestLoader.php:197    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function loadParametersFromRequest(ServerRequestInterface $request) : array
+    protected function loadParametersFromRequest(ServerRequestInterface $request) : array
     {
         $params = $request->getQueryParams();
         if (array_key_exists('request', $params)) {
             $params = $this->createFromRequestParameter($params);
         } elseif (array_key_exists('request_uri', $params)) {
             $params = $this->createFromRequestUriParameter($params);

888) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationRequestLoader.php:223    [M] FalseValue

--- Original
+++ New
@@ @@
     {
-        if (false === $this->isRequestObjectSupportEnabled()) {
+        if (true === $this->isRequestObjectSupportEnabled()) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_REQUEST_NOT_SUPPORTED, 'The parameter "request" is not supported.');
         }
         $request = $params['request'];
         Assertion::string($request);
         $jws = $this->loadRequest($params, $request, $client);
         $claims = json_decode($jws->getPayload(), true);

889) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationRequestLoader.php:223    [M] Identical

--- Original
+++ New
@@ @@
     {
-        if (false === $this->isRequestObjectSupportEnabled()) {
+        if (false !== $this->isRequestObjectSupportEnabled()) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_REQUEST_NOT_SUPPORTED, 'The parameter "request" is not supported.');
         }
         $request = $params['request'];
         Assertion::string($request);
         $jws = $this->loadRequest($params, $request, $client);
         $claims = json_decode($jws->getPayload(), true);

890) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationRequestLoader.php:230    [M] TrueValue

--- Original
+++ New
@@ @@
         $jws = $this->loadRequest($params, $request, $client);
-        $claims = json_decode($jws->getPayload(), true);
+        $claims = json_decode($jws->getPayload(), false);
         $params = array_merge($params, $claims, ['client' => $client]);
         $this->checkIssuerAndClientId($params);
         return $params;
     }
     /**
      * @param array $params

891) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationRequestLoader.php:258    [M] FalseValue

--- Original
+++ New
@@ @@
     {
-        if (false === $this->isRequestObjectReferenceSupportEnabled()) {
+        if (true === $this->isRequestObjectReferenceSupportEnabled()) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_REQUEST_URI_NOT_SUPPORTED, 'The parameter "request_uri" is not supported.');
         }
         $requestUri = $params['request_uri'];
         $content = $this->downloadContent($requestUri);
         $jws = $this->loadRequest($params, $content, $client);
         if (true === $this->isRequestUriRegistrationRequired()) {

892) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationRequestLoader.php:258    [M] Identical

--- Original
+++ New
@@ @@
     {
-        if (false === $this->isRequestObjectReferenceSupportEnabled()) {
+        if (false !== $this->isRequestObjectReferenceSupportEnabled()) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_REQUEST_URI_NOT_SUPPORTED, 'The parameter "request_uri" is not supported.');
         }
         $requestUri = $params['request_uri'];
         $content = $this->downloadContent($requestUri);
         $jws = $this->loadRequest($params, $content, $client);
         if (true === $this->isRequestUriRegistrationRequired()) {

893) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationRequestLoader.php:265    [M] TrueValue

--- Original
+++ New
@@ @@
         $jws = $this->loadRequest($params, $content, $client);
-        if (true === $this->isRequestUriRegistrationRequired()) {
+        if (false === $this->isRequestUriRegistrationRequired()) {
             $this->checkRequestUri($client, $requestUri);
         }
         $claims = json_decode($jws->getPayload(), true);
         $params = array_merge($params, $claims, ['client' => $client]);
         $this->checkIssuerAndClientId($params);
         return $params;

894) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationRequestLoader.php:265    [M] Identical

--- Original
+++ New
@@ @@
         $jws = $this->loadRequest($params, $content, $client);
-        if (true === $this->isRequestUriRegistrationRequired()) {
+        if (true !== $this->isRequestUriRegistrationRequired()) {
             $this->checkRequestUri($client, $requestUri);
         }
         $claims = json_decode($jws->getPayload(), true);
         $params = array_merge($params, $claims, ['client' => $client]);
         $this->checkIssuerAndClientId($params);
         return $params;

896) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationRequestLoader.php:282    [M] LogicalAnd

--- Original
+++ New
@@ @@
     {
-        if (array_key_exists('iss', $params) && array_key_exists('client_id', $params)) {
+        if (array_key_exists('iss', $params) || array_key_exists('client_id', $params)) {
             Assertion::eq($params['iss'], $params['client_id'], 'The issuer of the request object is not the client who requests the authorization.');
         }
     }
     /**
      * @param Client $client
      * @param string $requestUri

897) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationRequestLoader.php:299    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         foreach ($stored_request_uris as $stored_request_uri) {
-            if (0 === strcasecmp(mb_substr($requestUri, 0, mb_strlen($stored_request_uri, '8bit'), '8bit'), $stored_request_uri)) {
+            if (1 === strcasecmp(mb_substr($requestUri, 0, mb_strlen($stored_request_uri, '8bit'), '8bit'), $stored_request_uri)) {
                 return;
             }
         }
         throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST_URI, 'The request Uri is not allowed.');
     }
     /**

898) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationRequestLoader.php:299    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         foreach ($stored_request_uris as $stored_request_uri) {
-            if (0 === strcasecmp(mb_substr($requestUri, 0, mb_strlen($stored_request_uri, '8bit'), '8bit'), $stored_request_uri)) {
+            if (0 === strcasecmp(mb_substr($requestUri, 1, mb_strlen($stored_request_uri, '8bit'), '8bit'), $stored_request_uri)) {
                 return;
             }
         }
         throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST_URI, 'The request Uri is not allowed.');
     }
     /**

899) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationRequestLoader.php:299    [M] Identical

--- Original
+++ New
@@ @@
         foreach ($stored_request_uris as $stored_request_uri) {
-            if (0 === strcasecmp(mb_substr($requestUri, 0, mb_strlen($stored_request_uri, '8bit'), '8bit'), $stored_request_uri)) {
+            if (0 !== strcasecmp(mb_substr($requestUri, 0, mb_strlen($stored_request_uri, '8bit'), '8bit'), $stored_request_uri)) {
                 return;
             }
         }
         throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST_URI, 'The request Uri is not allowed.');
     }
     /**

900) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationRequestLoader.php:298    [M] Foreach_

--- Original
+++ New
@@ @@
         $stored_request_uris = $this->getClientRequestUris($client);
-        foreach ($stored_request_uris as $stored_request_uri) {
+        foreach (array() as $stored_request_uri) {
             if (0 === strcasecmp(mb_substr($requestUri, 0, mb_strlen($stored_request_uri, '8bit'), '8bit'), $stored_request_uri)) {
                 return;
             }
         }
         throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST_URI, 'The request Uri is not allowed.');
     }

901) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationRequestLoader.php:314    [M] FalseValue

--- Original
+++ New
@@ @@
     {
-        if (false === Uri::checkUrl($requestUri, false)) {
+        if (true === Uri::checkUrl($requestUri, false)) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_CLIENT, 'The request Uri must not contain path traversal.');
         }
     }
     /**
      * @param Client $client
      *

902) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationRequestLoader.php:314    [M] FalseValue

--- Original
+++ New
@@ @@
     {
-        if (false === Uri::checkUrl($requestUri, false)) {
+        if (false === Uri::checkUrl($requestUri, true)) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_CLIENT, 'The request Uri must not contain path traversal.');
         }
     }
     /**
      * @param Client $client
      *

903) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationRequestLoader.php:314    [M] Identical

--- Original
+++ New
@@ @@
     {
-        if (false === Uri::checkUrl($requestUri, false)) {
+        if (false !== Uri::checkUrl($requestUri, false)) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_CLIENT, 'The request Uri must not contain path traversal.');
         }
     }
     /**
      * @param Client $client
      *

904) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationRequestLoader.php:328    [M] FalseValue

--- Original
+++ New
@@ @@
     {
-        if (false === $client->has('request_uris') || empty($requestUris = $client->get('request_uris'))) {
+        if (true === $client->has('request_uris') || empty($requestUris = $client->get('request_uris'))) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_CLIENT, 'The client must register at least one request Uri.');
         }
         return $requestUris;
     }
     /**
      * @param array       $params

905) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationRequestLoader.php:328    [M] Identical

--- Original
+++ New
@@ @@
     {
-        if (false === $client->has('request_uris') || empty($requestUris = $client->get('request_uris'))) {
+        if (false !== $client->has('request_uris') || empty($requestUris = $client->get('request_uris'))) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_CLIENT, 'The client must register at least one request Uri.');
         }
         return $requestUris;
     }
     /**
      * @param array       $params

906) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationRequestLoader.php:328    [M] LogicalOr

--- Original
+++ New
@@ @@
     {
-        if (false === $client->has('request_uris') || empty($requestUris = $client->get('request_uris'))) {
+        if (false === $client->has('request_uris') && empty($requestUris = $client->get('request_uris'))) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_CLIENT, 'The client must register at least one request Uri.');
         }
         return $requestUris;
     }
     /**
      * @param array       $params

907) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationRequestLoader.php:351    [M] TrueValue

--- Original
+++ New
@@ @@
             $this->claimCheckerManager->check($jwt);
-            $claims = json_decode($jwt->getPayload(), true);
+            $claims = json_decode($jwt->getPayload(), false);
             $client = $this->getClient(array_merge($params, $claims));
             $public_key_set = $client->getPublicKeySet();
             Assertion::notNull($public_key_set, 'The client does not have signature capabilities.');
             $index = $this->jwsLoader->verifyWithKeySet($jwt, $public_key_set);
             $this->checkAlgorithms($jwt, $index, $client);
             $missing_claims = array_keys(array_diff_key(array_flip($this->mandatoryClaims), $claims));

908) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationRequestLoader.php:359    [M] OneZeroInteger

--- Original
+++ New
@@ @@
             $missing_claims = array_keys(array_diff_key(array_flip($this->mandatoryClaims), $claims));
-            Assertion::true(0 === count($missing_claims), 'The following mandatory claims are missing: %s.', implode(', ', $missing_claims));
+            Assertion::true(1 === count($missing_claims), 'The following mandatory claims are missing: %s.', implode(', ', $missing_claims));
         } catch (\Exception $e) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST_OBJECT, $e->getMessage());
         }
         return $jwt;
     }
     /**

909) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationRequestLoader.php:359    [M] Identical

--- Original
+++ New
@@ @@
             $missing_claims = array_keys(array_diff_key(array_flip($this->mandatoryClaims), $claims));
-            Assertion::true(0 === count($missing_claims), 'The following mandatory claims are missing: %s.', implode(', ', $missing_claims));
+            Assertion::true(0 !== count($missing_claims), 'The following mandatory claims are missing: %s.', implode(', ', $missing_claims));
         } catch (\Exception $e) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST_OBJECT, $e->getMessage());
         }
         return $jwt;
     }
     /**

910) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationRequestLoader.php:376    [M] Identical

--- Original
+++ New
@@ @@
     {
-        if (null === $this->jweLoader) {
+        if (null !== $this->jweLoader) {
             return $request;
         }
         try {
             $jwe = $this->jweLoader->load($request);
             $jwe = $this->jweLoader->decryptUsingKeySet($jwe, $this->keyEncryptionKeySet);
             return $jwe->getPayload();

911) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationRequestLoader.php:386    [M] TrueValue

--- Original
+++ New
@@ @@
         } catch (\Exception $e) {
-            if (true === $this->requireEncryption) {
+            if (false === $this->requireEncryption) {
                 throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST_OBJECT, $e->getMessage());
             }
             return $request;
         }
     }
     /**

912) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationRequestLoader.php:386    [M] Identical

--- Original
+++ New
@@ @@
         } catch (\Exception $e) {
-            if (true === $this->requireEncryption) {
+            if (true !== $this->requireEncryption) {
                 throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST_OBJECT, $e->getMessage());
             }
             return $request;
         }
     }
     /**

913) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationRequestLoader.php:419    [M] LogicalNot

--- Original
+++ New
@@ @@
         $content = $response->getBody()->getContents();
-        if (!is_string($content)) {
+        if (is_string($content)) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST_URI, 'Unable to get content.');
         }
         return $content;
     }
     /**
      * @param array $params

914) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationRequestLoader.php:436    [M] LogicalNot

--- Original
+++ New
@@ @@
         $client = array_key_exists('client_id', $params) ? $this->clientRepository->find(ClientId::create($params['client_id'])) : null;
-        if (!$client instanceof Client || true === $client->isDeleted()) {
+        if ($client instanceof Client || true === $client->isDeleted()) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, 'Parameter "client_id" missing or invalid.');
         }
         return $client;
     }
 }

915) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationRequestLoader.php:436    [M] TrueValue

--- Original
+++ New
@@ @@
         $client = array_key_exists('client_id', $params) ? $this->clientRepository->find(ClientId::create($params['client_id'])) : null;
-        if (!$client instanceof Client || true === $client->isDeleted()) {
+        if (!$client instanceof Client || false === $client->isDeleted()) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, 'Parameter "client_id" missing or invalid.');
         }
         return $client;
     }
 }

916) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationRequestLoader.php:436    [M] Identical

--- Original
+++ New
@@ @@
         $client = array_key_exists('client_id', $params) ? $this->clientRepository->find(ClientId::create($params['client_id'])) : null;
-        if (!$client instanceof Client || true === $client->isDeleted()) {
+        if (!$client instanceof Client || true !== $client->isDeleted()) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, 'Parameter "client_id" missing or invalid.');
         }
         return $client;
     }
 }

917) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/AuthorizationRequestLoader.php:436    [M] LogicalOr

--- Original
+++ New
@@ @@
         $client = array_key_exists('client_id', $params) ? $this->clientRepository->find(ClientId::create($params['client_id'])) : null;
-        if (!$client instanceof Client || true === $client->isDeleted()) {
+        if (!$client instanceof Client && true === $client->isDeleted()) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, 'Parameter "client_id" missing or invalid.');
         }
         return $client;
     }
 }

918) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/BeforeConsentScreen/BeforeConsentScreenManager.php:29    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function add(BeforeConsentScreen $extension)
+    protected function add(BeforeConsentScreen $extension)
     {
         $this->extensions[] = $extension;
     }
     /**
      * @param ServerRequestInterface $request
      * @param Authorization          $authorization

921) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/BeforeConsentScreen/PreConfiguredAuthorizationExtension.php:48    [M] NotIdentical

--- Original
+++ New
@@ @@
         $preConfiguredAuthorization = $this->findPreConfiguredAuthorization($authorization);
-        if (null !== $preConfiguredAuthorization) {
+        if (null === $preConfiguredAuthorization) {
             if ($authorization->hasPrompt('consent')) {
                 throw new ShowConsentScreenException($authorization);
             }
             $authorization = $authorization->allow();
             throw new ProcessAuthorizationException($authorization);
         } else {

923) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/BeforeConsentScreen/PreConfiguredAuthorizationExtension.php:72    [M] NotIdentical

--- Original
+++ New
@@ @@
     {
-        if (null !== $this->preConfiguredAuthorizationRepository) {
+        if (null === $this->preConfiguredAuthorizationRepository) {
             return $this->preConfiguredAuthorizationRepository->find($authorization->getUserAccount()->getPublicId(), $authorization->getClient()->getPublicId(), $authorization->getScopes(), $authorization->getResourceServer() ? $authorization->getResourceServer()->getResourceServerId() : null);
         }
     }
 }

924) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Command/CreatePreConfiguredAuthorizationCommand.php:57    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
      */
-    protected function __construct(PreConfiguredAuthorizationId $preConfiguredAuthorizationId, ClientId $clientId, UserAccountId $userAccountId, array $scopes, ?ResourceServerId $resourceServerId)
+    private function __construct(PreConfiguredAuthorizationId $preConfiguredAuthorizationId, ClientId $clientId, UserAccountId $userAccountId, array $scopes, ?ResourceServerId $resourceServerId)
     {
         $this->preConfiguredAuthorizationId = $preConfiguredAuthorizationId;
         $this->clientId = $clientId;
         $this->userAccountId = $userAccountId;
         $this->resourceServerId = $resourceServerId;
         $this->scopes = $scopes;

925) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Command/CreatePreConfiguredAuthorizationCommand.php:75    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public static function create(PreConfiguredAuthorizationId $preConfiguredAuthorizationId, ClientId $clientId, UserAccountId $userAccountId, array $scopes, ?ResourceServerId $resourceServerId) : self
+    protected static function create(PreConfiguredAuthorizationId $preConfiguredAuthorizationId, ClientId $clientId, UserAccountId $userAccountId, array $scopes, ?ResourceServerId $resourceServerId) : self
     {
         return new self($preConfiguredAuthorizationId, $clientId, $userAccountId, $scopes, $resourceServerId);
     }
     /**
      * @return PreConfiguredAuthorizationId
      */
