926) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Command/CreatePreConfiguredAuthorizationCommand.php:83    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function getPreConfiguredAuthorizationId() : PreConfiguredAuthorizationId
+    protected function getPreConfiguredAuthorizationId() : PreConfiguredAuthorizationId
     {
         return $this->preConfiguredAuthorizationId;
     }
     /**
      * @return UserAccountId
      */

931) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Command/CreatePreConfiguredAuthorizationCommandHandler.php:38    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function handle(CreatePreConfiguredAuthorizationCommand $command)
+    protected function handle(CreatePreConfiguredAuthorizationCommand $command)
     {
         $PreConfiguredAuthorization = $this->preConfiguredAuthorizationRepository->create($command->getUserAccountId(), $command->getClientId(), $command->getScopes(), $command->getResourceServerId());
         $this->preConfiguredAuthorizationRepository->save($PreConfiguredAuthorization);
     }
 }

932) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Command/RevokePreConfiguredAuthorizationCommand.php:50    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
      */
-    protected function __construct(ClientId $clientId, UserAccountId $userAccountId, array $scopes, ?ResourceServerId $resourceServerId)
+    private function __construct(ClientId $clientId, UserAccountId $userAccountId, array $scopes, ?ResourceServerId $resourceServerId)
     {
         $this->clientId = $clientId;
         $this->userAccountId = $userAccountId;
         $this->resourceServerId = $resourceServerId;
         $this->scopes = $scopes;
     }

933) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Command/RevokePreConfiguredAuthorizationCommand.php:66    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public static function create(ClientId $clientId, UserAccountId $userAccountId, array $scopes, ?ResourceServerId $resourceServerId) : self
+    protected static function create(ClientId $clientId, UserAccountId $userAccountId, array $scopes, ?ResourceServerId $resourceServerId) : self
     {
         return new self($clientId, $userAccountId, $scopes, $resourceServerId);
     }
     /**
      * @return UserAccountId
      */

938) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Command/RevokePreConfiguredAuthorizationCommandHandler.php:47    [M] NotIdentical

--- Original
+++ New
@@ @@
         $preConfiguredAuthorization = $this->preConfiguredAuthorizationRepository->find($command->getUserAccountId(), $command->getClientId(), $command->getScopes(), $command->getResourceServerId());
-        if (null !== $preConfiguredAuthorization && !$preConfiguredAuthorization->isRevoked()) {
+        if (null === $preConfiguredAuthorization && !$preConfiguredAuthorization->isRevoked()) {
             $preConfiguredAuthorization = $preConfiguredAuthorization->markAsRevoked();
             $this->preConfiguredAuthorizationRepository->save($preConfiguredAuthorization);
         }
     }
 }

939) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Command/RevokePreConfiguredAuthorizationCommandHandler.php:47    [M] LogicalNot

--- Original
+++ New
@@ @@
         $preConfiguredAuthorization = $this->preConfiguredAuthorizationRepository->find($command->getUserAccountId(), $command->getClientId(), $command->getScopes(), $command->getResourceServerId());
-        if (null !== $preConfiguredAuthorization && !$preConfiguredAuthorization->isRevoked()) {
+        if (null !== $preConfiguredAuthorization && $preConfiguredAuthorization->isRevoked()) {
             $preConfiguredAuthorization = $preConfiguredAuthorization->markAsRevoked();
             $this->preConfiguredAuthorizationRepository->save($preConfiguredAuthorization);
         }
     }
 }

940) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Command/RevokePreConfiguredAuthorizationCommandHandler.php:47    [M] LogicalAnd

--- Original
+++ New
@@ @@
         $preConfiguredAuthorization = $this->preConfiguredAuthorizationRepository->find($command->getUserAccountId(), $command->getClientId(), $command->getScopes(), $command->getResourceServerId());
-        if (null !== $preConfiguredAuthorization && !$preConfiguredAuthorization->isRevoked()) {
+        if (null !== $preConfiguredAuthorization || !$preConfiguredAuthorization->isRevoked()) {
             $preConfiguredAuthorization = $preConfiguredAuthorization->markAsRevoked();
             $this->preConfiguredAuthorizationRepository->save($preConfiguredAuthorization);
         }
     }
 }

941) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Command/RevokePreConfiguredAuthorizationCommandHandler.php:38    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function handle(RevokePreConfiguredAuthorizationCommand $command)
+    protected function handle(RevokePreConfiguredAuthorizationCommand $command)
     {
         $preConfiguredAuthorization = $this->preConfiguredAuthorizationRepository->find($command->getUserAccountId(), $command->getClientId(), $command->getScopes(), $command->getResourceServerId());
         if (null !== $preConfiguredAuthorization && !$preConfiguredAuthorization->isRevoked()) {
             $preConfiguredAuthorization = $preConfiguredAuthorization->markAsRevoked();
             $this->preConfiguredAuthorizationRepository->save($preConfiguredAuthorization);
         }

942) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Event/PreConfiguredAuthorizationCreatedEvent.php:56    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
      */
-    protected function __construct(PreConfiguredAuthorizationId $preConfiguredAuthorizationId, ClientId $clientId, UserAccountId $userAccountId, array $scopes, ?\DateTimeImmutable $recordedOn, ?EventId $eventId)
+    private function __construct(PreConfiguredAuthorizationId $preConfiguredAuthorizationId, ClientId $clientId, UserAccountId $userAccountId, array $scopes, ?\DateTimeImmutable $recordedOn, ?EventId $eventId)
     {
         parent::__construct($recordedOn, $eventId);
         $this->preConfiguredAuthorizationId = $preConfiguredAuthorizationId;
         $this->clientId = $clientId;
         $this->userAccountId = $userAccountId;
         $this->scopes = $scopes;

944) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Event/PreConfiguredAuthorizationCreatedEvent.php:81    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public static function create(PreConfiguredAuthorizationId $preConfiguredAuthorizationId, ClientId $clientId, UserAccountId $userAccountId, array $scopes) : self
+    protected static function create(PreConfiguredAuthorizationId $preConfiguredAuthorizationId, ClientId $clientId, UserAccountId $userAccountId, array $scopes) : self
     {
         return new self($preConfiguredAuthorizationId, $clientId, $userAccountId, $scopes, null, null);
     }
     /**
      * @return PreConfiguredAuthorizationId
      */

952) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Event/PreConfiguredAuthorizationRevokedEvent.php:36    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
      */
-    protected function __construct(PreConfiguredAuthorizationId $preConfiguredAuthorizationId, ?\DateTimeImmutable $recordedOn, ?EventId $eventId)
+    private function __construct(PreConfiguredAuthorizationId $preConfiguredAuthorizationId, ?\DateTimeImmutable $recordedOn, ?EventId $eventId)
     {
         parent::__construct($recordedOn, $eventId);
         $this->preConfiguredAuthorizationId = $preConfiguredAuthorizationId;
     }
     /**
      * {@inheritdoc}

954) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Event/PreConfiguredAuthorizationRevokedEvent.php:55    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public static function create(PreConfiguredAuthorizationId $preConfiguredAuthorizationId) : self
+    protected static function create(PreConfiguredAuthorizationId $preConfiguredAuthorizationId) : self
     {
         return new self($preConfiguredAuthorizationId, null, null);
     }
     /**
      * @return PreConfiguredAuthorizationId
      */

959) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Exception/CreateRedirectionException.php:47    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function getAuthorization() : Authorization
+    protected function getAuthorization() : Authorization
     {
         return $this->authorization;
     }
     /**
      * @return null|string
      */

960) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/Exception/CreateRedirectionException.php:55    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function getDescription() : ?string
+    protected function getDescription() : ?string
     {
         return $this->description;
     }
 }

964) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ParameterChecker/DisplayParameterChecker.php:36    [M] BitwiseOr

--- Original
+++ New
@@ @@
             if ($authorization->hasQueryParam('display')) {
-                Assertion::true(in_array($authorization->getQueryParam('display'), $this->getAllowedDisplayValues()), sprintf('Invalid parameter "display". Allowed values are %s', json_encode($this->getAllowedDisplayValues(), JSON_UNESCAPED_UNICODE | JSON_UNESCAPED_SLASHES)));
+                Assertion::true(in_array($authorization->getQueryParam('display'), $this->getAllowedDisplayValues()), sprintf('Invalid parameter "display". Allowed values are %s', json_encode($this->getAllowedDisplayValues(), JSON_UNESCAPED_UNICODE & JSON_UNESCAPED_SLASHES)));
             }
             return $next($authorization);
         } catch (\InvalidArgumentException $e) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, $e->getMessage(), $authorization, $e);
         }
     }

966) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ParameterChecker/NonceParameterChecker.php:33    [M] FalseValue

--- Original
+++ New
@@ @@
             $authorization = $next($authorization);
-            if (false !== strpos($authorization->getQueryParam('response_type'), 'id_token')) {
+            if (true !== strpos($authorization->getQueryParam('response_type'), 'id_token')) {
                 Assertion::true($authorization->hasQueryParam('nonce'), 'The parameter "nonce" is mandatory.');
             }
             return $authorization;
         } catch (\InvalidArgumentException $e) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, $e->getMessage(), $authorization, $e);
         }

967) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ParameterChecker/NonceParameterChecker.php:33    [M] NotIdentical

--- Original
+++ New
@@ @@
             $authorization = $next($authorization);
-            if (false !== strpos($authorization->getQueryParam('response_type'), 'id_token')) {
+            if (false === strpos($authorization->getQueryParam('response_type'), 'id_token')) {
                 Assertion::true($authorization->hasQueryParam('nonce'), 'The parameter "nonce" is mandatory.');
             }
             return $authorization;
         } catch (\InvalidArgumentException $e) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, $e->getMessage(), $authorization, $e);
         }

969) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ParameterChecker/ParameterCheckerManager.php:30    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function add(ParameterChecker $parameterChecker) : self
+    protected function add(ParameterChecker $parameterChecker) : self
     {
         $this->parameterCheckers[] = $parameterChecker;
         return $this;
     }
     /**
      * @param Authorization $authorization

970) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ParameterChecker/ParameterCheckerManager.php:44    [M] OneZeroInteger

--- Original
+++ New
@@ @@
     {
-        return call_user_func($this->callableForNextExtension(0), $authorization, []);
+        return call_user_func($this->callableForNextExtension(1), $authorization, []);
     }
     /**
      * @param int $index
      *
      * @return \Closure
      */

971) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ParameterChecker/ParameterCheckerManager.php:42    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function process(Authorization $authorization) : Authorization
+    protected function process(Authorization $authorization) : Authorization
     {
         return call_user_func($this->callableForNextExtension(0), $authorization, []);
     }
     /**
      * @param int $index
      *

972) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ParameterChecker/ParameterCheckerManager.php:54    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!array_key_exists($index, $this->parameterCheckers)) {
+        if (array_key_exists($index, $this->parameterCheckers)) {
             return function (Authorization $authorization) : Authorization {
                 return $authorization;
             };
         }
         $parameterChecker = $this->parameterCheckers[$index];
         return function (Authorization $authorization) use($parameterChecker, $index) : Authorization {

973) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ParameterChecker/ParameterCheckerManager.php:62    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         return function (Authorization $authorization) use($parameterChecker, $index) : Authorization {
-            return $parameterChecker->process($authorization, $this->callableForNextExtension($index + 1));
+            return $parameterChecker->process($authorization, $this->callableForNextExtension($index + 0));
         };
     }
 }

974) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ParameterChecker/ParameterCheckerManager.php:62    [M] Plus

--- Original
+++ New
@@ @@
         return function (Authorization $authorization) use($parameterChecker, $index) : Authorization {
-            return $parameterChecker->process($authorization, $this->callableForNextExtension($index + 1));
+            return $parameterChecker->process($authorization, $this->callableForNextExtension($index - 1));
         };
     }
 }

975) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ParameterChecker/PromptParameterChecker.php:38    [M] OneZeroInteger

--- Original
+++ New
@@ @@
                 Assertion::true(empty(array_diff($prompt, $this->getAllowedPromptValues())), sprintf('Invalid parameter "prompt". Allowed values are %s', implode(', ', $this->getAllowedPromptValues())));
-                Assertion::false(in_array('none', $prompt) && 1 !== count($prompt), 'Invalid parameter "prompt". Prompt value "none" must be used alone.');
+                Assertion::false(in_array('none', $prompt) && 0 !== count($prompt), 'Invalid parameter "prompt". Prompt value "none" must be used alone.');
             }
             return $next($authorization);
         } catch (\InvalidArgumentException $e) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, $e->getMessage(), $authorization, $e);
         }
     }

976) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ParameterChecker/PromptParameterChecker.php:38    [M] NotIdentical

--- Original
+++ New
@@ @@
                 Assertion::true(empty(array_diff($prompt, $this->getAllowedPromptValues())), sprintf('Invalid parameter "prompt". Allowed values are %s', implode(', ', $this->getAllowedPromptValues())));
-                Assertion::false(in_array('none', $prompt) && 1 !== count($prompt), 'Invalid parameter "prompt". Prompt value "none" must be used alone.');
+                Assertion::false(in_array('none', $prompt) && 1 === count($prompt), 'Invalid parameter "prompt". Prompt value "none" must be used alone.');
             }
             return $next($authorization);
         } catch (\InvalidArgumentException $e) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, $e->getMessage(), $authorization, $e);
         }
     }

977) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ParameterChecker/PromptParameterChecker.php:38    [M] LogicalAnd

--- Original
+++ New
@@ @@
                 Assertion::true(empty(array_diff($prompt, $this->getAllowedPromptValues())), sprintf('Invalid parameter "prompt". Allowed values are %s', implode(', ', $this->getAllowedPromptValues())));
-                Assertion::false(in_array('none', $prompt) && 1 !== count($prompt), 'Invalid parameter "prompt". Prompt value "none" must be used alone.');
+                Assertion::false(in_array('none', $prompt) || 1 !== count($prompt), 'Invalid parameter "prompt". Prompt value "none" must be used alone.');
             }
             return $next($authorization);
         } catch (\InvalidArgumentException $e) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, $e->getMessage(), $authorization, $e);
         }
     }

980) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ParameterChecker/RedirectUriParameterChecker.php:89    [M] FalseValue

--- Original
+++ New
@@ @@
     {
-        if (false === $this->isSecuredRedirectUriEnforced()) {
+        if (true === $this->isSecuredRedirectUriEnforced()) {
             return;
         }
         if (true === $this->isSecuredRedirectUriEnforced() && 'https' !== mb_substr($redirectUri, 0, 5, '8bit')) {
             Assertion::true($this->isALocalUriOrAnUrn($redirectUri), 'The parameter "redirect_uri" must be a secured URI.');
         }
     }

981) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ParameterChecker/RedirectUriParameterChecker.php:89    [M] Identical

--- Original
+++ New
@@ @@
     {
-        if (false === $this->isSecuredRedirectUriEnforced()) {
+        if (false !== $this->isSecuredRedirectUriEnforced()) {
             return;
         }
         if (true === $this->isSecuredRedirectUriEnforced() && 'https' !== mb_substr($redirectUri, 0, 5, '8bit')) {
             Assertion::true($this->isALocalUriOrAnUrn($redirectUri), 'The parameter "redirect_uri" must be a secured URI.');
         }
     }

982) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ParameterChecker/RedirectUriParameterChecker.php:92    [M] TrueValue

--- Original
+++ New
@@ @@
         }
-        if (true === $this->isSecuredRedirectUriEnforced() && 'https' !== mb_substr($redirectUri, 0, 5, '8bit')) {
+        if (false === $this->isSecuredRedirectUriEnforced() && 'https' !== mb_substr($redirectUri, 0, 5, '8bit')) {
             Assertion::true($this->isALocalUriOrAnUrn($redirectUri), 'The parameter "redirect_uri" must be a secured URI.');
         }
     }
     /**
      * Redirection to an URN or a local host is allowed if the https is required.
      *

983) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ParameterChecker/RedirectUriParameterChecker.php:92    [M] Identical

--- Original
+++ New
@@ @@
         }
-        if (true === $this->isSecuredRedirectUriEnforced() && 'https' !== mb_substr($redirectUri, 0, 5, '8bit')) {
+        if (true !== $this->isSecuredRedirectUriEnforced() && 'https' !== mb_substr($redirectUri, 0, 5, '8bit')) {
             Assertion::true($this->isALocalUriOrAnUrn($redirectUri), 'The parameter "redirect_uri" must be a secured URI.');
         }
     }
     /**
      * Redirection to an URN or a local host is allowed if the https is required.
      *

984) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ParameterChecker/RedirectUriParameterChecker.php:92    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         }
-        if (true === $this->isSecuredRedirectUriEnforced() && 'https' !== mb_substr($redirectUri, 0, 5, '8bit')) {
+        if (true === $this->isSecuredRedirectUriEnforced() && 'https' !== mb_substr($redirectUri, 1, 5, '8bit')) {
             Assertion::true($this->isALocalUriOrAnUrn($redirectUri), 'The parameter "redirect_uri" must be a secured URI.');
         }
     }
     /**
      * Redirection to an URN or a local host is allowed if the https is required.
      *

985) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ParameterChecker/RedirectUriParameterChecker.php:92    [M] NotIdentical

--- Original
+++ New
@@ @@
         }
-        if (true === $this->isSecuredRedirectUriEnforced() && 'https' !== mb_substr($redirectUri, 0, 5, '8bit')) {
+        if (true === $this->isSecuredRedirectUriEnforced() && 'https' === mb_substr($redirectUri, 0, 5, '8bit')) {
             Assertion::true($this->isALocalUriOrAnUrn($redirectUri), 'The parameter "redirect_uri" must be a secured URI.');
         }
     }
     /**
      * Redirection to an URN or a local host is allowed if the https is required.
      *

986) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ParameterChecker/RedirectUriParameterChecker.php:92    [M] LogicalAnd

--- Original
+++ New
@@ @@
         }
-        if (true === $this->isSecuredRedirectUriEnforced() && 'https' !== mb_substr($redirectUri, 0, 5, '8bit')) {
+        if (true === $this->isSecuredRedirectUriEnforced() || 'https' !== mb_substr($redirectUri, 0, 5, '8bit')) {
             Assertion::true($this->isALocalUriOrAnUrn($redirectUri), 'The parameter "redirect_uri" must be a secured URI.');
         }
     }
     /**
      * Redirection to an URN or a local host is allowed if the https is required.
      *

987) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ParameterChecker/RedirectUriParameterChecker.php:108    [M] LogicalAnd

--- Original
+++ New
@@ @@
         $parsed = parse_url($redirectUri);
-        return array_key_exists('scheme', $parsed) && array_key_exists('host', $parsed) && 'http' === $parsed['scheme'] && in_array($parsed['host'], ['[::1]', '127.0.0.1']);
+        return (array_key_exists('scheme', $parsed) || array_key_exists('host', $parsed)) && 'http' === $parsed['scheme'] && in_array($parsed['host'], ['[::1]', '127.0.0.1']);
     }
     /**
      * @param Client $client
      * @param string $redirectUri
      * @param array  $queryParameters
      */

988) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ParameterChecker/RedirectUriParameterChecker.php:108    [M] Identical

--- Original
+++ New
@@ @@
         $parsed = parse_url($redirectUri);
-        return array_key_exists('scheme', $parsed) && array_key_exists('host', $parsed) && 'http' === $parsed['scheme'] && in_array($parsed['host'], ['[::1]', '127.0.0.1']);
+        return array_key_exists('scheme', $parsed) && array_key_exists('host', $parsed) && 'http' !== $parsed['scheme'] && in_array($parsed['host'], ['[::1]', '127.0.0.1']);
     }
     /**
      * @param Client $client
      * @param string $redirectUri
      * @param array  $queryParameters
      */

989) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ParameterChecker/RedirectUriParameterChecker.php:108    [M] LogicalAnd

--- Original
+++ New
@@ @@
         $parsed = parse_url($redirectUri);
-        return array_key_exists('scheme', $parsed) && array_key_exists('host', $parsed) && 'http' === $parsed['scheme'] && in_array($parsed['host'], ['[::1]', '127.0.0.1']);
+        return (array_key_exists('scheme', $parsed) && array_key_exists('host', $parsed) || 'http' === $parsed['scheme']) && in_array($parsed['host'], ['[::1]', '127.0.0.1']);
     }
     /**
      * @param Client $client
      * @param string $redirectUri
      * @param array  $queryParameters
      */

990) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ParameterChecker/RedirectUriParameterChecker.php:108    [M] LogicalAnd

--- Original
+++ New
@@ @@
         $parsed = parse_url($redirectUri);
-        return array_key_exists('scheme', $parsed) && array_key_exists('host', $parsed) && 'http' === $parsed['scheme'] && in_array($parsed['host'], ['[::1]', '127.0.0.1']);
+        return array_key_exists('scheme', $parsed) && array_key_exists('host', $parsed) && 'http' === $parsed['scheme'] || in_array($parsed['host'], ['[::1]', '127.0.0.1']);
     }
     /**
      * @param Client $client
      * @param string $redirectUri
      * @param array  $queryParameters
      */

991) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ParameterChecker/RedirectUriParameterChecker.php:120    [M] LogicalNot

--- Original
+++ New
@@ @@
         $client_redirect_uris = $this->getClientRedirectUris($client, $queryParameters);
-        Assertion::false(!empty($client_redirect_uris) && false === Uri::isRedirectUriAllowed($redirectUri, $client_redirect_uris), 'The specified redirect URI is not valid.');
+        Assertion::false(empty($client_redirect_uris) && false === Uri::isRedirectUriAllowed($redirectUri, $client_redirect_uris), 'The specified redirect URI is not valid.');
     }
     /**
      * Check if the redirect URIs stored by the client.
      *
      * @param Client $client
      * @param array  $queryParameters

992) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ParameterChecker/RedirectUriParameterChecker.php:120    [M] FalseValue

--- Original
+++ New
@@ @@
         $client_redirect_uris = $this->getClientRedirectUris($client, $queryParameters);
-        Assertion::false(!empty($client_redirect_uris) && false === Uri::isRedirectUriAllowed($redirectUri, $client_redirect_uris), 'The specified redirect URI is not valid.');
+        Assertion::false(!empty($client_redirect_uris) && true === Uri::isRedirectUriAllowed($redirectUri, $client_redirect_uris), 'The specified redirect URI is not valid.');
     }
     /**
      * Check if the redirect URIs stored by the client.
      *
      * @param Client $client
      * @param array  $queryParameters

993) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ParameterChecker/RedirectUriParameterChecker.php:120    [M] Identical

--- Original
+++ New
@@ @@
         $client_redirect_uris = $this->getClientRedirectUris($client, $queryParameters);
-        Assertion::false(!empty($client_redirect_uris) && false === Uri::isRedirectUriAllowed($redirectUri, $client_redirect_uris), 'The specified redirect URI is not valid.');
+        Assertion::false(!empty($client_redirect_uris) && false !== Uri::isRedirectUriAllowed($redirectUri, $client_redirect_uris), 'The specified redirect URI is not valid.');
     }
     /**
      * Check if the redirect URIs stored by the client.
      *
      * @param Client $client
      * @param array  $queryParameters

994) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ParameterChecker/RedirectUriParameterChecker.php:120    [M] LogicalAnd

--- Original
+++ New
@@ @@
         $client_redirect_uris = $this->getClientRedirectUris($client, $queryParameters);
-        Assertion::false(!empty($client_redirect_uris) && false === Uri::isRedirectUriAllowed($redirectUri, $client_redirect_uris), 'The specified redirect URI is not valid.');
+        Assertion::false(!empty($client_redirect_uris) || false === Uri::isRedirectUriAllowed($redirectUri, $client_redirect_uris), 'The specified redirect URI is not valid.');
     }
     /**
      * Check if the redirect URIs stored by the client.
      *
      * @param Client $client
      * @param array  $queryParameters

995) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ParameterChecker/RedirectUriParameterChecker.php:116    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function checkRedirectUriForTheClient(Client $client, $redirectUri, array $queryParameters)
+    protected function checkRedirectUriForTheClient(Client $client, $redirectUri, array $queryParameters)
     {
         $client_redirect_uris = $this->getClientRedirectUris($client, $queryParameters);
         Assertion::false(!empty($client_redirect_uris) && false === Uri::isRedirectUriAllowed($redirectUri, $client_redirect_uris), 'The specified redirect URI is not valid.');
     }
     /**
      * Check if the redirect URIs stored by the client.
