996) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ParameterChecker/RedirectUriParameterChecker.php:137    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$client->has('redirect_uris') || empty($redirectUris = $client->get('redirect_uris'))) {
+        if ($client->has('redirect_uris') || empty($redirectUris = $client->get('redirect_uris'))) {
             Assertion::false($this->isRedirectUriStorageEnforced(), 'Clients must register at least one redirect URI.');
             Assertion::false($client->isPublic(), 'Non-confidential clients must register at least one redirect URI.');
             Assertion::false(!$client->isPublic() && array_key_exists('response_type', $queryParameters) && 'token' === $queryParameters['response_type'], 'Confidential clients must register at least one redirect URI when using "token" response type.');
             return [];
         }
         return $redirectUris;

997) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ParameterChecker/RedirectUriParameterChecker.php:137    [M] LogicalOr

--- Original
+++ New
@@ @@
     {
-        if (!$client->has('redirect_uris') || empty($redirectUris = $client->get('redirect_uris'))) {
+        if (!$client->has('redirect_uris') && empty($redirectUris = $client->get('redirect_uris'))) {
             Assertion::false($this->isRedirectUriStorageEnforced(), 'Clients must register at least one redirect URI.');
             Assertion::false($client->isPublic(), 'Non-confidential clients must register at least one redirect URI.');
             Assertion::false(!$client->isPublic() && array_key_exists('response_type', $queryParameters) && 'token' === $queryParameters['response_type'], 'Confidential clients must register at least one redirect URI when using "token" response type.');
             return [];
         }
         return $redirectUris;

998) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ParameterChecker/RedirectUriParameterChecker.php:140    [M] LogicalNot

--- Original
+++ New
@@ @@
             Assertion::false($client->isPublic(), 'Non-confidential clients must register at least one redirect URI.');
-            Assertion::false(!$client->isPublic() && array_key_exists('response_type', $queryParameters) && 'token' === $queryParameters['response_type'], 'Confidential clients must register at least one redirect URI when using "token" response type.');
+            Assertion::false($client->isPublic() && array_key_exists('response_type', $queryParameters) && 'token' === $queryParameters['response_type'], 'Confidential clients must register at least one redirect URI when using "token" response type.');
             return [];
         }
         return $redirectUris;
     }
     /**
      * @return bool

999) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ParameterChecker/RedirectUriParameterChecker.php:140    [M] LogicalAnd

--- Original
+++ New
@@ @@
             Assertion::false($client->isPublic(), 'Non-confidential clients must register at least one redirect URI.');
-            Assertion::false(!$client->isPublic() && array_key_exists('response_type', $queryParameters) && 'token' === $queryParameters['response_type'], 'Confidential clients must register at least one redirect URI when using "token" response type.');
+            Assertion::false((!$client->isPublic() || array_key_exists('response_type', $queryParameters)) && 'token' === $queryParameters['response_type'], 'Confidential clients must register at least one redirect URI when using "token" response type.');
             return [];
         }
         return $redirectUris;
     }
     /**
      * @return bool

1000) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ParameterChecker/RedirectUriParameterChecker.php:140    [M] Identical

--- Original
+++ New
@@ @@
             Assertion::false($client->isPublic(), 'Non-confidential clients must register at least one redirect URI.');
-            Assertion::false(!$client->isPublic() && array_key_exists('response_type', $queryParameters) && 'token' === $queryParameters['response_type'], 'Confidential clients must register at least one redirect URI when using "token" response type.');
+            Assertion::false(!$client->isPublic() && array_key_exists('response_type', $queryParameters) && 'token' !== $queryParameters['response_type'], 'Confidential clients must register at least one redirect URI when using "token" response type.');
             return [];
         }
         return $redirectUris;
     }
     /**
      * @return bool

1001) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ParameterChecker/RedirectUriParameterChecker.php:140    [M] LogicalAnd

--- Original
+++ New
@@ @@
             Assertion::false($client->isPublic(), 'Non-confidential clients must register at least one redirect URI.');
-            Assertion::false(!$client->isPublic() && array_key_exists('response_type', $queryParameters) && 'token' === $queryParameters['response_type'], 'Confidential clients must register at least one redirect URI when using "token" response type.');
+            Assertion::false(!$client->isPublic() && array_key_exists('response_type', $queryParameters) || 'token' === $queryParameters['response_type'], 'Confidential clients must register at least one redirect URI when using "token" response type.');
             return [];
         }
         return $redirectUris;
     }
     /**
      * @return bool

1002) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ParameterChecker/ResponseTypeAndResponseModeParameterChecker.php:67    [M] TrueValue

--- Original
+++ New
@@ @@
             $authorization = $authorization->withResponseTypes($responseTypes);
-            if (true === $authorization->hasQueryParam('response_mode') && $this->isResponseModeParameterInAuthorizationRequestAllowed()) {
+            if (false === $authorization->hasQueryParam('response_mode') && $this->isResponseModeParameterInAuthorizationRequestAllowed()) {
                 $responseMode = $authorization->getQueryParam('response_mode');
             } else {
                 $responseMode = $this->findResponseMode($responseTypes, $responseType);
             }
             Assertion::true($this->responseModeManager->has($responseMode), sprintf('The response mode "%s" is supported. Please use one of the following values: %s.', $responseMode, implode(', ', $this->responseModeManager->list())));
             $authorization = $authorization->withResponseMode($this->responseModeManager->get($responseMode));

1003) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ParameterChecker/ResponseTypeAndResponseModeParameterChecker.php:67    [M] Identical

--- Original
+++ New
@@ @@
             $authorization = $authorization->withResponseTypes($responseTypes);
-            if (true === $authorization->hasQueryParam('response_mode') && $this->isResponseModeParameterInAuthorizationRequestAllowed()) {
+            if (true !== $authorization->hasQueryParam('response_mode') && $this->isResponseModeParameterInAuthorizationRequestAllowed()) {
                 $responseMode = $authorization->getQueryParam('response_mode');
             } else {
                 $responseMode = $this->findResponseMode($responseTypes, $responseType);
             }
             Assertion::true($this->responseModeManager->has($responseMode), sprintf('The response mode "%s" is supported. Please use one of the following values: %s.', $responseMode, implode(', ', $this->responseModeManager->list())));
             $authorization = $authorization->withResponseMode($this->responseModeManager->get($responseMode));

1004) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ParameterChecker/ResponseTypeAndResponseModeParameterChecker.php:67    [M] LogicalAnd

--- Original
+++ New
@@ @@
             $authorization = $authorization->withResponseTypes($responseTypes);
-            if (true === $authorization->hasQueryParam('response_mode') && $this->isResponseModeParameterInAuthorizationRequestAllowed()) {
+            if (true === $authorization->hasQueryParam('response_mode') || $this->isResponseModeParameterInAuthorizationRequestAllowed()) {
                 $responseMode = $authorization->getQueryParam('response_mode');
             } else {
                 $responseMode = $this->findResponseMode($responseTypes, $responseType);
             }
             Assertion::true($this->responseModeManager->has($responseMode), sprintf('The response mode "%s" is supported. Please use one of the following values: %s.', $responseMode, implode(', ', $this->responseModeManager->list())));
             $authorization = $authorization->withResponseMode($this->responseModeManager->get($responseMode));

1006) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ParameterChecker/ResponseTypeAndResponseModeParameterChecker.php:100    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function isResponseModeParameterInAuthorizationRequestAllowed() : bool
+    protected function isResponseModeParameterInAuthorizationRequestAllowed() : bool
     {
         return $this->responseModeParameterInAuthorizationRequestAllowed;
     }
     /**
      * @param array  $types
      * @param string $responseType

1007) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ParameterChecker/ResponseTypeAndResponseModeParameterChecker.php:113    [M] OneZeroInteger

--- Original
+++ New
@@ @@
     {
-        if (1 === count($types)) {
+        if (0 === count($types)) {
             // There is only one type (OAuth2 request)
             return $types[0]->getResponseMode();
         }
         //There are multiple response types
         switch ($responseType) {
             case 'code token':

1008) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ParameterChecker/ResponseTypeAndResponseModeParameterChecker.php:113    [M] Identical

--- Original
+++ New
@@ @@
     {
-        if (1 === count($types)) {
+        if (1 !== count($types)) {
             // There is only one type (OAuth2 request)
             return $types[0]->getResponseMode();
         }
         //There are multiple response types
         switch ($responseType) {
             case 'code token':

1009) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ParameterChecker/ResponseTypeAndResponseModeParameterChecker.php:115    [M] OneZeroInteger

--- Original
+++ New
@@ @@
             // There is only one type (OAuth2 request)
-            return $types[0]->getResponseMode();
+            return $types[1]->getResponseMode();
         }
         //There are multiple response types
         switch ($responseType) {
             case 'code token':
             case 'code id_token':
             case 'id_token token':

1010) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ParameterChecker/ResponseTypeAndResponseModeParameterChecker.php:111    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function findResponseMode(array $types, string $responseType) : string
+    protected function findResponseMode(array $types, string $responseType) : string
     {
         if (1 === count($types)) {
             // There is only one type (OAuth2 request)
             return $types[0]->getResponseMode();
         }
         //There are multiple response types

1011) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ParameterChecker/ScopeParameterChecker.php:57    [M] NotIdentical

--- Original
+++ New
@@ @@
             }
-            if (null !== $this->scopePolicyManager) {
+            if (null === $this->scopePolicyManager) {
                 $scope = $this->scopePolicyManager->check($scope, $authorization->getClient());
             }
             $availableScope = $this->scopeRepository->getAvailableScopesForClient($authorization->getClient());
             Assertion::true($this->scopeRepository->areRequestedScopesAvailable($scope, $availableScope), sprintf('An unsupported scope was requested. Available scopes for the client are %s.', implode(', ', $availableScope)));
             $authorization = $authorization->withScopes($scope);
             return $next($authorization);

1013) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ParameterChecker/StateParameterChecker.php:47    [M] TrueValue

--- Original
+++ New
@@ @@
         try {
-            if (true === $this->stateParameterEnforced && !$authorization->hasQueryParam('state')) {
+            if (false === $this->stateParameterEnforced && !$authorization->hasQueryParam('state')) {
                 throw new \InvalidArgumentException('The parameter "state" is mandatory.');
             }
             if (true === $authorization->hasQueryParam('state')) {
                 $authorization = $authorization->withResponseParameter('state', $authorization->getQueryParam('state'));
             }
             return $next($authorization);

1014) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ParameterChecker/StateParameterChecker.php:47    [M] Identical

--- Original
+++ New
@@ @@
         try {
-            if (true === $this->stateParameterEnforced && !$authorization->hasQueryParam('state')) {
+            if (true !== $this->stateParameterEnforced && !$authorization->hasQueryParam('state')) {
                 throw new \InvalidArgumentException('The parameter "state" is mandatory.');
             }
             if (true === $authorization->hasQueryParam('state')) {
                 $authorization = $authorization->withResponseParameter('state', $authorization->getQueryParam('state'));
             }
             return $next($authorization);

1015) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ParameterChecker/StateParameterChecker.php:47    [M] LogicalNot

--- Original
+++ New
@@ @@
         try {
-            if (true === $this->stateParameterEnforced && !$authorization->hasQueryParam('state')) {
+            if (true === $this->stateParameterEnforced && $authorization->hasQueryParam('state')) {
                 throw new \InvalidArgumentException('The parameter "state" is mandatory.');
             }
             if (true === $authorization->hasQueryParam('state')) {
                 $authorization = $authorization->withResponseParameter('state', $authorization->getQueryParam('state'));
             }
             return $next($authorization);

1016) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ParameterChecker/StateParameterChecker.php:47    [M] LogicalAnd

--- Original
+++ New
@@ @@
         try {
-            if (true === $this->stateParameterEnforced && !$authorization->hasQueryParam('state')) {
+            if (true === $this->stateParameterEnforced || !$authorization->hasQueryParam('state')) {
                 throw new \InvalidArgumentException('The parameter "state" is mandatory.');
             }
             if (true === $authorization->hasQueryParam('state')) {
                 $authorization = $authorization->withResponseParameter('state', $authorization->getQueryParam('state'));
             }
             return $next($authorization);

1017) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ParameterChecker/StateParameterChecker.php:50    [M] TrueValue

--- Original
+++ New
@@ @@
             }
-            if (true === $authorization->hasQueryParam('state')) {
+            if (false === $authorization->hasQueryParam('state')) {
                 $authorization = $authorization->withResponseParameter('state', $authorization->getQueryParam('state'));
             }
             return $next($authorization);
         } catch (\InvalidArgumentException $e) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, $e->getMessage(), $authorization, $e);
         }

1018) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ParameterChecker/StateParameterChecker.php:50    [M] Identical

--- Original
+++ New
@@ @@
             }
-            if (true === $authorization->hasQueryParam('state')) {
+            if (true !== $authorization->hasQueryParam('state')) {
                 $authorization = $authorization->withResponseParameter('state', $authorization->getQueryParam('state'));
             }
             return $next($authorization);
         } catch (\InvalidArgumentException $e) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, $e->getMessage(), $authorization, $e);
         }

1020) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ParameterChecker/TokenTypeParameterChecker.php:50    [M] TrueValue

--- Original
+++ New
@@ @@
         try {
-            if (true === $this->tokenTypeParameterAllowed && $authorization->hasQueryParam('token_type')) {
+            if (false === $this->tokenTypeParameterAllowed && $authorization->hasQueryParam('token_type')) {
                 $tokenType = $this->tokenTypeManager->get($authorization->getQueryParam('token_type'));
             } else {
                 $tokenType = $this->tokenTypeManager->getDefault();
             }
             if (!$authorization->getClient()->isTokenTypeAllowed($tokenType->name())) {
                 throw new \InvalidArgumentException(sprintf('The token type "%s" is not allowed for the client.', $tokenType->name()));

1021) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ParameterChecker/TokenTypeParameterChecker.php:50    [M] Identical

--- Original
+++ New
@@ @@
         try {
-            if (true === $this->tokenTypeParameterAllowed && $authorization->hasQueryParam('token_type')) {
+            if (true !== $this->tokenTypeParameterAllowed && $authorization->hasQueryParam('token_type')) {
                 $tokenType = $this->tokenTypeManager->get($authorization->getQueryParam('token_type'));
             } else {
                 $tokenType = $this->tokenTypeManager->getDefault();
             }
             if (!$authorization->getClient()->isTokenTypeAllowed($tokenType->name())) {
                 throw new \InvalidArgumentException(sprintf('The token type "%s" is not allowed for the client.', $tokenType->name()));

1022) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ParameterChecker/TokenTypeParameterChecker.php:50    [M] LogicalAnd

--- Original
+++ New
@@ @@
         try {
-            if (true === $this->tokenTypeParameterAllowed && $authorization->hasQueryParam('token_type')) {
+            if (true === $this->tokenTypeParameterAllowed || $authorization->hasQueryParam('token_type')) {
                 $tokenType = $this->tokenTypeManager->get($authorization->getQueryParam('token_type'));
             } else {
                 $tokenType = $this->tokenTypeManager->getDefault();
             }
             if (!$authorization->getClient()->isTokenTypeAllowed($tokenType->name())) {
                 throw new \InvalidArgumentException(sprintf('The token type "%s" is not allowed for the client.', $tokenType->name()));

1023) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ParameterChecker/TokenTypeParameterChecker.php:55    [M] LogicalNot

--- Original
+++ New
@@ @@
             }
-            if (!$authorization->getClient()->isTokenTypeAllowed($tokenType->name())) {
+            if ($authorization->getClient()->isTokenTypeAllowed($tokenType->name())) {
                 throw new \InvalidArgumentException(sprintf('The token type "%s" is not allowed for the client.', $tokenType->name()));
             }
             $authorization = $authorization->withTokenType($tokenType);
             return $next($authorization);
         } catch (\InvalidArgumentException $e) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, $e->getMessage(), $authorization, $e);

1025) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/PreConfiguredAuthorization.php:64    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function create(PreConfiguredAuthorizationId $preConfiguredAuthorizationId, UserAccountId $userAccountId, ClientId $clientId, array $scopes) : self
+    protected function create(PreConfiguredAuthorizationId $preConfiguredAuthorizationId, UserAccountId $userAccountId, ClientId $clientId, array $scopes) : self
     {
         $clone = clone $this;
         $clone->preConfiguredAuthorizationId = $preConfiguredAuthorizationId;
         $clone->userAccountId = $userAccountId;
         $clone->clientId = $clientId;
         $clone->scopes = implode(' ', $scopes);

1035) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/PreConfiguredAuthorization.php:150    [M] NotIdentical

--- Original
+++ New
@@ @@
         }
-        if (null !== $this->preConfiguredAuthorizationId && $this->preConfiguredAuthorizationId !== $event->getDomainId()) {
+        if (null === $this->preConfiguredAuthorizationId && $this->preConfiguredAuthorizationId !== $event->getDomainId()) {
             throw new \InvalidArgumentException('Event not applicable for this initial access token.');
         }
         $method = $map[$event->getType()];
         return $this->{$method}($event);
     }
     /**

1036) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/PreConfiguredAuthorization.php:150    [M] NotIdentical

--- Original
+++ New
@@ @@
         }
-        if (null !== $this->preConfiguredAuthorizationId && $this->preConfiguredAuthorizationId !== $event->getDomainId()) {
+        if (null !== $this->preConfiguredAuthorizationId && $this->preConfiguredAuthorizationId === $event->getDomainId()) {
             throw new \InvalidArgumentException('Event not applicable for this initial access token.');
         }
         $method = $map[$event->getType()];
         return $this->{$method}($event);
     }
     /**

1037) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/PreConfiguredAuthorization.php:150    [M] LogicalAnd

--- Original
+++ New
@@ @@
         }
-        if (null !== $this->preConfiguredAuthorizationId && $this->preConfiguredAuthorizationId !== $event->getDomainId()) {
+        if (null !== $this->preConfiguredAuthorizationId || $this->preConfiguredAuthorizationId !== $event->getDomainId()) {
             throw new \InvalidArgumentException('Event not applicable for this initial access token.');
         }
         $method = $map[$event->getType()];
         return $this->{$method}($event);
     }
     /**

1042) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/PreConfiguredAuthorization.php:221    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
      */
-    protected function applyPreConfiguredAuthorizationCreatedEvent(PreConfiguredAuthorizationCreatedEvent $event) : self
+    private function applyPreConfiguredAuthorizationCreatedEvent(PreConfiguredAuthorizationCreatedEvent $event) : self
     {
         $clone = clone $this;
         $clone->preConfiguredAuthorizationId = $event->getPreConfiguredAuthorizationId();
         $clone->userAccountId = $event->getUserAccountId();
         $clone->clientId = $event->getClientId();
         $clone->scopes = implode(' ', $event->getScopes());

1044) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/PreConfiguredAuthorization.php:237    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
      */
-    protected function applyPreConfiguredAuthorizationRevokedEvent(PreConfiguredAuthorizationRevokedEvent $event) : self
+    private function applyPreConfiguredAuthorizationRevokedEvent(PreConfiguredAuthorizationRevokedEvent $event) : self
     {
         $clone = clone $this;
         $clone->revoked = true;
         return $clone;
     }
 }

1047) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ResponseMode/FormPostResponseMode.php:55    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function buildResponse(string $redirectUri, array $data) : ResponseInterface
+    protected function buildResponse(string $redirectUri, array $data) : ResponseInterface
     {
         $template = $this->renderer->render($redirectUri, $data);
         $response = $this->responseFactory->createResponse();
         $response = $response->withHeader('Content-Type', 'text/html');
         $response->getBody()->write($template);
         return $response;

1049) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ResponseMode/FragmentResponseMode.php:60    [M] PlusEqual

--- Original
+++ New
@@ @@
         parse_str($uri->getFragment(), $fragmentParams);
-        $fragmentParams += $data;
+        $fragmentParams -= $data;
         $uri = $uri->withFragment(http_build_query($fragmentParams));
         $response = $this->responseFactory->createResponse(302);
         $response = $response->withHeader('Location', $uri->__toString());
         return $response;
     }
 }

1052) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ResponseMode/QueryResponseMode.php:61    [M] PlusEqual

--- Original
+++ New
@@ @@
         parse_str($uri->getQuery(), $queryParams);
-        $queryParams += $data;
+        $queryParams -= $data;
         $uri = $uri->withQuery(http_build_query($queryParams));
         $response = $this->responseFactory->createResponse(302);
         $response = $response->withHeader('Location', $uri->__toString());
         return $response;
     }
 }

1055) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ResponseMode/ResponseModeManager.php:40    [M] This

--- Original
+++ New
@@ @@
         $this->responseModes[$responseMode->name()] = $responseMode;
-        return $this;
+        return null;
     }
     /**
      * @param string $name
      *
      * @return bool
      */

1056) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ResponseMode/ResponseModeManager.php:36    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function add(ResponseMode $responseMode)
+    protected function add(ResponseMode $responseMode)
     {
         $this->responseModes[$responseMode->name()] = $responseMode;
         return $this;
     }
     /**
      * @param string $name

1059) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ResponseMode/ResponseModeManager.php:60    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function get(string $name) : ResponseMode
+    protected function get(string $name) : ResponseMode
     {
         if (!$this->has($name)) {
             throw new \InvalidArgumentException(sprintf('The response mode with name "%s" is not supported.', $name));
         }
         return $this->responseModes[$name];
     }

1062) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ResponseTypeProcessor.php:44    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public static function create(Authorization $authorization) : self
+    protected static function create(Authorization $authorization) : self
     {
         return new self($authorization);
     }
     /**
      * @return Authorization
      */

1063) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ResponseTypeProcessor.php:54    [M] OneZeroInteger

--- Original
+++ New
@@ @@
     {
-        return call_user_func($this->callableForNextRule(0), $this->authorization);
+        return call_user_func($this->callableForNextRule(1), $this->authorization);
     }
     /**
      * @param int $index
      *
      * @return \Closure
      */

1064) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ResponseTypeProcessor.php:52    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function process() : Authorization
+    protected function process() : Authorization
     {
         return call_user_func($this->callableForNextRule(0), $this->authorization);
     }
     /**
      * @param int $index
      *

1065) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ResponseTypeProcessor.php:64    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!isset($this->responseTypes[$index])) {
+        if (isset($this->responseTypes[$index])) {
             return function (Authorization $authorization) {
                 return $authorization;
             };
         }
         $responseType = $this->responseTypes[$index];
         return function (Authorization $authorization) use($responseType, $index) : Authorization {
