1066) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ResponseTypeProcessor.php:72    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         return function (Authorization $authorization) use($responseType, $index) : Authorization {
-            return $responseType->process($authorization, $this->callableForNextRule($index + 1));
+            return $responseType->process($authorization, $this->callableForNextRule($index + 0));
         };
     }
 }

1067) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/ResponseTypeProcessor.php:72    [M] Plus

--- Original
+++ New
@@ @@
         return function (Authorization $authorization) use($responseType, $index) : Authorization {
-            return $responseType->process($authorization, $this->callableForNextRule($index + 1));
+            return $responseType->process($authorization, $this->callableForNextRule($index - 1));
         };
     }
 }

1068) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/UserAccountDiscovery/IdTokenHintDiscovery.php:60    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function enablePairwiseSubject(PairwiseSubjectIdentifierAlgorithm $pairwiseAlgorithm)
+    protected function enablePairwiseSubject(PairwiseSubjectIdentifierAlgorithm $pairwiseAlgorithm)
     {
         $this->pairwiseAlgorithm = $pairwiseAlgorithm;
     }
     /**
      * {@inheritdoc}
      */

1069) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/UserAccountDiscovery/IdTokenHintDiscovery.php:75    [M] LogicalNot

--- Original
+++ New
@@ @@
                 $idToken = $this->idTokenLoader->load($idTokenId);
-                if (!$idToken instanceof IdToken) {
+                if ($idToken instanceof IdToken) {
                     throw new \InvalidArgumentException('The parameter "id_token_hint" does not contain a valid ID Token.');
                 }
                 $userAccountId = $idToken->getUserAccountId();
                 if (null !== $this->pairwiseAlgorithm) {
                     $publicId = $this->pairwiseAlgorithm->getPublicIdFromSubjectIdentifier($userAccountId->getValue());
                     if (null === $publicId) {

1070) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/UserAccountDiscovery/IdTokenHintDiscovery.php:79    [M] NotIdentical

--- Original
+++ New
@@ @@
                 $userAccountId = $idToken->getUserAccountId();
-                if (null !== $this->pairwiseAlgorithm) {
+                if (null === $this->pairwiseAlgorithm) {
                     $publicId = $this->pairwiseAlgorithm->getPublicIdFromSubjectIdentifier($userAccountId->getValue());
                     if (null === $publicId) {
                         throw new \InvalidArgumentException('Unable to retrieve the user account using the "id_token_hint" parameter.');
                     }
                 } else {
                     $publicId = $userAccountId->getValue();

1071) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/UserAccountDiscovery/IdTokenHintDiscovery.php:81    [M] Identical

--- Original
+++ New
@@ @@
                     $publicId = $this->pairwiseAlgorithm->getPublicIdFromSubjectIdentifier($userAccountId->getValue());
-                    if (null === $publicId) {
+                    if (null !== $publicId) {
                         throw new \InvalidArgumentException('Unable to retrieve the user account using the "id_token_hint" parameter.');
                     }
                 } else {
                     $publicId = $userAccountId->getValue();
                 }
                 $realUserAccountId = UserAccountId::create($publicId);

1072) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/UserAccountDiscovery/IdTokenHintDiscovery.php:90    [M] NotIdentical

--- Original
+++ New
@@ @@
                 $tmp = $this->userAccountRepository->find($realUserAccountId);
-                if (null !== $tmp) {
+                if (null === $tmp) {
                     if (null !== $authorization->getUserAccount()) {
                         if ($tmp->getPublicId()->getValue() !== $authorization->getUserAccount()->getPublicId()->getValue()) {
                             throw new RedirectToLoginPageException($authorization);
                         }
                     }
                 }

1073) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/UserAccountDiscovery/IdTokenHintDiscovery.php:91    [M] NotIdentical

--- Original
+++ New
@@ @@
                 if (null !== $tmp) {
-                    if (null !== $authorization->getUserAccount()) {
+                    if (null === $authorization->getUserAccount()) {
                         if ($tmp->getPublicId()->getValue() !== $authorization->getUserAccount()->getPublicId()->getValue()) {
                             throw new RedirectToLoginPageException($authorization);
                         }
                     }
                 }
             } catch (\InvalidArgumentException $e) {

1074) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/UserAccountDiscovery/IdTokenHintDiscovery.php:92    [M] NotIdentical

--- Original
+++ New
@@ @@
                     if (null !== $authorization->getUserAccount()) {
-                        if ($tmp->getPublicId()->getValue() !== $authorization->getUserAccount()->getPublicId()->getValue()) {
+                        if ($tmp->getPublicId()->getValue() === $authorization->getUserAccount()->getPublicId()->getValue()) {
                             throw new RedirectToLoginPageException($authorization);
                         }
                     }
                 }
             } catch (\InvalidArgumentException $e) {
                 throw new CreateRedirectionException($authorization, OAuth2Exception::ERROR_INVALID_REQUEST, $e->getMessage());

1076) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/UserAccountDiscovery/LoginParameterChecker.php:28    [M] LogicalNot

--- Original
+++ New
@@ @@
         $authorization = $next($request, $authorization);
-        if ($authorization->hasPrompt('login') && !$authorization->isUserAccountFullyAuthenticated()) {
+        if ($authorization->hasPrompt('login') && $authorization->isUserAccountFullyAuthenticated()) {
             throw new RedirectToLoginPageException($authorization);
         }
         return $authorization;
     }
 }

1077) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/UserAccountDiscovery/LoginParameterChecker.php:28    [M] LogicalAnd

--- Original
+++ New
@@ @@
         $authorization = $next($request, $authorization);
-        if ($authorization->hasPrompt('login') && !$authorization->isUserAccountFullyAuthenticated()) {
+        if ($authorization->hasPrompt('login') || !$authorization->isUserAccountFullyAuthenticated()) {
             throw new RedirectToLoginPageException($authorization);
         }
         return $authorization;
     }
 }

1079) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/UserAccountDiscovery/MaxAgeParameterChecker.php:29    [M] NotIdentical

--- Original
+++ New
@@ @@
         $userAccount = $authorization->getUserAccount();
-        if (null !== $userAccount) {
+        if (null === $userAccount) {
             // Whatever the prompt is, if the max_age constraint is not satisfied, the user is redirected to the login page
             if ($authorization->hasQueryParam('max_age') && null !== $userAccount->getLastLoginAt() && time() - $userAccount->getLastLoginAt()->getTimestamp() > (int) $authorization->getQueryParam('max_age')) {
                 //FIXME: check if the client has a default_max_age parameter
                 throw new RedirectToLoginPageException($authorization);
             }
         }

1080) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/UserAccountDiscovery/MaxAgeParameterChecker.php:31    [M] NotIdentical

--- Original
+++ New
@@ @@
             // Whatever the prompt is, if the max_age constraint is not satisfied, the user is redirected to the login page
-            if ($authorization->hasQueryParam('max_age') && null !== $userAccount->getLastLoginAt() && time() - $userAccount->getLastLoginAt()->getTimestamp() > (int) $authorization->getQueryParam('max_age')) {
+            if ($authorization->hasQueryParam('max_age') && null === $userAccount->getLastLoginAt() && time() - $userAccount->getLastLoginAt()->getTimestamp() > (int) $authorization->getQueryParam('max_age')) {
                 //FIXME: check if the client has a default_max_age parameter
                 throw new RedirectToLoginPageException($authorization);
             }
         }
         return $authorization;
     }

1081) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/UserAccountDiscovery/MaxAgeParameterChecker.php:31    [M] LogicalAnd

--- Original
+++ New
@@ @@
             // Whatever the prompt is, if the max_age constraint is not satisfied, the user is redirected to the login page
-            if ($authorization->hasQueryParam('max_age') && null !== $userAccount->getLastLoginAt() && time() - $userAccount->getLastLoginAt()->getTimestamp() > (int) $authorization->getQueryParam('max_age')) {
+            if (($authorization->hasQueryParam('max_age') || null !== $userAccount->getLastLoginAt()) && time() - $userAccount->getLastLoginAt()->getTimestamp() > (int) $authorization->getQueryParam('max_age')) {
                 //FIXME: check if the client has a default_max_age parameter
                 throw new RedirectToLoginPageException($authorization);
             }
         }
         return $authorization;
     }

1082) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/UserAccountDiscovery/MaxAgeParameterChecker.php:31    [M] Minus

--- Original
+++ New
@@ @@
             // Whatever the prompt is, if the max_age constraint is not satisfied, the user is redirected to the login page
-            if ($authorization->hasQueryParam('max_age') && null !== $userAccount->getLastLoginAt() && time() - $userAccount->getLastLoginAt()->getTimestamp() > (int) $authorization->getQueryParam('max_age')) {
+            if ($authorization->hasQueryParam('max_age') && null !== $userAccount->getLastLoginAt() && time() + $userAccount->getLastLoginAt()->getTimestamp() > (int) $authorization->getQueryParam('max_age')) {
                 //FIXME: check if the client has a default_max_age parameter
                 throw new RedirectToLoginPageException($authorization);
             }
         }
         return $authorization;
     }

1083) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/UserAccountDiscovery/MaxAgeParameterChecker.php:31    [M] GreaterThan

--- Original
+++ New
@@ @@
             // Whatever the prompt is, if the max_age constraint is not satisfied, the user is redirected to the login page
-            if ($authorization->hasQueryParam('max_age') && null !== $userAccount->getLastLoginAt() && time() - $userAccount->getLastLoginAt()->getTimestamp() > (int) $authorization->getQueryParam('max_age')) {
+            if ($authorization->hasQueryParam('max_age') && null !== $userAccount->getLastLoginAt() && time() - $userAccount->getLastLoginAt()->getTimestamp() >= (int) $authorization->getQueryParam('max_age')) {
                 //FIXME: check if the client has a default_max_age parameter
                 throw new RedirectToLoginPageException($authorization);
             }
         }
         return $authorization;
     }

1084) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/UserAccountDiscovery/MaxAgeParameterChecker.php:31    [M] GreaterThanNegotiation

--- Original
+++ New
@@ @@
             // Whatever the prompt is, if the max_age constraint is not satisfied, the user is redirected to the login page
-            if ($authorization->hasQueryParam('max_age') && null !== $userAccount->getLastLoginAt() && time() - $userAccount->getLastLoginAt()->getTimestamp() > (int) $authorization->getQueryParam('max_age')) {
+            if ($authorization->hasQueryParam('max_age') && null !== $userAccount->getLastLoginAt() && time() - $userAccount->getLastLoginAt()->getTimestamp() <= (int) $authorization->getQueryParam('max_age')) {
                 //FIXME: check if the client has a default_max_age parameter
                 throw new RedirectToLoginPageException($authorization);
             }
         }
         return $authorization;
     }

1085) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/UserAccountDiscovery/MaxAgeParameterChecker.php:31    [M] LogicalAnd

--- Original
+++ New
@@ @@
             // Whatever the prompt is, if the max_age constraint is not satisfied, the user is redirected to the login page
-            if ($authorization->hasQueryParam('max_age') && null !== $userAccount->getLastLoginAt() && time() - $userAccount->getLastLoginAt()->getTimestamp() > (int) $authorization->getQueryParam('max_age')) {
+            if ($authorization->hasQueryParam('max_age') && null !== $userAccount->getLastLoginAt() || time() - $userAccount->getLastLoginAt()->getTimestamp() > (int) $authorization->getQueryParam('max_age')) {
                 //FIXME: check if the client has a default_max_age parameter
                 throw new RedirectToLoginPageException($authorization);
             }
         }
         return $authorization;
     }

1087) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/UserAccountDiscovery/PromptNoneParameterChecker.php:30    [M] Identical

--- Original
+++ New
@@ @@
         $userAccount = $authorization->getUserAccount();
-        if (null === $userAccount && $authorization->hasPrompt('none')) {
+        if (null !== $userAccount && $authorization->hasPrompt('none')) {
             throw new CreateRedirectionException($authorization, OAuth2Exception::ERROR_LOGIN_REQUIRED, 'The resource owner is not logged in.');
         }
         return $authorization;
     }
 }

1088) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/UserAccountDiscovery/PromptNoneParameterChecker.php:30    [M] LogicalAnd

--- Original
+++ New
@@ @@
         $userAccount = $authorization->getUserAccount();
-        if (null === $userAccount && $authorization->hasPrompt('none')) {
+        if (null === $userAccount || $authorization->hasPrompt('none')) {
             throw new CreateRedirectionException($authorization, OAuth2Exception::ERROR_LOGIN_REQUIRED, 'The resource owner is not logged in.');
         }
         return $authorization;
     }
 }

1090) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/UserAccountDiscovery/UserAccountDiscoveryManager.php:29    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function add(UserAccountDiscovery $extension)
+    protected function add(UserAccountDiscovery $extension)
     {
         $this->extensions[] = $extension;
     }
     /**
      * @param ServerRequestInterface $request
      * @param Authorization          $authorization

1091) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/UserAccountDiscovery/UserAccountDiscoveryManager.php:42    [M] OneZeroInteger

--- Original
+++ New
@@ @@
     {
-        return call_user_func($this->callableForNextRule(0), $request, $authorization);
+        return call_user_func($this->callableForNextRule(1), $request, $authorization);
     }
     /**
      * @param int $index
      *
      * @return \Closure
      */

1092) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/UserAccountDiscovery/UserAccountDiscoveryManager.php:40    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function find(ServerRequestInterface $request, Authorization $authorization) : Authorization
+    protected function find(ServerRequestInterface $request, Authorization $authorization) : Authorization
     {
         return call_user_func($this->callableForNextRule(0), $request, $authorization);
     }
     /**
      * @param int $index
      *

1093) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/UserAccountDiscovery/UserAccountDiscoveryManager.php:52    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!isset($this->extensions[$index])) {
+        if (isset($this->extensions[$index])) {
             return function (ServerRequestInterface $request, Authorization $authorization) : Authorization {
                 return $authorization;
             };
         }
         $extension = $this->extensions[$index];
         return function (ServerRequestInterface $request, Authorization $authorization) use($extension, $index) : Authorization {

1094) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/UserAccountDiscovery/UserAccountDiscoveryManager.php:60    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         return function (ServerRequestInterface $request, Authorization $authorization) use($extension, $index) : Authorization {
-            return $extension->find($request, $authorization, $this->callableForNextRule($index + 1));
+            return $extension->find($request, $authorization, $this->callableForNextRule($index + 0));
         };
     }
 }

1095) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/AuthorizationEndpoint/UserAccountDiscovery/UserAccountDiscoveryManager.php:60    [M] Plus

--- Original
+++ New
@@ @@
         return function (ServerRequestInterface $request, Authorization $authorization) use($extension, $index) : Authorization {
-            return $extension->find($request, $authorization, $this->callableForNextRule($index + 1));
+            return $extension->find($request, $authorization, $this->callableForNextRule($index - 1));
         };
     }
 }

1096) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/BearerTokenType/BearerToken.php:134    [M] FalseValue

--- Original
+++ New
@@ @@
         if (!$accessToken->hasParameter('token_type')) {
-            return false;
+            return true;
         }
         return $accessToken->getParameter('token_type') === $this->name();
     }
     /**
      * Get the token from the authorization header.
      *

1105) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/AccessToken/AccessTokenTypeHint.php:74    [M] FalseValue

--- Original
+++ New
@@ @@
         if (!$token instanceof AccessToken || true === $token->isRevoked()) {
-            return ['active' => false];
+            return ['active' => true];
         }
         $values = ['active' => !$token->hasExpired(), 'client_id' => $token->getClientId(), 'resource_owner' => $token->getResourceOwnerId(), 'expires_in' => $token->getExpiresIn()];
         if (!empty($token->getScopes())) {
             $values['scope'] = implode(' ', $token->getScopes());
         }
         return $values + $token->getParameters()->all();

1111) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Client.php:174    [M] LogicalNot

--- Original
+++ New
@@ @@
         $grant_types = $this->has('grant_types') ? $this->get('grant_types') : [];
-        if (!is_array($grant_types)) {
+        if (is_array($grant_types)) {
             throw new \InvalidArgumentException('The metadata "grant_types" must be an array.');
         }
         return in_array($grant_type, $grant_types);
     }
     /**
      * @param string $response_type

1112) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Client.php:171    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function isGrantTypeAllowed(string $grant_type) : bool
+    protected function isGrantTypeAllowed(string $grant_type) : bool
     {
         $grant_types = $this->has('grant_types') ? $this->get('grant_types') : [];
         if (!is_array($grant_types)) {
             throw new \InvalidArgumentException('The metadata "grant_types" must be an array.');
         }
         return in_array($grant_type, $grant_types);

1113) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Client.php:189    [M] LogicalNot

--- Original
+++ New
@@ @@
         $response_types = $this->has('response_types') ? $this->get('response_types') : [];
-        if (!is_array($response_type)) {
+        if (is_array($response_type)) {
             throw new \InvalidArgumentException('The metadata "response_types" must be an array.');
         }
         return in_array($response_type, $response_types);
     }
     /**
      * @param string $token_type

1114) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Client.php:186    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function isResponseTypeAllowed(string $response_type) : bool
+    protected function isResponseTypeAllowed(string $response_type) : bool
     {
         $response_types = $this->has('response_types') ? $this->get('response_types') : [];
         if (!is_array($response_type)) {
             throw new \InvalidArgumentException('The metadata "response_types" must be an array.');
         }
         return in_array($response_type, $response_types);

1115) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Client.php:203    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$this->has('token_types')) {
+        if ($this->has('token_types')) {
             return true;
         }
         $token_types = $this->get('token_types');
         if (!is_array($token_types)) {
             throw new \InvalidArgumentException('The metadata "token_types" must be an array.');
         }

1116) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Client.php:204    [M] TrueValue

--- Original
+++ New
@@ @@
         if (!$this->has('token_types')) {
-            return true;
+            return false;
         }
         $token_types = $this->get('token_types');
         if (!is_array($token_types)) {
             throw new \InvalidArgumentException('The metadata "token_types" must be an array.');
         }
         return in_array($token_type, $token_types);

1117) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Client.php:207    [M] LogicalNot

--- Original
+++ New
@@ @@
         $token_types = $this->get('token_types');
-        if (!is_array($token_types)) {
+        if (is_array($token_types)) {
             throw new \InvalidArgumentException('The metadata "token_types" must be an array.');
         }
         return in_array($token_type, $token_types);
     }
     /**
      * @return bool

1118) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Client.php:201    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function isTokenTypeAllowed(string $token_type) : bool
+    protected function isTokenTypeAllowed(string $token_type) : bool
     {
         if (!$this->has('token_types')) {
             return true;
         }
         $token_types = $this->get('token_types');
         if (!is_array($token_types)) {

1120) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Client.php:237    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function getClientCredentialsExpiresAt() : int
+    protected function getClientCredentialsExpiresAt() : int
     {
         if ($this->has('client_secret_expires_at')) {
             return $this->get('client_secret_expires_at');
         }
         return 0;
     }

1121) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Client.php:251    [M] OneZeroInteger

--- Original
+++ New
@@ @@
     {
-        if (0 === $this->getClientCredentialsExpiresAt()) {
+        if (1 === $this->getClientCredentialsExpiresAt()) {
             return false;
         }
         return time() > $this->getClientCredentialsExpiresAt();
     }
     /**
      * @return bool

1122) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Client.php:251    [M] Identical

--- Original
+++ New
@@ @@
     {
-        if (0 === $this->getClientCredentialsExpiresAt()) {
+        if (0 !== $this->getClientCredentialsExpiresAt()) {
             return false;
         }
         return time() > $this->getClientCredentialsExpiresAt();
     }
     /**
      * @return bool

1123) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Client.php:252    [M] FalseValue

--- Original
+++ New
@@ @@
         if (0 === $this->getClientCredentialsExpiresAt()) {
-            return false;
+            return true;
         }
         return time() > $this->getClientCredentialsExpiresAt();
     }
     /**
      * @return bool
      */

1124) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Client.php:255    [M] GreaterThan

--- Original
+++ New
@@ @@
         }
-        return time() > $this->getClientCredentialsExpiresAt();
+        return time() >= $this->getClientCredentialsExpiresAt();
     }
     /**
      * @return bool
      */
     public function hasPublicKeySet() : bool
     {

1125) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Client.php:255    [M] GreaterThanNegotiation

--- Original
+++ New
@@ @@
         }
-        return time() > $this->getClientCredentialsExpiresAt();
+        return time() <= $this->getClientCredentialsExpiresAt();
     }
     /**
      * @return bool
      */
     public function hasPublicKeySet() : bool
     {

1126) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Client.php:249    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function areClientCredentialsExpired() : bool
+    protected function areClientCredentialsExpired() : bool
     {
         if (0 === $this->getClientCredentialsExpiresAt()) {
             return false;
         }
         return time() > $this->getClientCredentialsExpiresAt();
     }

1127) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Client.php:289    [M] Identical

--- Original
+++ New
@@ @@
             $key = JWK::create(['kty' => 'oct', 'use' => 'sig', 'k' => $this->get('client_secret')]);
-            if (null === $jwkset) {
+            if (null !== $jwkset) {
                 $jwkset = JWKSet::createFromKeys([]);
                 $jwkset = $jwkset->with($key);
                 return $jwkset;
             } else {
                 $jwkset = $jwkset->with($key);
             }

1137) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/RuleManager.php:33    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function add(Rule $rule) : self
+    protected function add(Rule $rule) : self
     {
         $this->rules[] = $rule;
         return $this;
     }
     /**
      * @return Rule[]

1139) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/RuleManager.php:74    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         return function (ClientId $clientId, DataBag $commandParameters, DataBag $validatedParameters) use($rule, $index) : DataBag {
-            return $rule->handle($clientId, $commandParameters, $validatedParameters, $this->callableForNextRule($index + 1));
+            return $rule->handle($clientId, $commandParameters, $validatedParameters, $this->callableForNextRule($index + 0));
         };
     }
 }

1140) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/RuleManager.php:74    [M] Plus

--- Original
+++ New
@@ @@
         return function (ClientId $clientId, DataBag $commandParameters, DataBag $validatedParameters) use($rule, $index) : DataBag {
-            return $rule->handle($clientId, $commandParameters, $validatedParameters, $this->callableForNextRule($index + 1));
+            return $rule->handle($clientId, $commandParameters, $validatedParameters, $this->callableForNextRule($index - 1));
         };
     }
 }

1141) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/ScopeRule.php:42    [M] LogicalNot

--- Original
+++ New
@@ @@
             $defaultScope = $commandParameters->get('scope');
-            if (!is_string($defaultScope)) {
+            if (is_string($defaultScope)) {
                 throw new \InvalidArgumentException('The parameter "scope" must be a string.');
             }
             if (1 !== preg_match('/^[\\x20\\x23-\\x5B\\x5D-\\x7E]+$/', $defaultScope)) {
                 throw new \InvalidArgumentException('Invalid characters found in the "scope" parameter.');
             }
             $validatedParameters = $validatedParameters->with('scope', $commandParameters->get('scope'));
