1146) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/SectorIdentifierUriRule.php:67    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         $allowedProtocols = ['https'];
-        Assertion::inArray(mb_substr($url, 0, mb_strpos($url, '://', 0, '8bit'), '8bit'), $allowedProtocols, sprintf('The provided sector identifier URI is not valid: scheme must be one of the following: %s.', implode(', ', $allowedProtocols)));
+        Assertion::inArray(mb_substr($url, 1, mb_strpos($url, '://', 0, '8bit'), '8bit'), $allowedProtocols, sprintf('The provided sector identifier URI is not valid: scheme must be one of the following: %s.', implode(', ', $allowedProtocols)));
         $request = $this->responseFactory->createRequest('GET', $url);
         $response = $this->client->sendRequest($request);
         Assertion::eq(200, $response->getStatusCode(), sprintf('Unable to get Uris from the Sector Identifier Uri "%s".', $url));
         $body = $response->getBody()->getContents();
         $data = json_decode($body, true);
         Assertion::isArray($data, 'The provided sector identifier URI is not valid: bad response.');

1147) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/SectorIdentifierUriRule.php:67    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         $allowedProtocols = ['https'];
-        Assertion::inArray(mb_substr($url, 0, mb_strpos($url, '://', 0, '8bit'), '8bit'), $allowedProtocols, sprintf('The provided sector identifier URI is not valid: scheme must be one of the following: %s.', implode(', ', $allowedProtocols)));
+        Assertion::inArray(mb_substr($url, 0, mb_strpos($url, '://', 1, '8bit'), '8bit'), $allowedProtocols, sprintf('The provided sector identifier URI is not valid: scheme must be one of the following: %s.', implode(', ', $allowedProtocols)));
         $request = $this->responseFactory->createRequest('GET', $url);
         $response = $this->client->sendRequest($request);
         Assertion::eq(200, $response->getStatusCode(), sprintf('Unable to get Uris from the Sector Identifier Uri "%s".', $url));
         $body = $response->getBody()->getContents();
         $data = json_decode($body, true);
         Assertion::isArray($data, 'The provided sector identifier URI is not valid: bad response.');

1148) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/SectorIdentifierUriRule.php:73    [M] TrueValue

--- Original
+++ New
@@ @@
         $body = $response->getBody()->getContents();
-        $data = json_decode($body, true);
+        $data = json_decode($body, false);
         Assertion::isArray($data, 'The provided sector identifier URI is not valid: bad response.');
         Assertion::notEmpty($data, 'The provided sector identifier URI is not valid: it must contain at least one URI.');
         foreach ($data as $sector_url) {
             Assertion::url($sector_url, 'The provided sector identifier URI is not valid: it must contain only URIs.');
             Assertion::inArray(mb_substr($sector_url, 0, mb_strpos($sector_url, '://', 0, '8bit'), '8bit'), $allowedProtocols, sprintf('An URL provided in the sector identifier URI is not valid: scheme must be one of the following: %s.', implode(', ', $allowedProtocols)));
         }

1149) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/SectorIdentifierUriRule.php:78    [M] OneZeroInteger

--- Original
+++ New
@@ @@
             Assertion::url($sector_url, 'The provided sector identifier URI is not valid: it must contain only URIs.');
-            Assertion::inArray(mb_substr($sector_url, 0, mb_strpos($sector_url, '://', 0, '8bit'), '8bit'), $allowedProtocols, sprintf('An URL provided in the sector identifier URI is not valid: scheme must be one of the following: %s.', implode(', ', $allowedProtocols)));
+            Assertion::inArray(mb_substr($sector_url, 1, mb_strpos($sector_url, '://', 0, '8bit'), '8bit'), $allowedProtocols, sprintf('An URL provided in the sector identifier URI is not valid: scheme must be one of the following: %s.', implode(', ', $allowedProtocols)));
         }
     }
 }

1150) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/SectorIdentifierUriRule.php:78    [M] OneZeroInteger

--- Original
+++ New
@@ @@
             Assertion::url($sector_url, 'The provided sector identifier URI is not valid: it must contain only URIs.');
-            Assertion::inArray(mb_substr($sector_url, 0, mb_strpos($sector_url, '://', 0, '8bit'), '8bit'), $allowedProtocols, sprintf('An URL provided in the sector identifier URI is not valid: scheme must be one of the following: %s.', implode(', ', $allowedProtocols)));
+            Assertion::inArray(mb_substr($sector_url, 0, mb_strpos($sector_url, '://', 1, '8bit'), '8bit'), $allowedProtocols, sprintf('An URL provided in the sector identifier URI is not valid: scheme must be one of the following: %s.', implode(', ', $allowedProtocols)));
         }
     }
 }

1151) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/SectorIdentifierUriRule.php:76    [M] Foreach_

--- Original
+++ New
@@ @@
         Assertion::notEmpty($data, 'The provided sector identifier URI is not valid: it must contain at least one URI.');
-        foreach ($data as $sector_url) {
+        foreach (array() as $sector_url) {
             Assertion::url($sector_url, 'The provided sector identifier URI is not valid: it must contain only URIs.');
             Assertion::inArray(mb_substr($sector_url, 0, mb_strpos($sector_url, '://', 0, '8bit'), '8bit'), $allowedProtocols, sprintf('An URL provided in the sector identifier URI is not valid: scheme must be one of the following: %s.', implode(', ', $allowedProtocols)));
         }
     }
 }

1152) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/SoftwareRule.php:60    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function isSoftwareStatementRequired() : bool
+    protected function isSoftwareStatementRequired() : bool
     {
         return $this->isSoftwareStatementRequired;
     }
     /**
      * {@inheritdoc}
      */

1153) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/SoftwareRule.php:70    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        Assertion::false($this->isSoftwareStatementRequired() && !$commandParameters->has('software_statement'), 'The parameter "software_statement" is mandatory.');
+        Assertion::false($this->isSoftwareStatementRequired() && $commandParameters->has('software_statement'), 'The parameter "software_statement" is mandatory.');
         if ($commandParameters->has('software_statement')) {
             $statement = $commandParameters->get('software_statement');
             Assertion::string($statement, 'The software statement should be a string.');
             $software_statement = $this->loadSoftwareStatement($statement);
             $validatedParameters = $validatedParameters->with('software_statement', $commandParameters->get('software_statement'));
         } else {

1154) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/SoftwareRule.php:70    [M] LogicalAnd

--- Original
+++ New
@@ @@
     {
-        Assertion::false($this->isSoftwareStatementRequired() && !$commandParameters->has('software_statement'), 'The parameter "software_statement" is mandatory.');
+        Assertion::false($this->isSoftwareStatementRequired() || !$commandParameters->has('software_statement'), 'The parameter "software_statement" is mandatory.');
         if ($commandParameters->has('software_statement')) {
             $statement = $commandParameters->get('software_statement');
             Assertion::string($statement, 'The software statement should be a string.');
             $software_statement = $this->loadSoftwareStatement($statement);
             $validatedParameters = $validatedParameters->with('software_statement', $commandParameters->get('software_statement'));
         } else {

1155) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/SoftwareRule.php:80    [M] Foreach_

--- Original
+++ New
@@ @@
         }
-        foreach (['software_id', 'software_version'] as $key) {
+        foreach (array() as $key) {
             if ($commandParameters->has($key)) {
                 $validatedParameters = $validatedParameters->with($key, $commandParameters->get($key));
             }
         }
         $validatedParameters = $next($clientId, $commandParameters, $validatedParameters);
         $validatedParameters = $validatedParameters->withParameters($software_statement);

1157) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/SoftwareRule.php:103    [M] TrueValue

--- Original
+++ New
@@ @@
             Assertion::inArray($jws->getSignature($signatureVerified)->getProtectedHeader('alg'), $this->allowedSignatureAlgorithms);
-            $claims = json_decode($jws->getPayload(), true);
+            $claims = json_decode($jws->getPayload(), false);
             Assertion::isArray($claims, 'Invalid Software Statement.');
             return $claims;
         } catch (\Exception $e) {
             throw new \InvalidArgumentException('Invalid Software Statement.', $e->getCode(), $e);
         }
     }

1159) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/TokenEndpointAuthenticationMethodEndpointRule.php:42    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$commandParameters->has('token_endpoint_auth_method')) {
+        if ($commandParameters->has('token_endpoint_auth_method')) {
             $commandParameters = $commandParameters->with('token_endpoint_auth_method', 'client_secret_basic');
         }
         Assertion::string($commandParameters->get('token_endpoint_auth_method'), 'The parameter "token_endpoint_auth_method" must be a string.');
         $tokenEndpointAuthenticationMethod = $this->tokenEndpointAuthenticationMethodManager->get($commandParameters->get('token_endpoint_auth_method'));
         $validatedParameters = $tokenEndpointAuthenticationMethod->checkClientConfiguration($commandParameters, $validatedParameters);

1161) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/UserinfoEndpointAlgorithmsRule.php:50    [M] NotIdentical

--- Original
+++ New
@@ @@
     {
-        if ($commandParameters->has('userinfo_signed_response_alg') && null !== $this->jwsBuilder) {
+        if ($commandParameters->has('userinfo_signed_response_alg') && null === $this->jwsBuilder) {
             $this->checkAlgorithms('userinfo_signed_response_alg', $commandParameters, $this->jwsBuilder->getSignatureAlgorithmManager()->list());
             $validatedParameters = $validatedParameters->with('userinfo_signed_response_alg', $commandParameters->get('userinfo_signed_response_alg'));
         }
         if ($commandParameters->has('userinfo_encrypted_response_alg') && $commandParameters->has('userinfo_encrypted_response_enc') && null !== $this->jweBuilder) {
             $this->checkAlgorithms('userinfo_encrypted_response_alg', $commandParameters, $this->jwsBuilder->getSignatureAlgorithmManager()->list());
             $validatedParameters = $validatedParameters->with('userinfo_encrypted_response_alg', $commandParameters->get('userinfo_encrypted_response_alg'));

1162) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/UserinfoEndpointAlgorithmsRule.php:50    [M] LogicalAnd

--- Original
+++ New
@@ @@
     {
-        if ($commandParameters->has('userinfo_signed_response_alg') && null !== $this->jwsBuilder) {
+        if ($commandParameters->has('userinfo_signed_response_alg') || null !== $this->jwsBuilder) {
             $this->checkAlgorithms('userinfo_signed_response_alg', $commandParameters, $this->jwsBuilder->getSignatureAlgorithmManager()->list());
             $validatedParameters = $validatedParameters->with('userinfo_signed_response_alg', $commandParameters->get('userinfo_signed_response_alg'));
         }
         if ($commandParameters->has('userinfo_encrypted_response_alg') && $commandParameters->has('userinfo_encrypted_response_enc') && null !== $this->jweBuilder) {
             $this->checkAlgorithms('userinfo_encrypted_response_alg', $commandParameters, $this->jwsBuilder->getSignatureAlgorithmManager()->list());
             $validatedParameters = $validatedParameters->with('userinfo_encrypted_response_alg', $commandParameters->get('userinfo_encrypted_response_alg'));

1163) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/UserinfoEndpointAlgorithmsRule.php:55    [M] LogicalAnd

--- Original
+++ New
@@ @@
         }
-        if ($commandParameters->has('userinfo_encrypted_response_alg') && $commandParameters->has('userinfo_encrypted_response_enc') && null !== $this->jweBuilder) {
+        if (($commandParameters->has('userinfo_encrypted_response_alg') || $commandParameters->has('userinfo_encrypted_response_enc')) && null !== $this->jweBuilder) {
             $this->checkAlgorithms('userinfo_encrypted_response_alg', $commandParameters, $this->jwsBuilder->getSignatureAlgorithmManager()->list());
             $validatedParameters = $validatedParameters->with('userinfo_encrypted_response_alg', $commandParameters->get('userinfo_encrypted_response_alg'));
             $this->checkAlgorithms('userinfo_encrypted_response_enc', $commandParameters, $this->jwsBuilder->getSignatureAlgorithmManager()->list());
             $validatedParameters = $validatedParameters->with('userinfo_encrypted_response_enc', $commandParameters->get('userinfo_encrypted_response_enc'));
         }
         return $next($clientId, $commandParameters, $validatedParameters);

1164) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/UserinfoEndpointAlgorithmsRule.php:55    [M] NotIdentical

--- Original
+++ New
@@ @@
         }
-        if ($commandParameters->has('userinfo_encrypted_response_alg') && $commandParameters->has('userinfo_encrypted_response_enc') && null !== $this->jweBuilder) {
+        if ($commandParameters->has('userinfo_encrypted_response_alg') && $commandParameters->has('userinfo_encrypted_response_enc') && null === $this->jweBuilder) {
             $this->checkAlgorithms('userinfo_encrypted_response_alg', $commandParameters, $this->jwsBuilder->getSignatureAlgorithmManager()->list());
             $validatedParameters = $validatedParameters->with('userinfo_encrypted_response_alg', $commandParameters->get('userinfo_encrypted_response_alg'));
             $this->checkAlgorithms('userinfo_encrypted_response_enc', $commandParameters, $this->jwsBuilder->getSignatureAlgorithmManager()->list());
             $validatedParameters = $validatedParameters->with('userinfo_encrypted_response_enc', $commandParameters->get('userinfo_encrypted_response_enc'));
         }
         return $next($clientId, $commandParameters, $validatedParameters);

1165) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/UserinfoEndpointAlgorithmsRule.php:55    [M] LogicalAnd

--- Original
+++ New
@@ @@
         }
-        if ($commandParameters->has('userinfo_encrypted_response_alg') && $commandParameters->has('userinfo_encrypted_response_enc') && null !== $this->jweBuilder) {
+        if ($commandParameters->has('userinfo_encrypted_response_alg') && $commandParameters->has('userinfo_encrypted_response_enc') || null !== $this->jweBuilder) {
             $this->checkAlgorithms('userinfo_encrypted_response_alg', $commandParameters, $this->jwsBuilder->getSignatureAlgorithmManager()->list());
             $validatedParameters = $validatedParameters->with('userinfo_encrypted_response_alg', $commandParameters->get('userinfo_encrypted_response_alg'));
             $this->checkAlgorithms('userinfo_encrypted_response_enc', $commandParameters, $this->jwsBuilder->getSignatureAlgorithmManager()->list());
             $validatedParameters = $validatedParameters->with('userinfo_encrypted_response_enc', $commandParameters->get('userinfo_encrypted_response_enc'));
         }
         return $next($clientId, $commandParameters, $validatedParameters);

1170) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/UserParametersRule.php:28    [M] LogicalNot

--- Original
+++ New
@@ @@
             $require_auth_time = $commandParameters->get('require_auth_time');
-            if (!is_bool($require_auth_time)) {
+            if (is_bool($require_auth_time)) {
                 throw new \InvalidArgumentException('The parameter "require_auth_time" must be a boolean.');
             }
             $validatedParameters = $validatedParameters->with('require_auth_time', $require_auth_time);
         }
         if ($commandParameters->has('default_max_age')) {
             $default_max_age = $commandParameters->get('default_max_age');

1171) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/UserParametersRule.php:35    [M] LogicalNot

--- Original
+++ New
@@ @@
             $default_max_age = $commandParameters->get('default_max_age');
-            if (!is_int($default_max_age) || $default_max_age < 0) {
+            if (is_int($default_max_age) || $default_max_age < 0) {
                 throw new \InvalidArgumentException('The parameter "default_max_age" must be a positive integer.');
             }
             $validatedParameters = $validatedParameters->with('default_max_age', $default_max_age);
         }
         if ($commandParameters->has('default_acr_values')) {
             $default_acr_values = $commandParameters->get('default_acr_values');

1172) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/UserParametersRule.php:35    [M] OneZeroInteger

--- Original
+++ New
@@ @@
             $default_max_age = $commandParameters->get('default_max_age');
-            if (!is_int($default_max_age) || $default_max_age < 0) {
+            if (!is_int($default_max_age) || $default_max_age < 1) {
                 throw new \InvalidArgumentException('The parameter "default_max_age" must be a positive integer.');
             }
             $validatedParameters = $validatedParameters->with('default_max_age', $default_max_age);
         }
         if ($commandParameters->has('default_acr_values')) {
             $default_acr_values = $commandParameters->get('default_acr_values');

1173) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/UserParametersRule.php:35    [M] LessThan

--- Original
+++ New
@@ @@
             $default_max_age = $commandParameters->get('default_max_age');
-            if (!is_int($default_max_age) || $default_max_age < 0) {
+            if (!is_int($default_max_age) || $default_max_age <= 0) {
                 throw new \InvalidArgumentException('The parameter "default_max_age" must be a positive integer.');
             }
             $validatedParameters = $validatedParameters->with('default_max_age', $default_max_age);
         }
         if ($commandParameters->has('default_acr_values')) {
             $default_acr_values = $commandParameters->get('default_acr_values');

1174) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/UserParametersRule.php:35    [M] LessThanNegotiation

--- Original
+++ New
@@ @@
             $default_max_age = $commandParameters->get('default_max_age');
-            if (!is_int($default_max_age) || $default_max_age < 0) {
+            if (!is_int($default_max_age) || $default_max_age >= 0) {
                 throw new \InvalidArgumentException('The parameter "default_max_age" must be a positive integer.');
             }
             $validatedParameters = $validatedParameters->with('default_max_age', $default_max_age);
         }
         if ($commandParameters->has('default_acr_values')) {
             $default_acr_values = $commandParameters->get('default_acr_values');

1175) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Client/Rule/UserParametersRule.php:35    [M] LogicalOr

--- Original
+++ New
@@ @@
             $default_max_age = $commandParameters->get('default_max_age');
-            if (!is_int($default_max_age) || $default_max_age < 0) {
+            if (!is_int($default_max_age) && $default_max_age < 0) {
                 throw new \InvalidArgumentException('The parameter "default_max_age" must be a positive integer.');
             }
             $validatedParameters = $validatedParameters->with('default_max_age', $default_max_age);
         }
         if ($commandParameters->has('default_acr_values')) {
             $default_acr_values = $commandParameters->get('default_acr_values');

1177) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Event/Event.php:52    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function getEventId() : EventId
+    protected function getEventId() : EventId
     {
         return $this->eventId;
     }
     /**
      * @return mixed
      */

1178) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Event/Event.php:60    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public abstract function getPayload();
+    protected abstract function getPayload();
     /**
      * @return Id
      */
     public abstract function getDomainId() : Id;
     /**
      * @return \DateTimeImmutable

1179) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Event/Event.php:65    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public abstract function getDomainId() : Id;
+    protected abstract function getDomainId() : Id;
     /**
      * @return \DateTimeImmutable
      */
     public function getRecordedOn() : \DateTimeImmutable
     {
         return $this->recordedOn;

1180) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Event/Event.php:70    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function getRecordedOn() : \DateTimeImmutable
+    protected function getRecordedOn() : \DateTimeImmutable
     {
         return $this->recordedOn;
     }
     /**
      * @return string
      */

1181) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Event/Event.php:96    [M] NotIdentical

--- Original
+++ New
@@ @@
         $payload = $this->getPayload();
-        if (null !== $payload) {
+        if (null === $payload) {
             $data['payload'] = $payload;
         }
         return $data;
     }
 }

1183) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Response/Factory/AccessDeniedResponseFactory.php:27    [M] IntegerNegation

--- Original
+++ New
@@ @@
     {
-        return 403;
+        return -403;
     }
     /**
      * {@inheritdoc}
      */
     public function createResponse(array $data, ResponseInterface &$response) : OAuth2ResponseInterface
     {

1184) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Response/Factory/AccessDeniedResponseFactory.php:25    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function getSupportedCode() : int
+    protected function getSupportedCode() : int
     {
         return 403;
     }
     /**
      * {@inheritdoc}
      */

1185) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Response/Factory/AccessDeniedResponseFactory.php:33    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function createResponse(array $data, ResponseInterface &$response) : OAuth2ResponseInterface
+    protected function createResponse(array $data, ResponseInterface &$response) : OAuth2ResponseInterface
     {
         return new OAuth2Error(403, $data, $response);
     }
 }

1186) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Response/Factory/AuthenticateResponse.php:42    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
      */
-    protected function getHeaders() : array
+    private function getHeaders() : array
     {
         $headers = parent::getHeaders();
         unset($headers['Content-Type']);
         $schemes = $this->computeSchemes($this->getData());
         $headers['WWW-Authenticate'] = $schemes;
         return $headers;

1187) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Response/Factory/AuthenticateResponse.php:56    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
      */
-    protected function getBody() : string
+    private function getBody() : string
     {
         return '';
     }
     /**
      * @param array $data
      *

1188) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Response/Factory/AuthenticateResponse.php:69    [M] Foreach_

--- Original
+++ New
@@ @@
         $schemes = [];
-        foreach ($this->schemes as $id => $scheme) {
+        foreach (array() as $id => $scheme) {
             $scheme = $this->appendParameters($scheme, $data);
             $schemes[$id] = $scheme;
         }
         return $schemes;
     }
     /**

1194) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Response/Factory/AuthenticateResponse.php:89    [M] FalseValue

--- Original
+++ New
@@ @@
         foreach ($parameters as $key => $value) {
-            if (false === $add_comma) {
+            if (true === $add_comma) {
                 $add_comma = true;
                 $scheme = sprintf('%s %s=%s', $scheme, $key, $this->quote($value));
             } else {
                 $scheme = sprintf('%s,%s=%s', $scheme, $key, $this->quote($value));
             }
         }

1195) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Response/Factory/AuthenticateResponse.php:89    [M] Identical

--- Original
+++ New
@@ @@
         foreach ($parameters as $key => $value) {
-            if (false === $add_comma) {
+            if (false !== $add_comma) {
                 $add_comma = true;
                 $scheme = sprintf('%s %s=%s', $scheme, $key, $this->quote($value));
             } else {
                 $scheme = sprintf('%s,%s=%s', $scheme, $key, $this->quote($value));
             }
         }

1198) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Response/Factory/AuthenticateResponseFactory.php:26    [M] IntegerNegation

--- Original
+++ New
@@ @@
     {
-        return 401;
+        return -401;
     }
     /**
      * {@inheritdoc}
      */
     public function createResponse(array $data, ResponseInterface &$response) : OAuth2ResponseInterface
     {

1201) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Response/Factory/BadRequestResponseFactory.php:27    [M] IntegerNegation

--- Original
+++ New
@@ @@
     {
-        return 400;
+        return -400;
     }
     /**
      * {@inheritdoc}
      */
     public function createResponse(array $data, ResponseInterface &$response) : OAuth2ResponseInterface
     {

1204) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Response/Factory/MethodNotAllowedResponseFactory.php:27    [M] IntegerNegation

--- Original
+++ New
@@ @@
     {
-        return 405;
+        return -405;
     }
     /**
      * {@inheritdoc}
      */
     public function createResponse(array $data, ResponseInterface &$response) : OAuth2ResponseInterface
     {

1207) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Response/Factory/NotImplementedResponseFactory.php:27    [M] IntegerNegation

--- Original
+++ New
@@ @@
     {
-        return 501;
+        return -501;
     }
     /**
      * {@inheritdoc}
      */
     public function createResponse(array $data, ResponseInterface &$response) : OAuth2ResponseInterface
     {

1210) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Response/Factory/RedirectResponseFactory.php:28    [M] IntegerNegation

--- Original
+++ New
@@ @@
     {
-        return 302;
+        return -302;
     }
     /**
      * {@inheritdoc}
      */
     public function createResponse(array $data, ResponseInterface &$response) : OAuth2ResponseInterface
     {

1213) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Response/OAuth2RedirectError.php:51    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function getResponse() : ResponseInterface
+    protected function getResponse() : ResponseInterface
     {
         return $this->responseMode->buildResponse($this->redirectUri, $this->getData());
     }
 }

1214) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Response/OAuth2Response.php:52    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function getCode() : int
+    protected function getCode() : int
     {
         return $this->code;
     }
     /**
      * {@inheritdoc}
      */

1215) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Response/OAuth2Response.php:64    [M] Foreach_

--- Original
+++ New
@@ @@
         $this->response = $this->response->withStatus($this->getCode());
-        foreach ($this->getHeaders() as $header => $value) {
+        foreach (array() as $header => $value) {
             $this->response = $this->response->withHeader($header, $value);
         }
         return $this->response;
     }
     /**
      * @return array
