1218) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Response/OAuth2Response.php:86    [M] BitwiseOr

--- Original
+++ New
@@ @@
         $data = $this->getData();
-        return json_encode($data, JSON_UNESCAPED_UNICODE | JSON_UNESCAPED_SLASHES);
+        return json_encode($data, JSON_UNESCAPED_UNICODE & JSON_UNESCAPED_SLASHES);
     }
     /**
      * {@inheritdoc}
      */
     public function getData()
     {

1220) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Response/OAuth2Response.php:92    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function getData()
+    protected function getData()
     {
         return $this->data;
     }
 }

1221) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Response/OAuth2ResponseFactoryManager.php:52    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function addResponseFactory(ResponseFactory $responseFactory) : self
+    protected function addResponseFactory(ResponseFactory $responseFactory) : self
     {
         $this->responseFactories[$responseFactory->getSupportedCode()] = $responseFactory;
         return $this;
     }
     /**
      * @param Extension $extension

1222) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Response/OAuth2ResponseFactoryManager.php:62    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function addExtension(Extension $extension)
+    protected function addExtension(Extension $extension)
     {
         $this->extensions[] = $extension;
     }
     /**
      * @param int   $code The code of the response
      * @param array $data Data sent to the response

1224) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Response/OAuth2ResponseFactoryManager.php:73    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function getResponse(int $code, array $data) : OAuth2ResponseInterface
+    protected function getResponse(int $code, array $data) : OAuth2ResponseInterface
     {
         foreach ($this->extensions as $extension) {
             $data = $extension->process($code, $data);
         }
         $factory = $this->getResponseFactory($code);
         $response = $this->psr7responseFactory->createResponse($code);

1225) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Response/OAuth2ResponseFactoryManager.php:90    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function isResponseCodeSupported(int $code) : bool
+    protected function isResponseCodeSupported(int $code) : bool
     {
         return array_key_exists($code, $this->responseFactories);
     }
     /**
      * @param int $code
      *

1226) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Response/OAuth2ResponseFactoryManager.php:104    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$this->isResponseCodeSupported($code)) {
+        if ($this->isResponseCodeSupported($code)) {
             throw new \InvalidArgumentException(sprintf('The response code "%d" is not supported', $code));
         }
         return $this->responseFactories[$code];
     }
 }

1227) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Scope/ScopePolicyManager.php:36    [M] FalseValue

--- Original
+++ New
@@ @@
      */
-    public function add(ScopePolicy $scopePolicy, bool $isDefault = false) : self
+    public function add(ScopePolicy $scopePolicy, bool $isDefault = true) : self
     {
         $name = $scopePolicy->name();
         $this->scopePolicies[$name] = $scopePolicy;
         if (true === $isDefault || 1 === count($this->scopePolicies)) {
             $this->defaultScopePolicy = $name;
         }

1228) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Token/Token.php:80    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public abstract function getTokenId() : TokenId;
+    protected abstract function getTokenId() : TokenId;
     /**
      * @return ResourceOwnerId
      */
     public function getResourceOwnerId() : ResourceOwnerId
     {
         return $this->resourceOwnerId;

1229) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Token/Token.php:113    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         if (null === $expiresAt) {
-            return 0;
+            return 1;
         }
         return $this->expiresAt->getTimestamp() - time() < 0 ? 0 : $this->expiresAt->getTimestamp() - time();
     }
     /**
      * @return ClientId
      */

1232) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Token/Token.php:214    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$this->hasMetadata($key)) {
+        if ($this->hasMetadata($key)) {
             throw new \InvalidArgumentException(sprintf('The metadata "%s" does not exist.', $key));
         }
         return $this->metadatas->get($key);
     }
     /**
      * @return null|ResourceServerId

1233) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Core/Token/Token.php:212    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function getMetadata(string $key)
+    protected function getMetadata(string $key)
     {
         if (!$this->hasMetadata($key)) {
             throw new \InvalidArgumentException(sprintf('The metadata "%s" does not exist.', $key));
         }
         return $this->metadatas->get($key);
     }

1234) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/JwtBearerGrant/JwtBearerGrantType.php:242    [M] NotIdentical

--- Original
+++ New
@@ @@
                 $grantTypeData = $grantTypeData->withClient($client);
-            } elseif ($grantTypeData->getClient()->getPublicId()->getValue() !== $client->getPublicId()->getValue()) {
+            } elseif ($grantTypeData->getClient()->getPublicId()->getValue() === $client->getPublicId()->getValue()) {
                 throw new OAuth2Exception(401, OAuth2Exception::ERROR_INVALID_CLIENT, 'Client authentication failed.');
             }
             $grantTypeData = $grantTypeData->withResourceOwnerId($client->getPublicId());
             $allowedSignatureAlgorithms = $this->jwsVerifier->getSignatureAlgorithmManager()->list();
             $signatureKeys = $client->getPublicKeySet();
         } elseif ($this->trustedIssuerManager->has($iss)) {

1235) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/JwtBearerGrant/JwtBearerGrantType.php:262    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         if (!$jws->getSignature(0)->hasProtectedHeaderParameter('alg') || !in_array($jws->getSignature(0)->getProtectedHeaderParameter('alg'), $allowedSignatureAlgorithms)) {
-            throw new \InvalidArgumentException(sprintf('The signature algorithm "%s" is not allowed.', $jws->getSignature(0)->getProtectedHeaderParameter('alg')));
+            throw new \InvalidArgumentException(sprintf('The signature algorithm "%s" is not allowed.', $jws->getSignature(1)->getProtectedHeaderParameter('alg')));
         }
         $this->jwsVerifier->verifyWithKeySet($jws, $signatureKeys, 0);
         $grantTypeData = $grantTypeData->withMetadata('jwt', $jws);
         $grantTypeData = $grantTypeData->withMetadata('claims', $claims);
         return $grantTypeData;
     }

1236) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/JwtBearerGrant/JwtBearerGrantType.php:284    [M] NotIdentical

--- Original
+++ New
@@ @@
         $client = $this->clientRepository->find(ClientId::create($subject));
-        if (null !== $client) {
+        if (null === $client) {
             return $client->getPublicId();
         }
         return null;
     }
 }

1237) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/MacTokenType/MacToken.php:113    [M] FalseValue

--- Original
+++ New
@@ @@
         if ($accessToken->getParameter('token_type') !== $this->name()) {
-            return false;
+            return true;
         }
         foreach ($this->getParametersToCheck() as $key => $closure) {
             if (!array_key_exists($key, $additionalCredentialValues) || false === $closure($additionalCredentialValues[$key], $accessToken)) {
                 return false;
             }
         }

1238) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/MacTokenType/MacToken.php:205    [M] FalseValue

--- Original
+++ New
@@ @@
             if (!is_array($matches)) {
-                return false;
+                return true;
             }
             $values = [];
             foreach ($matches as $match) {
                 $values[$match[1]] = isset($match[4]) ? $match[4] : $match[3];
             }
             if (array_key_exists('id', $values)) {

1240) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/MetadataEndpoint/MetadataEndpoint.php:70    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function enableSignedMetadata(JWSBuilder $jwsBuilder, string $signatureAlgorithm, JWK $signatureKey)
+    protected function enableSignedMetadata(JWSBuilder $jwsBuilder, string $signatureAlgorithm, JWK $signatureKey)
     {
         $this->jwsBuilder = $jwsBuilder;
         $this->signatureKey = $signatureKey;
         $this->signatureAlgorithm = $signatureAlgorithm;
     }
     /**

1243) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/MetadataEndpoint/MetadataEndpoint.php:98    [M] NotIdentical

--- Original
+++ New
@@ @@
     {
-        return null !== $this->jwsBuilder;
+        return null === $this->jwsBuilder;
     }
     /**
      * @param array $metadata
      *
      * @return string
      */

1244) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/MetadataEndpoint/MetadataEndpoint.php:118    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         $serializer = new CompactSerializer($jsonConverter);
-        $assertion = $serializer->serialize($jws, 0);
+        $assertion = $serializer->serialize($jws, 1);
         return $assertion;
     }
 }

1245) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/AccessTokenMiddleware.php:56    [M] NotIdentical

--- Original
+++ New
@@ @@
         $token = $this->tokenTypeManager->findToken($request, $additional_credential_values, $type);
-        if (null !== $token) {
+        if (null === $token) {
             $tokenId = AccessTokenId::create($token);
             $accessToken = $this->accessTokenRepository->find($tokenId);
             if (null === $accessToken || false === $type->isTokenRequestValid($accessToken, $request, $additional_credential_values)) {
                 throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_TOKEN, 'Invalid access token.');
             }
             $request = $request->withAttribute('access_token', $accessToken);

1246) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/AccessTokenMiddleware.php:59    [M] Identical

--- Original
+++ New
@@ @@
             $accessToken = $this->accessTokenRepository->find($tokenId);
-            if (null === $accessToken || false === $type->isTokenRequestValid($accessToken, $request, $additional_credential_values)) {
+            if (null !== $accessToken || false === $type->isTokenRequestValid($accessToken, $request, $additional_credential_values)) {
                 throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_TOKEN, 'Invalid access token.');
             }
             $request = $request->withAttribute('access_token', $accessToken);
         }
         return $handler->handle($request);
     }

1247) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/AccessTokenMiddleware.php:59    [M] FalseValue

--- Original
+++ New
@@ @@
             $accessToken = $this->accessTokenRepository->find($tokenId);
-            if (null === $accessToken || false === $type->isTokenRequestValid($accessToken, $request, $additional_credential_values)) {
+            if (null === $accessToken || true === $type->isTokenRequestValid($accessToken, $request, $additional_credential_values)) {
                 throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_TOKEN, 'Invalid access token.');
             }
             $request = $request->withAttribute('access_token', $accessToken);
         }
         return $handler->handle($request);
     }

1248) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/AccessTokenMiddleware.php:59    [M] Identical

--- Original
+++ New
@@ @@
             $accessToken = $this->accessTokenRepository->find($tokenId);
-            if (null === $accessToken || false === $type->isTokenRequestValid($accessToken, $request, $additional_credential_values)) {
+            if (null === $accessToken || false !== $type->isTokenRequestValid($accessToken, $request, $additional_credential_values)) {
                 throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_TOKEN, 'Invalid access token.');
             }
             $request = $request->withAttribute('access_token', $accessToken);
         }
         return $handler->handle($request);
     }

1249) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/AccessTokenMiddleware.php:59    [M] LogicalOr

--- Original
+++ New
@@ @@
             $accessToken = $this->accessTokenRepository->find($tokenId);
-            if (null === $accessToken || false === $type->isTokenRequestValid($accessToken, $request, $additional_credential_values)) {
+            if (null === $accessToken && false === $type->isTokenRequestValid($accessToken, $request, $additional_credential_values)) {
                 throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_TOKEN, 'Invalid access token.');
             }
             $request = $request->withAttribute('access_token', $accessToken);
         }
         return $handler->handle($request);
     }

1251) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/BearerTokenMiddleware.php:56    [M] NotIdentical

--- Original
+++ New
@@ @@
         $token = $this->bearerToken->findToken($request, $additional_credential_values);
-        if (null !== $token) {
+        if (null === $token) {
             $accessToken = $this->accessTokenRepository->find(AccessTokenId::create($token));
             if (null === $accessToken || false === $this->bearerToken->isTokenRequestValid($accessToken, $request, $additional_credential_values)) {
                 throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_TOKEN, 'Invalid access token.');
             }
             $request = $request->withAttribute('access_token', $accessToken);
         }

1252) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/BearerTokenMiddleware.php:58    [M] Identical

--- Original
+++ New
@@ @@
             $accessToken = $this->accessTokenRepository->find(AccessTokenId::create($token));
-            if (null === $accessToken || false === $this->bearerToken->isTokenRequestValid($accessToken, $request, $additional_credential_values)) {
+            if (null !== $accessToken || false === $this->bearerToken->isTokenRequestValid($accessToken, $request, $additional_credential_values)) {
                 throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_TOKEN, 'Invalid access token.');
             }
             $request = $request->withAttribute('access_token', $accessToken);
         }
         return $handler->handle($request);
     }

1253) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/BearerTokenMiddleware.php:58    [M] FalseValue

--- Original
+++ New
@@ @@
             $accessToken = $this->accessTokenRepository->find(AccessTokenId::create($token));
-            if (null === $accessToken || false === $this->bearerToken->isTokenRequestValid($accessToken, $request, $additional_credential_values)) {
+            if (null === $accessToken || true === $this->bearerToken->isTokenRequestValid($accessToken, $request, $additional_credential_values)) {
                 throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_TOKEN, 'Invalid access token.');
             }
             $request = $request->withAttribute('access_token', $accessToken);
         }
         return $handler->handle($request);
     }

1254) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/BearerTokenMiddleware.php:58    [M] Identical

--- Original
+++ New
@@ @@
             $accessToken = $this->accessTokenRepository->find(AccessTokenId::create($token));
-            if (null === $accessToken || false === $this->bearerToken->isTokenRequestValid($accessToken, $request, $additional_credential_values)) {
+            if (null === $accessToken || false !== $this->bearerToken->isTokenRequestValid($accessToken, $request, $additional_credential_values)) {
                 throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_TOKEN, 'Invalid access token.');
             }
             $request = $request->withAttribute('access_token', $accessToken);
         }
         return $handler->handle($request);
     }

1255) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/BearerTokenMiddleware.php:58    [M] LogicalOr

--- Original
+++ New
@@ @@
             $accessToken = $this->accessTokenRepository->find(AccessTokenId::create($token));
-            if (null === $accessToken || false === $this->bearerToken->isTokenRequestValid($accessToken, $request, $additional_credential_values)) {
+            if (null === $accessToken && false === $this->bearerToken->isTokenRequestValid($accessToken, $request, $additional_credential_values)) {
                 throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_TOKEN, 'Invalid access token.');
             }
             $request = $request->withAttribute('access_token', $accessToken);
         }
         return $handler->handle($request);
     }

1257) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/ClientAuthenticationMiddleware.php:62    [M] NotIdentical

--- Original
+++ New
@@ @@
         $client = null;
-        if (null !== $clientId) {
+        if (null === $clientId) {
             $client = $this->clientRepository->find($clientId);
         }
         if (null !== $client && false === $this->tokenEndpointAuthenticationMethodManager->isClientAuthenticated($request, $client, $authentication_method, $client_credentials)) {
             $client = null;
         }
         if (true === $this->authenticationRequired && null === $client) {

1258) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/ClientAuthenticationMiddleware.php:65    [M] NotIdentical

--- Original
+++ New
@@ @@
         }
-        if (null !== $client && false === $this->tokenEndpointAuthenticationMethodManager->isClientAuthenticated($request, $client, $authentication_method, $client_credentials)) {
+        if (null === $client && false === $this->tokenEndpointAuthenticationMethodManager->isClientAuthenticated($request, $client, $authentication_method, $client_credentials)) {
             $client = null;
         }
         if (true === $this->authenticationRequired && null === $client) {
             throw new OAuth2Exception(401, OAuth2Exception::ERROR_INVALID_CLIENT, 'Client authentication failed.');
         }
         if (null !== $client) {

1259) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/ClientAuthenticationMiddleware.php:65    [M] FalseValue

--- Original
+++ New
@@ @@
         }
-        if (null !== $client && false === $this->tokenEndpointAuthenticationMethodManager->isClientAuthenticated($request, $client, $authentication_method, $client_credentials)) {
+        if (null !== $client && true === $this->tokenEndpointAuthenticationMethodManager->isClientAuthenticated($request, $client, $authentication_method, $client_credentials)) {
             $client = null;
         }
         if (true === $this->authenticationRequired && null === $client) {
             throw new OAuth2Exception(401, OAuth2Exception::ERROR_INVALID_CLIENT, 'Client authentication failed.');
         }
         if (null !== $client) {

1260) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/ClientAuthenticationMiddleware.php:65    [M] Identical

--- Original
+++ New
@@ @@
         }
-        if (null !== $client && false === $this->tokenEndpointAuthenticationMethodManager->isClientAuthenticated($request, $client, $authentication_method, $client_credentials)) {
+        if (null !== $client && false !== $this->tokenEndpointAuthenticationMethodManager->isClientAuthenticated($request, $client, $authentication_method, $client_credentials)) {
             $client = null;
         }
         if (true === $this->authenticationRequired && null === $client) {
             throw new OAuth2Exception(401, OAuth2Exception::ERROR_INVALID_CLIENT, 'Client authentication failed.');
         }
         if (null !== $client) {

1261) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/ClientAuthenticationMiddleware.php:65    [M] LogicalAnd

--- Original
+++ New
@@ @@
         }
-        if (null !== $client && false === $this->tokenEndpointAuthenticationMethodManager->isClientAuthenticated($request, $client, $authentication_method, $client_credentials)) {
+        if (null !== $client || false === $this->tokenEndpointAuthenticationMethodManager->isClientAuthenticated($request, $client, $authentication_method, $client_credentials)) {
             $client = null;
         }
         if (true === $this->authenticationRequired && null === $client) {
             throw new OAuth2Exception(401, OAuth2Exception::ERROR_INVALID_CLIENT, 'Client authentication failed.');
         }
         if (null !== $client) {

1262) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/ClientAuthenticationMiddleware.php:68    [M] TrueValue

--- Original
+++ New
@@ @@
         }
-        if (true === $this->authenticationRequired && null === $client) {
+        if (false === $this->authenticationRequired && null === $client) {
             throw new OAuth2Exception(401, OAuth2Exception::ERROR_INVALID_CLIENT, 'Client authentication failed.');
         }
         if (null !== $client) {
             $request = $request->withAttribute('client', $client);
         }
         return $handler->handle($request);

1263) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/ClientAuthenticationMiddleware.php:68    [M] Identical

--- Original
+++ New
@@ @@
         }
-        if (true === $this->authenticationRequired && null === $client) {
+        if (true !== $this->authenticationRequired && null === $client) {
             throw new OAuth2Exception(401, OAuth2Exception::ERROR_INVALID_CLIENT, 'Client authentication failed.');
         }
         if (null !== $client) {
             $request = $request->withAttribute('client', $client);
         }
         return $handler->handle($request);

1264) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/ClientAuthenticationMiddleware.php:68    [M] Identical

--- Original
+++ New
@@ @@
         }
-        if (true === $this->authenticationRequired && null === $client) {
+        if (true === $this->authenticationRequired && null !== $client) {
             throw new OAuth2Exception(401, OAuth2Exception::ERROR_INVALID_CLIENT, 'Client authentication failed.');
         }
         if (null !== $client) {
             $request = $request->withAttribute('client', $client);
         }
         return $handler->handle($request);

1265) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/ClientAuthenticationMiddleware.php:68    [M] LogicalAnd

--- Original
+++ New
@@ @@
         }
-        if (true === $this->authenticationRequired && null === $client) {
+        if (true === $this->authenticationRequired || null === $client) {
             throw new OAuth2Exception(401, OAuth2Exception::ERROR_INVALID_CLIENT, 'Client authentication failed.');
         }
         if (null !== $client) {
             $request = $request->withAttribute('client', $client);
         }
         return $handler->handle($request);

1266) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/ClientAuthenticationMiddleware.php:75    [M] NotIdentical

--- Original
+++ New
@@ @@
         }
-        if (null !== $client) {
+        if (null === $client) {
             $request = $request->withAttribute('client', $client);
         }
         return $handler->handle($request);
     }
 }

1268) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/FormPostBodyParserMiddleware.php:30    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         foreach ($headers as $header) {
-            if ('application/x-www-form-urlencoded' === substr($header, 0, 33)) {
+            if ('application/x-www-form-urlencoded' === substr($header, 1, 33)) {
                 $request->getBody()->rewind();
                 $body = $request->getBody()->getContents();
                 if (true === parse_str($body, $parsed)) {
                     $request = $request->withParsedBody($parsed);
                 }
             }

1269) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/FormPostBodyParserMiddleware.php:30    [M] Identical

--- Original
+++ New
@@ @@
         foreach ($headers as $header) {
-            if ('application/x-www-form-urlencoded' === substr($header, 0, 33)) {
+            if ('application/x-www-form-urlencoded' !== substr($header, 0, 33)) {
                 $request->getBody()->rewind();
                 $body = $request->getBody()->getContents();
                 if (true === parse_str($body, $parsed)) {
                     $request = $request->withParsedBody($parsed);
                 }
             }

1270) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/FormPostBodyParserMiddleware.php:33    [M] TrueValue

--- Original
+++ New
@@ @@
                 $body = $request->getBody()->getContents();
-                if (true === parse_str($body, $parsed)) {
+                if (false === parse_str($body, $parsed)) {
                     $request = $request->withParsedBody($parsed);
                 }
             }
         }
         return $handler->handle($request);
     }

1271) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/FormPostBodyParserMiddleware.php:33    [M] Identical

--- Original
+++ New
@@ @@
                 $body = $request->getBody()->getContents();
-                if (true === parse_str($body, $parsed)) {
+                if (true !== parse_str($body, $parsed)) {
                     $request = $request->withParsedBody($parsed);
                 }
             }
         }
         return $handler->handle($request);
     }

1272) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/FormPostBodyParserMiddleware.php:29    [M] Foreach_

--- Original
+++ New
@@ @@
         $headers = $request->getHeader('content-type');
-        foreach ($headers as $header) {
+        foreach (array() as $header) {
             if ('application/x-www-form-urlencoded' === substr($header, 0, 33)) {
                 $request->getBody()->rewind();
                 $body = $request->getBody()->getContents();
                 if (true === parse_str($body, $parsed)) {
                     $request = $request->withParsedBody($parsed);
                 }

1275) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/HttpMethod.php:33    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function addMiddleware(string $method, MiddlewareInterface $middleware)
+    protected function addMiddleware(string $method, MiddlewareInterface $middleware)
     {
         Assertion::keyNotExists($this->methodMap, $method, sprintf('The method \'%s\' is already defined.', $method));
         $this->methodMap[$method] = $middleware;
     }
     /**
      * {@inheritdoc}

1276) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/HttpMethod.php:46    [M] LogicalNot

--- Original
+++ New
@@ @@
         $method = $request->getMethod();
-        if (!array_key_exists($method, $this->methodMap)) {
+        if (array_key_exists($method, $this->methodMap)) {
             throw new OAuth2Exception(405, 'not_implemented', sprintf('The method \'%s\' is not supported.', $method));
         }
         $middleware = $this->methodMap[$method];
         return $middleware->process($request, $handler);
     }
 }

1278) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/HttpsError.php:29    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$this->isRequestSecured($request)) {
+        if ($this->isRequestSecured($request)) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, 'The request must be secured.');
         }
         return $handler->handle($request);
     }
     /**
      * @param \Psr\Http\Message\ServerRequestInterface $request
