1280) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/HttpsError.php:49    [M] LogicalNot

--- Original
+++ New
@@ @@
         $server_params = $request->getServerParams();
-        return !empty($server_params['HTTPS']) && 'on' === mb_strtolower($server_params['HTTPS'], '8bit');
+        return empty($server_params['HTTPS']) && 'on' === mb_strtolower($server_params['HTTPS'], '8bit');
     }
 }

1281) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/HttpsError.php:49    [M] Identical

--- Original
+++ New
@@ @@
         $server_params = $request->getServerParams();
-        return !empty($server_params['HTTPS']) && 'on' === mb_strtolower($server_params['HTTPS'], '8bit');
+        return !empty($server_params['HTTPS']) && 'on' !== mb_strtolower($server_params['HTTPS'], '8bit');
     }
 }

1282) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/HttpsError.php:49    [M] LogicalAnd

--- Original
+++ New
@@ @@
         $server_params = $request->getServerParams();
-        return !empty($server_params['HTTPS']) && 'on' === mb_strtolower($server_params['HTTPS'], '8bit');
+        return !empty($server_params['HTTPS']) || 'on' === mb_strtolower($server_params['HTTPS'], '8bit');
     }
 }

1289) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/JsonBodyParserMiddleware.php:30    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         foreach ($headers as $header) {
-            if ('application/json' === substr($header, 0, 16)) {
+            if ('application/json' === substr($header, 1, 16)) {
                 $request->getBody()->rewind();
                 $body = $request->getBody()->getContents();
                 $json = json_decode($body, true);
                 if (is_array($json)) {
                     $request = $request->withParsedBody($json);
                 }

1290) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/JsonBodyParserMiddleware.php:30    [M] Identical

--- Original
+++ New
@@ @@
         foreach ($headers as $header) {
-            if ('application/json' === substr($header, 0, 16)) {
+            if ('application/json' !== substr($header, 0, 16)) {
                 $request->getBody()->rewind();
                 $body = $request->getBody()->getContents();
                 $json = json_decode($body, true);
                 if (is_array($json)) {
                     $request = $request->withParsedBody($json);
                 }

1291) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/JsonBodyParserMiddleware.php:33    [M] TrueValue

--- Original
+++ New
@@ @@
                 $body = $request->getBody()->getContents();
-                $json = json_decode($body, true);
+                $json = json_decode($body, false);
                 if (is_array($json)) {
                     $request = $request->withParsedBody($json);
                 }
             }
         }
         return $handler->handle($request);

1295) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/OAuth2SecurityMiddleware.php:73    [M] Identical

--- Original
+++ New
@@ @@
         $token = $this->tokenTypeManager->findToken($request, $additionalCredentialValues, $type);
-        if (null === $token) {
+        if (null !== $token) {
             throw $this->getOAuth2Exception(401, OAuth2Exception::ERROR_INVALID_TOKEN, 'Access token required.');
         }
         $accessToken = $this->accessTokenHandlerManager->find(AccessTokenId::create($token));
         if (null === $accessToken) {
             throw $this->getOAuth2Exception(401, OAuth2Exception::ERROR_INVALID_TOKEN, 'Access token does not exist or is not valid.');
         }

1296) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/OAuth2SecurityMiddleware.php:77    [M] Identical

--- Original
+++ New
@@ @@
         $accessToken = $this->accessTokenHandlerManager->find(AccessTokenId::create($token));
-        if (null === $accessToken) {
+        if (null !== $accessToken) {
             throw $this->getOAuth2Exception(401, OAuth2Exception::ERROR_INVALID_TOKEN, 'Access token does not exist or is not valid.');
         }
         $this->checkAccessToken($type, $accessToken, $request, $additionalCredentialValues);
         $request = $request->withAttribute('access_token', $accessToken);
         return $handler->handle($request);
     }

1298) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/OAuth2SecurityMiddleware.php:97    [M] FalseValue

--- Original
+++ New
@@ @@
     {
-        if (false === $type->isTokenRequestValid($accessToken, $request, $additionalCredentialValues)) {
+        if (true === $type->isTokenRequestValid($accessToken, $request, $additionalCredentialValues)) {
             throw $this->getOAuth2Exception(401, OAuth2Exception::ERROR_INVALID_TOKEN, 'Access token does not exist or is not valid.');
         }
         if (true === $accessToken->hasExpired()) {
             throw $this->getOAuth2Exception(403, OAuth2Exception::ERROR_INVALID_TOKEN, 'Access token has expired.');
         }
         if (!empty($this->scope)) {

1299) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/OAuth2SecurityMiddleware.php:97    [M] Identical

--- Original
+++ New
@@ @@
     {
-        if (false === $type->isTokenRequestValid($accessToken, $request, $additionalCredentialValues)) {
+        if (false !== $type->isTokenRequestValid($accessToken, $request, $additionalCredentialValues)) {
             throw $this->getOAuth2Exception(401, OAuth2Exception::ERROR_INVALID_TOKEN, 'Access token does not exist or is not valid.');
         }
         if (true === $accessToken->hasExpired()) {
             throw $this->getOAuth2Exception(403, OAuth2Exception::ERROR_INVALID_TOKEN, 'Access token has expired.');
         }
         if (!empty($this->scope)) {

1300) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/OAuth2SecurityMiddleware.php:100    [M] TrueValue

--- Original
+++ New
@@ @@
         }
-        if (true === $accessToken->hasExpired()) {
+        if (false === $accessToken->hasExpired()) {
             throw $this->getOAuth2Exception(403, OAuth2Exception::ERROR_INVALID_TOKEN, 'Access token has expired.');
         }
         if (!empty($this->scope)) {
             $diff = array_diff($this->scope, $accessToken->getScopes());
             if (!empty($diff)) {
                 throw $this->getOAuth2Exception(403, OAuth2Exception::ERROR_INVALID_TOKEN, 'Insufficient scope.');

1301) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/OAuth2SecurityMiddleware.php:100    [M] Identical

--- Original
+++ New
@@ @@
         }
-        if (true === $accessToken->hasExpired()) {
+        if (true !== $accessToken->hasExpired()) {
             throw $this->getOAuth2Exception(403, OAuth2Exception::ERROR_INVALID_TOKEN, 'Access token has expired.');
         }
         if (!empty($this->scope)) {
             $diff = array_diff($this->scope, $accessToken->getScopes());
             if (!empty($diff)) {
                 throw $this->getOAuth2Exception(403, OAuth2Exception::ERROR_INVALID_TOKEN, 'Insufficient scope.');

1302) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/OAuth2SecurityMiddleware.php:103    [M] LogicalNot

--- Original
+++ New
@@ @@
         }
-        if (!empty($this->scope)) {
+        if (empty($this->scope)) {
             $diff = array_diff($this->scope, $accessToken->getScopes());
             if (!empty($diff)) {
                 throw $this->getOAuth2Exception(403, OAuth2Exception::ERROR_INVALID_TOKEN, 'Insufficient scope.');
             }
         }
     }

1303) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/OAuth2SecurityMiddleware.php:109    [M] LogicalNot

--- Original
+++ New
@@ @@
             $diff = array_diff($this->scope, $accessToken->getScopes());
-            if (!empty($diff)) {
+            if (empty($diff)) {
                 throw $this->getOAuth2Exception(403, OAuth2Exception::ERROR_INVALID_TOKEN, 'Insufficient scope.');
             }
         }
     }
     /**
      * @param int    $code

1304) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/OAuth2SecurityMiddleware.php:125    [M] NotIdentical

--- Original
+++ New
@@ @@
         $data = [];
-        if (null !== $this->scope) {
+        if (null === $this->scope) {
             $data['scope'] = implode(' ', $this->scope);
         }
         return new OAuth2Exception($code, $error, $errorDescription, $data);
     }
 }

1305) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/OAuth2SecurityMiddleware.php:129    [M] NewObject

--- Original
+++ New
@@ @@
         }
-        return new OAuth2Exception($code, $error, $errorDescription, $data);
+        new OAuth2Exception($code, $error, $errorDescription, $data);
+        return null;
     }
 }

1306) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/Pipe.php:43    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function appendMiddleware(MiddlewareInterface $middleware)
+    protected function appendMiddleware(MiddlewareInterface $middleware)
     {
         $this->middlewares[] = $middleware;
     }
     /**
      * Prepends new middleware for this message bus. Should only be used at configuration time.
      *

1307) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/Pipe.php:53    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function prependMiddleware(MiddlewareInterface $middleware)
+    protected function prependMiddleware(MiddlewareInterface $middleware)
     {
         array_unshift($this->middlewares, $middleware);
     }
     /**
      * @param MiddlewareInterface $middleware
      */

1308) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/Pipe.php:64    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         $count = count($this->middlewares);
-        $temp = array_slice($this->middlewares, 1, $count);
+        $temp = array_slice($this->middlewares, 0, $count);
         array_unshift($temp, $middleware);
         array_unshift($temp, $this->middlewares[0]);
         $this->middlewares = $temp;
     }
     /**
      * @param MiddlewareInterface $middleware

1309) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/Pipe.php:66    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         array_unshift($temp, $middleware);
-        array_unshift($temp, $this->middlewares[0]);
+        array_unshift($temp, $this->middlewares[1]);
         $this->middlewares = $temp;
     }
     /**
      * @param MiddlewareInterface $middleware
      */
     public function addMiddlewareBeforeLastOne(MiddlewareInterface $middleware)

1310) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/Pipe.php:61    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function addMiddlewareAfterFirstOne(MiddlewareInterface $middleware)
+    protected function addMiddlewareAfterFirstOne(MiddlewareInterface $middleware)
     {
         $count = count($this->middlewares);
         $temp = array_slice($this->middlewares, 1, $count);
         array_unshift($temp, $middleware);
         array_unshift($temp, $this->middlewares[0]);
         $this->middlewares = $temp;

1311) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/Pipe.php:76    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         $count = count($this->middlewares);
-        $temp = array_slice($this->middlewares, 0, $count - 1);
+        $temp = array_slice($this->middlewares, 1, $count - 1);
         $temp[] = $middleware;
         $temp[] = $this->middlewares[$count - 1];
         $this->middlewares = $temp;
     }
     /**
      * {@inheritdoc}

1312) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/Pipe.php:76    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         $count = count($this->middlewares);
-        $temp = array_slice($this->middlewares, 0, $count - 1);
+        $temp = array_slice($this->middlewares, 0, $count - 0);
         $temp[] = $middleware;
         $temp[] = $this->middlewares[$count - 1];
         $this->middlewares = $temp;
     }
     /**
      * {@inheritdoc}

1313) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/Pipe.php:76    [M] Minus

--- Original
+++ New
@@ @@
         $count = count($this->middlewares);
-        $temp = array_slice($this->middlewares, 0, $count - 1);
+        $temp = array_slice($this->middlewares, 0, $count + 1);
         $temp[] = $middleware;
         $temp[] = $this->middlewares[$count - 1];
         $this->middlewares = $temp;
     }
     /**
      * {@inheritdoc}

1314) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/Pipe.php:78    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         $temp[] = $middleware;
-        $temp[] = $this->middlewares[$count - 1];
+        $temp[] = $this->middlewares[$count - 0];
         $this->middlewares = $temp;
     }
     /**
      * {@inheritdoc}
      */
     public function process(ServerRequestInterface $request, RequestHandlerInterface $handler) : ResponseInterface

1315) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/Pipe.php:78    [M] Minus

--- Original
+++ New
@@ @@
         $temp[] = $middleware;
-        $temp[] = $this->middlewares[$count - 1];
+        $temp[] = $this->middlewares[$count + 1];
         $this->middlewares = $temp;
     }
     /**
      * {@inheritdoc}
      */
     public function process(ServerRequestInterface $request, RequestHandlerInterface $handler) : ResponseInterface

1316) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/Pipe.php:73    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function addMiddlewareBeforeLastOne(MiddlewareInterface $middleware)
+    protected function addMiddlewareBeforeLastOne(MiddlewareInterface $middleware)
     {
         $count = count($this->middlewares);
         $temp = array_slice($this->middlewares, 0, $count - 1);
         $temp[] = $middleware;
         $temp[] = $this->middlewares[$count - 1];
         $this->middlewares = $temp;

1318) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/Pipe.php:109    [M] OneZeroInteger

--- Original
+++ New
@@ @@
     {
-        $resolved = $this->resolve(0);
+        $resolved = $this->resolve(1);
         return $resolved->handle($request);
     }
     /**
      * @param int $index Middleware index
      *
      * @return RequestHandlerInterface

1319) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/Pipe.php:107    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function dispatch(ServerRequestInterface $request)
+    protected function dispatch(ServerRequestInterface $request)
     {
         $resolved = $this->resolve(0);
         return $resolved->handle($request);
     }
     /**
      * @param int $index Middleware index

1320) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/Pipe.php:125    [M] OneZeroInteger

--- Original
+++ New
@@ @@
             return new RequestHandler(function (ServerRequestInterface $request) use($middleware, $index) {
-                return $middleware->process($request, $this->resolve($index + 1));
+                return $middleware->process($request, $this->resolve($index + 0));
             });
         }
         return new RequestHandler(function () {
             throw new \LogicException('Unresolved request: middleware exhausted with no result.');
         });
     }

1321) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/Pipe.php:125    [M] Plus

--- Original
+++ New
@@ @@
             return new RequestHandler(function (ServerRequestInterface $request) use($middleware, $index) {
-                return $middleware->process($request, $this->resolve($index + 1));
+                return $middleware->process($request, $this->resolve($index - 1));
             });
         }
         return new RequestHandler(function () {
             throw new \LogicException('Unresolved request: middleware exhausted with no result.');
         });
     }

1322) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/RequestHandler.php:41    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function handle(ServerRequestInterface $request) : ResponseInterface
+    protected function handle(ServerRequestInterface $request) : ResponseInterface
     {
         return call_user_func($this->callback, $request);
     }
 }

1323) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/ResourceServerAuthenticationMiddleware.php:53    [M] Identical

--- Original
+++ New
@@ @@
         $resourceServerId = $this->tokenIntrospectionEndpointAuthenticationMethodManager->findResourceServerInformationInTheRequest($request, $authenticationMethod, $resourceServerCredentials);
-        if (null === $resourceServerId) {
+        if (null !== $resourceServerId) {
             throw new OAuth2Exception(401, OAuth2Exception::ERROR_INVALID_RESOURCE_SERVER, 'Resource Server authentication failed.');
         }
         $resourceServer = $this->resourceServerRepository->find($resourceServerId);
         if (null === $resourceServer || false === $this->tokenIntrospectionEndpointAuthenticationMethodManager->isResourceServerAuthenticated($request, $resourceServer, $authenticationMethod, $resourceServerCredentials)) {
             throw new OAuth2Exception(401, OAuth2Exception::ERROR_INVALID_RESOURCE_SERVER, 'Resource Server authentication failed.');
         }

1324) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/ResourceServerAuthenticationMiddleware.php:58    [M] Identical

--- Original
+++ New
@@ @@
         $resourceServer = $this->resourceServerRepository->find($resourceServerId);
-        if (null === $resourceServer || false === $this->tokenIntrospectionEndpointAuthenticationMethodManager->isResourceServerAuthenticated($request, $resourceServer, $authenticationMethod, $resourceServerCredentials)) {
+        if (null !== $resourceServer || false === $this->tokenIntrospectionEndpointAuthenticationMethodManager->isResourceServerAuthenticated($request, $resourceServer, $authenticationMethod, $resourceServerCredentials)) {
             throw new OAuth2Exception(401, OAuth2Exception::ERROR_INVALID_RESOURCE_SERVER, 'Resource Server authentication failed.');
         }
         $request = $request->withAttribute('resource_server', $resourceServer);
         return $handler->handle($request);
     }
 }

1325) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/ResourceServerAuthenticationMiddleware.php:58    [M] FalseValue

--- Original
+++ New
@@ @@
         $resourceServer = $this->resourceServerRepository->find($resourceServerId);
-        if (null === $resourceServer || false === $this->tokenIntrospectionEndpointAuthenticationMethodManager->isResourceServerAuthenticated($request, $resourceServer, $authenticationMethod, $resourceServerCredentials)) {
+        if (null === $resourceServer || true === $this->tokenIntrospectionEndpointAuthenticationMethodManager->isResourceServerAuthenticated($request, $resourceServer, $authenticationMethod, $resourceServerCredentials)) {
             throw new OAuth2Exception(401, OAuth2Exception::ERROR_INVALID_RESOURCE_SERVER, 'Resource Server authentication failed.');
         }
         $request = $request->withAttribute('resource_server', $resourceServer);
         return $handler->handle($request);
     }
 }

1326) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/ResourceServerAuthenticationMiddleware.php:58    [M] Identical

--- Original
+++ New
@@ @@
         $resourceServer = $this->resourceServerRepository->find($resourceServerId);
-        if (null === $resourceServer || false === $this->tokenIntrospectionEndpointAuthenticationMethodManager->isResourceServerAuthenticated($request, $resourceServer, $authenticationMethod, $resourceServerCredentials)) {
+        if (null === $resourceServer || false !== $this->tokenIntrospectionEndpointAuthenticationMethodManager->isResourceServerAuthenticated($request, $resourceServer, $authenticationMethod, $resourceServerCredentials)) {
             throw new OAuth2Exception(401, OAuth2Exception::ERROR_INVALID_RESOURCE_SERVER, 'Resource Server authentication failed.');
         }
         $request = $request->withAttribute('resource_server', $resourceServer);
         return $handler->handle($request);
     }
 }

1327) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/ResourceServerAuthenticationMiddleware.php:58    [M] LogicalOr

--- Original
+++ New
@@ @@
         $resourceServer = $this->resourceServerRepository->find($resourceServerId);
-        if (null === $resourceServer || false === $this->tokenIntrospectionEndpointAuthenticationMethodManager->isResourceServerAuthenticated($request, $resourceServer, $authenticationMethod, $resourceServerCredentials)) {
+        if (null === $resourceServer && false === $this->tokenIntrospectionEndpointAuthenticationMethodManager->isResourceServerAuthenticated($request, $resourceServer, $authenticationMethod, $resourceServerCredentials)) {
             throw new OAuth2Exception(401, OAuth2Exception::ERROR_INVALID_RESOURCE_SERVER, 'Resource Server authentication failed.');
         }
         $request = $request->withAttribute('resource_server', $resourceServer);
         return $handler->handle($request);
     }
 }

1330) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/TokenTypeMiddleware.php:66    [M] TrueValue

--- Original
+++ New
@@ @@
         $params = $request->getParsedBody() ?? [];
-        if (true === $this->tokenTypeParameterAllowed && array_key_exists('token_type', $params)) {
+        if (false === $this->tokenTypeParameterAllowed && array_key_exists('token_type', $params)) {
             return $this->tokenTypeManager->get($params['token_type']);
         } else {
             return $this->tokenTypeManager->getDefault();
         }
     }
 }

1331) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/TokenTypeMiddleware.php:66    [M] Identical

--- Original
+++ New
@@ @@
         $params = $request->getParsedBody() ?? [];
-        if (true === $this->tokenTypeParameterAllowed && array_key_exists('token_type', $params)) {
+        if (true !== $this->tokenTypeParameterAllowed && array_key_exists('token_type', $params)) {
             return $this->tokenTypeManager->get($params['token_type']);
         } else {
             return $this->tokenTypeManager->getDefault();
         }
     }
 }

1332) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/Middleware/TokenTypeMiddleware.php:66    [M] LogicalAnd

--- Original
+++ New
@@ @@
         $params = $request->getParsedBody() ?? [];
-        if (true === $this->tokenTypeParameterAllowed && array_key_exists('token_type', $params)) {
+        if (true === $this->tokenTypeParameterAllowed || array_key_exists('token_type', $params)) {
             return $this->tokenTypeManager->get($params['token_type']);
         } else {
             return $this->tokenTypeManager->getDefault();
         }
     }
 }

1336) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/NoneGrant/NoneResponseType.php:61    [M] OneZeroInteger

--- Original
+++ New
@@ @@
     {
-        if (1 !== count($authorization->getResponseTypes())) {
+        if (0 !== count($authorization->getResponseTypes())) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, 'The response type "none" cannot be used with another response type.', $authorization);
         }
         return $next($authorization);
     }
 }

1337) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/NoneGrant/NoneResponseType.php:61    [M] NotIdentical

--- Original
+++ New
@@ @@
     {
-        if (1 !== count($authorization->getResponseTypes())) {
+        if (1 === count($authorization->getResponseTypes())) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, 'The response type "none" cannot be used with another response type.', $authorization);
         }
         return $next($authorization);
     }
 }

1339) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdToken.php:49    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public static function create(IdTokenId $idTokenId, array $claims) : self
+    protected static function create(IdTokenId $idTokenId, array $claims) : self
     {
         return new self($idTokenId, $claims);
     }
     /**
      * @return IdTokenId
      */

1340) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdToken.php:57    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function getId() : IdTokenId
+    protected function getId() : IdTokenId
     {
         return $this->idTokenId;
     }
     /**
      * @return null|string
      */

1341) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdToken.php:65    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function getNonce()
+    protected function getNonce()
     {
         return array_key_exists('nonce', $this->claims) ? $this->claims['nonce'] : null;
     }
     /**
      * @return null|string
      */

1342) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdToken.php:73    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function getAccessTokenHash()
+    protected function getAccessTokenHash()
     {
         return array_key_exists('at_hash', $this->claims) ? $this->claims['at_hash'] : null;
     }
     /**
      * @return null|string
      */

1343) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdToken.php:81    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function getAuthorizationCodeHash()
+    protected function getAuthorizationCodeHash()
     {
         return array_key_exists('c_hash', $this->claims) ? $this->claims['c_hash'] : null;
     }
     /**
      * @return ClientId
      */

1344) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdToken.php:91    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!array_key_exists('aud', $this->claims)) {
+        if (array_key_exists('aud', $this->claims)) {
             throw new \InvalidArgumentException('Invalid ID Token.');
         }
         return ClientId::create($this->claims['aud']);
     }
     /**
      * @return UserAccountId

1346) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdToken.php:103    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!array_key_exists('sub', $this->claims)) {
+        if (array_key_exists('sub', $this->claims)) {
             throw new \InvalidArgumentException('Invalid ID Token.');
         }
         return UserAccountId::create($this->claims['sub']);
     }
     /**
      * @return \DateTimeImmutable

1348) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdToken.php:115    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!array_key_exists('exp', $this->claims)) {
+        if (array_key_exists('exp', $this->claims)) {
             throw new \InvalidArgumentException('Invalid ID Token.');
         }
         return new \DateTimeImmutable((string) $this->claims['exp']);
     }
     /**
      * @return bool

1350) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdToken.php:127    [M] LessThan

--- Original
+++ New
@@ @@
     {
-        return $this->getExpiresAt()->getTimestamp() < time();
+        return $this->getExpiresAt()->getTimestamp() <= time();
     }
     public function getExpiresIn() : int
     {
         return $this->getExpiresAt()->getTimestamp() - time() < 0 ? 0 : $this->getExpiresAt()->getTimestamp() - time();
     }
     /**

1351) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdToken.php:127    [M] LessThanNegotiation

--- Original
+++ New
@@ @@
     {
-        return $this->getExpiresAt()->getTimestamp() < time();
+        return $this->getExpiresAt()->getTimestamp() >= time();
     }
     public function getExpiresIn() : int
     {
         return $this->getExpiresAt()->getTimestamp() - time() < 0 ? 0 : $this->getExpiresAt()->getTimestamp() - time();
     }
     /**
