1353) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdToken.php:132    [M] Minus

--- Original
+++ New
@@ @@
     {
-        return $this->getExpiresAt()->getTimestamp() - time() < 0 ? 0 : $this->getExpiresAt()->getTimestamp() - time();
+        return $this->getExpiresAt()->getTimestamp() + time() < 0 ? 0 : $this->getExpiresAt()->getTimestamp() - time();
     }
     /**
      * @return array
      */
     public function getClaims() : array
     {

1354) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdToken.php:132    [M] OneZeroInteger

--- Original
+++ New
@@ @@
     {
-        return $this->getExpiresAt()->getTimestamp() - time() < 0 ? 0 : $this->getExpiresAt()->getTimestamp() - time();
+        return $this->getExpiresAt()->getTimestamp() - time() < 1 ? 0 : $this->getExpiresAt()->getTimestamp() - time();
     }
     /**
      * @return array
      */
     public function getClaims() : array
     {

1355) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdToken.php:132    [M] LessThan

--- Original
+++ New
@@ @@
     {
-        return $this->getExpiresAt()->getTimestamp() - time() < 0 ? 0 : $this->getExpiresAt()->getTimestamp() - time();
+        return $this->getExpiresAt()->getTimestamp() - time() <= 0 ? 0 : $this->getExpiresAt()->getTimestamp() - time();
     }
     /**
      * @return array
      */
     public function getClaims() : array
     {

1356) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdToken.php:132    [M] LessThanNegotiation

--- Original
+++ New
@@ @@
     {
-        return $this->getExpiresAt()->getTimestamp() - time() < 0 ? 0 : $this->getExpiresAt()->getTimestamp() - time();
+        return $this->getExpiresAt()->getTimestamp() - time() >= 0 ? 0 : $this->getExpiresAt()->getTimestamp() - time();
     }
     /**
      * @return array
      */
     public function getClaims() : array
     {

1357) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdToken.php:132    [M] OneZeroInteger

--- Original
+++ New
@@ @@
     {
-        return $this->getExpiresAt()->getTimestamp() - time() < 0 ? 0 : $this->getExpiresAt()->getTimestamp() - time();
+        return $this->getExpiresAt()->getTimestamp() - time() < 0 ? 1 : $this->getExpiresAt()->getTimestamp() - time();
     }
     /**
      * @return array
      */
     public function getClaims() : array
     {

1358) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdToken.php:132    [M] Minus

--- Original
+++ New
@@ @@
     {
-        return $this->getExpiresAt()->getTimestamp() - time() < 0 ? 0 : $this->getExpiresAt()->getTimestamp() - time();
+        return $this->getExpiresAt()->getTimestamp() - time() < 0 ? 0 : $this->getExpiresAt()->getTimestamp() + time();
     }
     /**
      * @return array
      */
     public function getClaims() : array
     {

1359) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdToken.php:130    [M] PublicVisibility

--- Original
+++ New
@@ @@
     }
-    public function getExpiresIn() : int
+    protected function getExpiresIn() : int
     {
         return $this->getExpiresAt()->getTimestamp() - time() < 0 ? 0 : $this->getExpiresAt()->getTimestamp() - time();
     }
     /**
      * @return array
      */

1360) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdToken.php:138    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function getClaims() : array
+    protected function getClaims() : array
     {
         return $this->claims;
     }
 }

1361) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenBuilder.php:165    [M] NewObject

--- Original
+++ New
@@ @@
     {
-        return new self($issuer, $userinfo, $lifetime, $client, $userAccount, $redirectUri);
+        new self($issuer, $userinfo, $lifetime, $client, $userAccount, $redirectUri);
+        return null;
     }
     /**
      * @param AccessToken $accessToken
      *
      * @return IdTokenBuilder

1362) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenBuilder.php:163    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public static function create(string $issuer, UserInfo $userinfo, int $lifetime, Client $client, UserAccount $userAccount, string $redirectUri)
+    protected static function create(string $issuer, UserInfo $userinfo, int $lifetime, Client $client, UserAccount $userAccount, string $redirectUri)
     {
         return new self($issuer, $userinfo, $lifetime, $client, $userAccount, $redirectUri);
     }
     /**
      * @param AccessToken $accessToken
      *

1363) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenBuilder.php:184    [M] Foreach_

--- Original
+++ New
@@ @@
             $queryParams = $authorizationCode->getQueryParams();
-            foreach (['nonce' => 'nonce', 'claims_locales' => 'claimsLocales'] as $k => $v) {
+            foreach (array() as $k => $v) {
                 if (array_key_exists($k, $queryParams)) {
                     $clone->{$v} = $queryParams[$k];
                 }
             }
             $clone->withAuthenticationTime = array_key_exists('max_age', $authorizationCode->getQueryParams());
         }

1364) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenBuilder.php:173    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function withAccessToken(AccessToken $accessToken) : self
+    protected function withAccessToken(AccessToken $accessToken) : self
     {
         $clone = clone $this;
         $clone->accessTokenId = $accessToken->getTokenId();
         $clone->expiresAt = $accessToken->getExpiresAt();
         $clone->scopes = $accessToken->getScopes();
         if ($accessToken->hasMetadata('code')) {

1365) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenBuilder.php:200    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function withAccessTokenId(AccessTokenId $accessTokenId) : self
+    protected function withAccessTokenId(AccessTokenId $accessTokenId) : self
     {
         $clone = clone $this;
         $clone->accessTokenId = $accessTokenId;
         return $clone;
     }
     /**

1366) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenBuilder.php:213    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function withAuthorizationCodeId(AuthorizationCodeId $authorizationCodeId) : self
+    protected function withAuthorizationCodeId(AuthorizationCodeId $authorizationCodeId) : self
     {
         $clone = clone $this;
         $clone->authorizationCodeId = $authorizationCodeId;
         return $clone;
     }
     /**

1367) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenBuilder.php:226    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function withClaimsLocales(string $claimsLocales) : self
+    protected function withClaimsLocales(string $claimsLocales) : self
     {
         $clone = clone $this;
         $clone->claimsLocales = $claimsLocales;
         return $clone;
     }
     /**

1368) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenBuilder.php:240    [M] TrueValue

--- Original
+++ New
@@ @@
         $clone = clone $this;
-        $clone->withAuthenticationTime = true;
+        $clone->withAuthenticationTime = false;
         return $clone;
     }
     /**
      * @param string[] $scopes
      *
      * @return IdTokenBuilder

1369) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenBuilder.php:237    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function withAuthenticationTime() : self
+    protected function withAuthenticationTime() : self
     {
         $clone = clone $this;
         $clone->withAuthenticationTime = true;
         return $clone;
     }
     /**

1370) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenBuilder.php:250    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function withScope(array $scopes) : self
+    protected function withScope(array $scopes) : self
     {
         $clone = clone $this;
         $clone->scopes = $scopes;
         return $clone;
     }
     /**

1371) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenBuilder.php:263    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function withRequestedClaims(array $requestedClaims) : self
+    protected function withRequestedClaims(array $requestedClaims) : self
     {
         $clone = clone $this;
         $clone->requestedClaims = $requestedClaims;
         return $clone;
     }
     /**

1372) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenBuilder.php:276    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function withNonce(string $nonce) : self
+    protected function withNonce(string $nonce) : self
     {
         $clone = clone $this;
         $clone->nonce = $nonce;
         return $clone;
     }
     /**

1373) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenBuilder.php:289    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function withExpirationAt(\DateTimeImmutable $expiresAt) : self
+    protected function withExpirationAt(\DateTimeImmutable $expiresAt) : self
     {
         $clone = clone $this;
         $clone->expiresAt = $expiresAt;
         return $clone;
     }
     /**

1374) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenBuilder.php:303    [M] FalseValue

--- Original
+++ New
@@ @@
         $clone = clone $this;
-        $clone->withAuthenticationTime = false;
+        $clone->withAuthenticationTime = true;
         return $clone;
     }
     /**
      * @param JWSBuilder $jwsBuilder
      * @param JWKSet     $signatureKeys
      * @param string     $signatureAlgorithm

1375) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenBuilder.php:300    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function withoutAuthenticationTime() : self
+    protected function withoutAuthenticationTime() : self
     {
         $clone = clone $this;
         $clone->withAuthenticationTime = false;
         return $clone;
     }
     /**

1376) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenBuilder.php:318    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         Assertion::inArray($signatureAlgorithm, $jwsBuilder->getSignatureAlgorithmManager()->list(), sprintf('Unsupported signature algorithm "%s". Please use one of the following one: %s', $signatureAlgorithm, implode(', ', $jwsBuilder->getSignatureAlgorithmManager()->list())));
-        Assertion::true(0 !== $signatureKeys->count(), 'The signature key set must contain at least one key.');
+        Assertion::true(1 !== $signatureKeys->count(), 'The signature key set must contain at least one key.');
         $clone = clone $this;
         $clone->jwsBuilder = $jwsBuilder;
         $clone->signatureKeys = $signatureKeys;
         $clone->signatureAlgorithm = $signatureAlgorithm;
         return $clone;
     }

1377) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenBuilder.php:318    [M] NotIdentical

--- Original
+++ New
@@ @@
         Assertion::inArray($signatureAlgorithm, $jwsBuilder->getSignatureAlgorithmManager()->list(), sprintf('Unsupported signature algorithm "%s". Please use one of the following one: %s', $signatureAlgorithm, implode(', ', $jwsBuilder->getSignatureAlgorithmManager()->list())));
-        Assertion::true(0 !== $signatureKeys->count(), 'The signature key set must contain at least one key.');
+        Assertion::true(0 === $signatureKeys->count(), 'The signature key set must contain at least one key.');
         $clone = clone $this;
         $clone->jwsBuilder = $jwsBuilder;
         $clone->signatureKeys = $signatureKeys;
         $clone->signatureAlgorithm = $signatureAlgorithm;
         return $clone;
     }

1378) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenBuilder.php:315    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function withSignature(JWSBuilder $jwsBuilder, JWKSet $signatureKeys, string $signatureAlgorithm) : self
+    protected function withSignature(JWSBuilder $jwsBuilder, JWKSet $signatureKeys, string $signatureAlgorithm) : self
     {
         Assertion::inArray($signatureAlgorithm, $jwsBuilder->getSignatureAlgorithmManager()->list(), sprintf('Unsupported signature algorithm "%s". Please use one of the following one: %s', $signatureAlgorithm, implode(', ', $jwsBuilder->getSignatureAlgorithmManager()->list())));
         Assertion::true(0 !== $signatureKeys->count(), 'The signature key set must contain at least one key.');
         $clone = clone $this;
         $clone->jwsBuilder = $jwsBuilder;
         $clone->signatureKeys = $signatureKeys;

1379) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenBuilder.php:334    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function withEncryption(JWEBuilder $jweBuilder, string $keyEncryptionAlgorithm, string $contentEncryptionAlgorithm) : self
+    protected function withEncryption(JWEBuilder $jweBuilder, string $keyEncryptionAlgorithm, string $contentEncryptionAlgorithm) : self
     {
         $clone = clone $this;
         $clone->jweBuilder = $jweBuilder;
         $clone->keyEncryptionAlgorithm = $keyEncryptionAlgorithm;

1380) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenBuilder.php:355    [M] NotIdentical

--- Original
+++ New
@@ @@
         $data = $this->updateClaimsWithNonce($data);
-        if (null !== $this->signatureAlgorithm) {
+        if (null === $this->signatureAlgorithm) {
             $data = $this->updateClaimsWithJwtClaims($data);
             $data = $this->updateClaimsWithTokenHash($data);
             $data = $this->updateClaimsAudience($data);
             $result = $this->computeIdToken($data);
         } else {
             $result = json_encode($data, JSON_UNESCAPED_UNICODE | JSON_UNESCAPED_SLASHES);

1381) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenBuilder.php:361    [M] BitwiseOr

--- Original
+++ New
@@ @@
         } else {
-            $result = json_encode($data, JSON_UNESCAPED_UNICODE | JSON_UNESCAPED_SLASHES);
+            $result = json_encode($data, JSON_UNESCAPED_UNICODE & JSON_UNESCAPED_SLASHES);
         }
         if (null !== $this->keyEncryptionAlgorithm && null !== $this->contentEncryptionAlgorithm) {
             $result = $this->tryToEncrypt($this->client, $result);
         }
         return $result;
     }

1382) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenBuilder.php:364    [M] NotIdentical

--- Original
+++ New
@@ @@
         }
-        if (null !== $this->keyEncryptionAlgorithm && null !== $this->contentEncryptionAlgorithm) {
+        if (null === $this->keyEncryptionAlgorithm && null !== $this->contentEncryptionAlgorithm) {
             $result = $this->tryToEncrypt($this->client, $result);
         }
         return $result;
     }
     /**
      * @param array $claims

1383) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenBuilder.php:364    [M] NotIdentical

--- Original
+++ New
@@ @@
         }
-        if (null !== $this->keyEncryptionAlgorithm && null !== $this->contentEncryptionAlgorithm) {
+        if (null !== $this->keyEncryptionAlgorithm && null === $this->contentEncryptionAlgorithm) {
             $result = $this->tryToEncrypt($this->client, $result);
         }
         return $result;
     }
     /**
      * @param array $claims

1384) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenBuilder.php:364    [M] LogicalAnd

--- Original
+++ New
@@ @@
         }
-        if (null !== $this->keyEncryptionAlgorithm && null !== $this->contentEncryptionAlgorithm) {
+        if (null !== $this->keyEncryptionAlgorithm || null !== $this->contentEncryptionAlgorithm) {
             $result = $this->tryToEncrypt($this->client, $result);
         }
         return $result;
     }
     /**
      * @param array $claims

1385) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenBuilder.php:349    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function build() : string
+    protected function build() : string
     {
         $data = $this->userinfo->getUserinfo($this->client, $this->userAccount, $this->redirectUri, $this->requestedClaims, $this->scopes, $this->claimsLocales);
         $data = $this->updateClaimsWithAmrAndAcrInfo($data, $this->userAccount);
         $data = $this->updateClaimsWithAuthenticationTime($data, $this->userAccount);
         $data = $this->updateClaimsWithNonce($data);
         if (null !== $this->signatureAlgorithm) {

1386) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenBuilder.php:378    [M] Identical

--- Original
+++ New
@@ @@
     {
-        if (null === $this->expiresAt) {
+        if (null !== $this->expiresAt) {
             $this->expiresAt = (new \DateTimeImmutable())->setTimestamp(time() + $this->lifetime);
         }
         $claims += ['iat' => time(), 'nbf' => time(), 'exp' => $this->expiresAt->getTimestamp(), 'jti' => Base64Url::encode(random_bytes(25)), 'iss' => $this->issuer];
         return $claims;
     }
     /**

1387) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenBuilder.php:379    [M] Plus

--- Original
+++ New
@@ @@
         if (null === $this->expiresAt) {
-            $this->expiresAt = (new \DateTimeImmutable())->setTimestamp(time() + $this->lifetime);
+            $this->expiresAt = (new \DateTimeImmutable())->setTimestamp(time() - $this->lifetime);
         }
         $claims += ['iat' => time(), 'nbf' => time(), 'exp' => $this->expiresAt->getTimestamp(), 'jti' => Base64Url::encode(random_bytes(25)), 'iss' => $this->issuer];
         return $claims;
     }
     /**
      * @param array       $claims

1388) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenBuilder.php:381    [M] PlusEqual

--- Original
+++ New
@@ @@
         }
-        $claims += ['iat' => time(), 'nbf' => time(), 'exp' => $this->expiresAt->getTimestamp(), 'jti' => Base64Url::encode(random_bytes(25)), 'iss' => $this->issuer];
+        $claims -= ['iat' => time(), 'nbf' => time(), 'exp' => $this->expiresAt->getTimestamp(), 'jti' => Base64Url::encode(random_bytes(25)), 'iss' => $this->issuer];
         return $claims;
     }
     /**
      * @param array       $claims
      * @param UserAccount $userAccount
      *

1389) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenBuilder.php:400    [M] TrueValue

--- Original
+++ New
@@ @@
     {
-        if (true === $this->withAuthenticationTime && null !== $userAccount->getLastLoginAt()) {
+        if (false === $this->withAuthenticationTime && null !== $userAccount->getLastLoginAt()) {
             //FIXME: check if the client has a require_auth_time parameter
             $claims['auth_time'] = $userAccount->getLastLoginAt()->getTimestamp();
         }
         return $claims;
     }
     /**

1390) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenBuilder.php:400    [M] Identical

--- Original
+++ New
@@ @@
     {
-        if (true === $this->withAuthenticationTime && null !== $userAccount->getLastLoginAt()) {
+        if (true !== $this->withAuthenticationTime && null !== $userAccount->getLastLoginAt()) {
             //FIXME: check if the client has a require_auth_time parameter
             $claims['auth_time'] = $userAccount->getLastLoginAt()->getTimestamp();
         }
         return $claims;
     }
     /**

1391) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenBuilder.php:400    [M] NotIdentical

--- Original
+++ New
@@ @@
     {
-        if (true === $this->withAuthenticationTime && null !== $userAccount->getLastLoginAt()) {
+        if (true === $this->withAuthenticationTime && null === $userAccount->getLastLoginAt()) {
             //FIXME: check if the client has a require_auth_time parameter
             $claims['auth_time'] = $userAccount->getLastLoginAt()->getTimestamp();
         }
         return $claims;
     }
     /**

1392) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenBuilder.php:400    [M] LogicalAnd

--- Original
+++ New
@@ @@
     {
-        if (true === $this->withAuthenticationTime && null !== $userAccount->getLastLoginAt()) {
+        if (true === $this->withAuthenticationTime || null !== $userAccount->getLastLoginAt()) {
             //FIXME: check if the client has a require_auth_time parameter
             $claims['auth_time'] = $userAccount->getLastLoginAt()->getTimestamp();
         }
         return $claims;
     }
     /**

1393) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenBuilder.php:414    [M] NotIdentical

--- Original
+++ New
@@ @@
     {
-        if (null !== $this->nonce) {
+        if (null === $this->nonce) {
             $claims['nonce'] = $this->nonce;
         }
         return $claims;
     }
     /**
      * @param array $claims

1394) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenBuilder.php:445    [M] Foreach_

--- Original
+++ New
@@ @@
     {
-        foreach (['amr' => 'amr', 'acr' => 'acr'] as $claim => $key) {
+        foreach (array() as $claim => $key) {
             if ($userAccount->has($claim)) {
                 $claims[$key] = $userAccount->get($claim);
             }
         }
         return $claims;
     }

1395) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenBuilder.php:470    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         $serializer = new JwsCompactSerializer();
-        return $serializer->serialize($jws, 0);
+        return $serializer->serialize($jws, 1);
     }
     /**
      * @param Client $client
      * @param string $jwt
      *
      * @return string

1396) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenBuilder.php:499    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         $serializer = new JweCompactSerializer();
-        return $serializer->serialize($jwe, 0);
+        return $serializer->serialize($jwe, 1);
     }
     /**
      * @param string $signatureAlgorithm
      *
      * @return JWK
      */

1397) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenBuilder.php:510    [M] Identical

--- Original
+++ New
@@ @@
         $signatureAlgorithm = $this->jwsBuilder->getSignatureAlgorithmManager()->get($signatureAlgorithm);
-        if ('none' === $signatureAlgorithm->name()) {
+        if ('none' !== $signatureAlgorithm->name()) {
             return JWK::create(['kty' => 'none', 'alg' => 'none', 'use' => 'sig']);
         }
         $signatureKey = $this->signatureKeys->selectKey('sig', $signatureAlgorithm);
         Assertion::notNull($signatureKey, 'Unable to find a key to sign the ID Token. Please verify the selected key set contains suitable keys.');
         return $signatureKey;
     }

1398) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenBuilder.php:545    [M] Identical

--- Original
+++ New
@@ @@
     {
-        if ('none' === $this->signatureAlgorithm) {
+        if ('none' !== $this->signatureAlgorithm) {
             return $claims;
         }
         if (null !== $this->accessTokenId) {
             $claims['at_hash'] = $this->getHash($this->accessTokenId);
         }
         if (null !== $this->authorizationCodeId) {

1399) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenBuilder.php:548    [M] NotIdentical

--- Original
+++ New
@@ @@
         }
-        if (null !== $this->accessTokenId) {
+        if (null === $this->accessTokenId) {
             $claims['at_hash'] = $this->getHash($this->accessTokenId);
         }
         if (null !== $this->authorizationCodeId) {
             $claims['c_hash'] = $this->getHash($this->authorizationCodeId);
         }
         return $claims;

1400) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenBuilder.php:551    [M] NotIdentical

--- Original
+++ New
@@ @@
         }
-        if (null !== $this->authorizationCodeId) {
+        if (null === $this->authorizationCodeId) {
             $claims['c_hash'] = $this->getHash($this->authorizationCodeId);
         }
         return $claims;
     }
     /**
      * @param TokenId $tokenId

1401) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenBuilder.php:565    [M] TrueValue

--- Original
+++ New
@@ @@
     {
-        return Base64Url::encode(mb_substr(hash($this->getHashMethod(), $tokenId->getValue(), true), 0, $this->getHashSize(), '8bit'));
+        return Base64Url::encode(mb_substr(hash($this->getHashMethod(), $tokenId->getValue(), false), 0, $this->getHashSize(), '8bit'));
     }
     /**
      * @throws \InvalidArgumentException
      *
      * @return string
      */

1402) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenBuilder.php:565    [M] OneZeroInteger

--- Original
+++ New
@@ @@
     {
-        return Base64Url::encode(mb_substr(hash($this->getHashMethod(), $tokenId->getValue(), true), 0, $this->getHashSize(), '8bit'));
+        return Base64Url::encode(mb_substr(hash($this->getHashMethod(), $tokenId->getValue(), true), 1, $this->getHashSize(), '8bit'));
     }
     /**
      * @throws \InvalidArgumentException
      *
      * @return string
      */

1403) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenBuilderFactory.php:58    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function createBuilder(Client $client, UserAccount $userAccount, string $redirectUri)
+    protected function createBuilder(Client $client, UserAccount $userAccount, string $redirectUri)
     {
         return IdTokenBuilder::create($this->issuer, $this->userinfo, $this->lifetime, $client, $userAccount, $redirectUri);
     }
 }

1404) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenGrant/IdTokenResponseType.php:64    [M] Identical

--- Original
+++ New
@@ @@
     {
-        if ('none' === $defaultSignatureAlgorithm) {
+        if ('none' !== $defaultSignatureAlgorithm) {
             throw new \InvalidArgumentException('The algorithm "none" is not allowed for ID Tokens issued through the authorization endpoint.');
         }
         $this->idTokenBuilderFactory = $idTokenBuilderFactory;
         $this->defaultSignatureAlgorithm = $defaultSignatureAlgorithm;
         $this->jwsBuilder = $jwsBuilder;
         $this->signatureKeys = $signatureKeys;

1408) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenGrant/IdTokenResponseType.php:106    [M] LogicalNot

--- Original
+++ New
@@ @@
         if (in_array('openid', $authorization->getScopes())) {
-            if (!array_key_exists('nonce', $authorization->getQueryParams())) {
+            if (array_key_exists('nonce', $authorization->getQueryParams())) {
                 throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, 'The parameter "nonce" is mandatory using "id_token" response type.');
             }
             $authorization = $this->populateWithIdToken($authorization);
         }
         return $authorization;
     }

1410) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenGrant/IdTokenResponseType.php:159    [M] Identical

--- Original
+++ New
@@ @@
             $signatureAlgorithm = $authorization->getClient()->get('id_token_signed_response_alg');
-            if ('none' === $signatureAlgorithm) {
+            if ('none' !== $signatureAlgorithm) {
                 throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_CLIENT, 'The ID Token signature algorithm set for the client (parameter "id_token_signed_response_alg") is "none" but this algorithm is not allowed for ID Tokens issued through the authorization endpoint.');
             }
             $idTokenBuilder = $idTokenBuilder->withSignature($this->jwsBuilder, $this->signatureKeys, $signatureAlgorithm);
         } else {
             $idTokenBuilder = $idTokenBuilder->withSignature($this->jwsBuilder, $this->signatureKeys, $this->defaultSignatureAlgorithm);
         }
