1411) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenGrant/IdTokenResponseType.php:166    [M] LogicalAnd

--- Original
+++ New
@@ @@
         }
-        if ($authorization->getClient()->has('id_token_encrypted_response_alg') && $authorization->getClient()->has('id_token_encrypted_response_enc') && null !== $this->jweBuilder) {
+        if (($authorization->getClient()->has('id_token_encrypted_response_alg') || $authorization->getClient()->has('id_token_encrypted_response_enc')) && null !== $this->jweBuilder) {
             $keyEncryptionAlgorithm = $authorization->getClient()->get('id_token_encrypted_response_alg');
             $contentEncryptionAlgorithm = $authorization->getClient()->get('id_token_encrypted_response_enc');
             $idTokenBuilder = $idTokenBuilder->withEncryption($this->jweBuilder, $keyEncryptionAlgorithm, $contentEncryptionAlgorithm);
         }
         $idToken = $idTokenBuilder->build();
         return $authorization->withResponseParameter('id_token', $idToken);

1412) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenGrant/IdTokenResponseType.php:166    [M] NotIdentical

--- Original
+++ New
@@ @@
         }
-        if ($authorization->getClient()->has('id_token_encrypted_response_alg') && $authorization->getClient()->has('id_token_encrypted_response_enc') && null !== $this->jweBuilder) {
+        if ($authorization->getClient()->has('id_token_encrypted_response_alg') && $authorization->getClient()->has('id_token_encrypted_response_enc') && null === $this->jweBuilder) {
             $keyEncryptionAlgorithm = $authorization->getClient()->get('id_token_encrypted_response_alg');
             $contentEncryptionAlgorithm = $authorization->getClient()->get('id_token_encrypted_response_enc');
             $idTokenBuilder = $idTokenBuilder->withEncryption($this->jweBuilder, $keyEncryptionAlgorithm, $contentEncryptionAlgorithm);
         }
         $idToken = $idTokenBuilder->build();
         return $authorization->withResponseParameter('id_token', $idToken);

1413) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenGrant/IdTokenResponseType.php:166    [M] LogicalAnd

--- Original
+++ New
@@ @@
         }
-        if ($authorization->getClient()->has('id_token_encrypted_response_alg') && $authorization->getClient()->has('id_token_encrypted_response_enc') && null !== $this->jweBuilder) {
+        if ($authorization->getClient()->has('id_token_encrypted_response_alg') && $authorization->getClient()->has('id_token_encrypted_response_enc') || null !== $this->jweBuilder) {
             $keyEncryptionAlgorithm = $authorization->getClient()->get('id_token_encrypted_response_alg');
             $contentEncryptionAlgorithm = $authorization->getClient()->get('id_token_encrypted_response_enc');
             $idTokenBuilder = $idTokenBuilder->withEncryption($this->jweBuilder, $keyEncryptionAlgorithm, $contentEncryptionAlgorithm);
         }
         $idToken = $idTokenBuilder->build();
         return $authorization->withResponseParameter('id_token', $idToken);

1414) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenGrant/IdTokenResponseType.php:184    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$authorization->hasQueryParam('claims')) {
+        if ($authorization->hasQueryParam('claims')) {
             return [];
         }
         $requestedClaims = $authorization->getQueryParam('claims');
         if (true === array_key_exists('id_token', $requestedClaims)) {
             return $requestedClaims['id_token'];
         }

1415) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenGrant/IdTokenResponseType.php:189    [M] TrueValue

--- Original
+++ New
@@ @@
         $requestedClaims = $authorization->getQueryParam('claims');
-        if (true === array_key_exists('id_token', $requestedClaims)) {
+        if (false === array_key_exists('id_token', $requestedClaims)) {
             return $requestedClaims['id_token'];
         }
         return [];
     }
 }

1416) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenGrant/IdTokenResponseType.php:189    [M] Identical

--- Original
+++ New
@@ @@
         $requestedClaims = $authorization->getQueryParam('claims');
-        if (true === array_key_exists('id_token', $requestedClaims)) {
+        if (true !== array_key_exists('id_token', $requestedClaims)) {
             return $requestedClaims['id_token'];
         }
         return [];
     }
 }

1419) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenLoader.php:69    [M] TrueValue

--- Original
+++ New
@@ @@
             $jwt = $this->jwsVerifier->load($value);
-            $claims = json_decode($jwt->getPayload(), true);
+            $claims = json_decode($jwt->getPayload(), false);
             Assertion::isArray($claims, 'Invalid ID Token');
             $validSignature = $this->jwsVerifier->verifyWithKeySet($jwt, $this->signatureKeySet, 0);
             Assertion::inArray($jwt->getSignature($validSignature)->getProtectedHeader('alg'), $this->signatureAlgorithms);
             $idToken = IdToken::create($idTokenId, $claims);
             return $idToken;
         } catch (\Exception $e) {

1420) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenLoader.php:71    [M] OneZeroInteger

--- Original
+++ New
@@ @@
             Assertion::isArray($claims, 'Invalid ID Token');
-            $validSignature = $this->jwsVerifier->verifyWithKeySet($jwt, $this->signatureKeySet, 0);
+            $validSignature = $this->jwsVerifier->verifyWithKeySet($jwt, $this->signatureKeySet, 1);
             Assertion::inArray($jwt->getSignature($validSignature)->getProtectedHeader('alg'), $this->signatureAlgorithms);
             $idToken = IdToken::create($idTokenId, $claims);
             return $idToken;
         } catch (\Exception $e) {
             return null;
         }

1421) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/IdTokenLoader.php:63    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function load(IdTokenId $idTokenId) : ?IdToken
+    protected function load(IdTokenId $idTokenId) : ?IdToken
     {
         $value = $idTokenId->getValue();
         try {
             $jwt = $this->jwsVerifier->load($value);
             $claims = json_decode($jwt->getPayload(), true);
             Assertion::isArray($claims, 'Invalid ID Token');

1424) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfo/ClaimSource/ClaimSourceManager.php:30    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function add(ClaimSource $claimSource) : self
+    protected function add(ClaimSource $claimSource) : self
     {
         $this->claimSources[] = $claimSource;
         return $this;
     }
     /**
      * @return ClaimSource[]

1426) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfo/ClaimSource/ClaimSourceManager.php:58    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         $claims = ['_claim_names' => [], '_claim_sources' => []];
-        $i = 0;
+        $i = 1;
         foreach ($this->all() as $claimSource) {
             $result = $claimSource->getUserInfo($userAccount, $scope, $previousClaims);
             if (null !== $result) {
                 ++$i;
                 $src = sprintf('src%d', $i);
                 $_claim_names = [];

1427) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfo/ClaimSource/ClaimSourceManager.php:62    [M] NotIdentical

--- Original
+++ New
@@ @@
             $result = $claimSource->getUserInfo($userAccount, $scope, $previousClaims);
-            if (null !== $result) {
+            if (null === $result) {
                 ++$i;
                 $src = sprintf('src%d', $i);
                 $_claim_names = [];
                 foreach ($result->getAvailableClaims() as $claim) {
                     if ('sub' !== $claim) {
                         $_claim_names[$claim] = $src;

1428) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfo/ClaimSource/ClaimSourceManager.php:63    [M] Increment

--- Original
+++ New
@@ @@
             if (null !== $result) {
-                ++$i;
+                --$i;
                 $src = sprintf('src%d', $i);
                 $_claim_names = [];
                 foreach ($result->getAvailableClaims() as $claim) {
                     if ('sub' !== $claim) {
                         $_claim_names[$claim] = $src;
                     }

1429) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfo/ClaimSource/ClaimSourceManager.php:67    [M] NotIdentical

--- Original
+++ New
@@ @@
                 foreach ($result->getAvailableClaims() as $claim) {
-                    if ('sub' !== $claim) {
+                    if ('sub' === $claim) {
                         $_claim_names[$claim] = $src;
                     }
                 }
                 $claims['_claim_names'] = array_merge($claims['_claim_names'], $_claim_names);
                 $claims['_claim_sources'][$src] = $result->getSource();
             }

1430) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfo/ClaimSource/ClaimSourceManager.php:66    [M] Foreach_

--- Original
+++ New
@@ @@
                 $_claim_names = [];
-                foreach ($result->getAvailableClaims() as $claim) {
+                foreach (array() as $claim) {
                     if ('sub' !== $claim) {
                         $_claim_names[$claim] = $src;
                     }
                 }
                 $claims['_claim_names'] = array_merge($claims['_claim_names'], $_claim_names);
                 $claims['_claim_sources'][$src] = $result->getSource();

1431) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfo/ClaimSource/ClaimSourceManager.php:60    [M] Foreach_

--- Original
+++ New
@@ @@
         $i = 0;
-        foreach ($this->all() as $claimSource) {
+        foreach (array() as $claimSource) {
             $result = $claimSource->getUserInfo($userAccount, $scope, $previousClaims);
             if (null !== $result) {
                 ++$i;
                 $src = sprintf('src%d', $i);
                 $_claim_names = [];
                 foreach ($result->getAvailableClaims() as $claim) {

1432) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfo/ClaimSource/ClaimSourceManager.php:52    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function getUserInfo(UserAccount $userAccount, array $scope, array $previousClaims)
+    protected function getUserInfo(UserAccount $userAccount, array $scope, array $previousClaims)
     {
         $claims = ['_claim_names' => [], '_claim_sources' => []];
         $i = 0;
         foreach ($this->all() as $claimSource) {
             $result = $claimSource->getUserInfo($userAccount, $scope, $previousClaims);
             if (null !== $result) {

1433) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfo/ClaimSource/Source.php:43    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function getAvailableClaims() : array
+    protected function getAvailableClaims() : array
     {
         return $this->availableClaims;
     }
     /**
      * @return array
      */

1434) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfo/ClaimSource/Source.php:51    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function getSource() : array
+    protected function getSource() : array
     {
         return $this->source;
     }
 }

1435) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfo/Pairwise/EncryptedSubjectIdentifier.php:39    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!in_array($algorithm, openssl_get_cipher_methods())) {
+        if (in_array($algorithm, openssl_get_cipher_methods())) {
             throw new \InvalidArgumentException(sprintf('The algorithm "%s" is not supported.', $algorithm));
         }
         $this->pairwiseEncryptionKey = $pairwiseEncryptionKey;
         $this->algorithm = $algorithm;
     }
     /**

1436) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfo/Pairwise/EncryptedSubjectIdentifier.php:49    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function calculateSubjectIdentifier(UserAccount $userAccount, string $sectorIdentifierHost) : string
+    protected function calculateSubjectIdentifier(UserAccount $userAccount, string $sectorIdentifierHost) : string
     {
         $prepared = sprintf('%s:%s', $sectorIdentifierHost, $userAccount->getPublicId()->getValue());
         return Base64Url::encode(openssl_encrypt($prepared, $this->algorithm, $this->pairwiseEncryptionKey, OPENSSL_RAW_DATA));
     }
     /**
      * {@inheritdoc}

1437) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfo/Pairwise/EncryptedSubjectIdentifier.php:67    [M] NotIdentical

--- Original
+++ New
@@ @@
         $parts = explode(':', $decoded);
-        if (3 !== count($parts)) {
+        if (3 === count($parts)) {
             return null;
         }
         return $parts[1];
     }
 }

1438) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfo/Pairwise/EncryptedSubjectIdentifier.php:71    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         }
-        return $parts[1];
+        return $parts[0];
     }
 }

1439) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfo/Pairwise/EncryptedSubjectIdentifier.php:63    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function getPublicIdFromSubjectIdentifier(string $subjectIdentifier) : ?string
+    protected function getPublicIdFromSubjectIdentifier(string $subjectIdentifier) : ?string
     {
         $decoded = openssl_decrypt(Base64Url::decode($subjectIdentifier), $this->algorithm, $this->pairwiseEncryptionKey, OPENSSL_RAW_DATA);
         $parts = explode(':', $decoded);
         if (3 !== count($parts)) {
             return null;
         }

1441) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfo/Pairwise/HashedSubjectIdentifier.php:57    [M] TrueValue

--- Original
+++ New
@@ @@
         $prepared = sprintf('%s%s', $sectorIdentifierHost, $userAccount->getPublicId()->getValue());
-        return Base64Url::encode(hash_hmac($this->algorithm, $prepared, $this->pairwiseHashKey, true));
+        return Base64Url::encode(hash_hmac($this->algorithm, $prepared, $this->pairwiseHashKey, false));
     }
     /**
      * {@inheritdoc}
      */
     public function getPublicIdFromSubjectIdentifier(string $subjectIdentifier) : ?string
     {

1444) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfo/ScopeSupport/AddressScopeSupport.php:21    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function getScope() : string
+    protected function getScope() : string
     {
         return 'address';
     }
     /**
      * {@inheritdoc}
      */

1454) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfo/ScopeSupport/UserInfoScopeSupportManager.php:36    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function add(UserInfoScopeSupport $userinfoScopeSupport) : self
+    protected function add(UserInfoScopeSupport $userinfoScopeSupport) : self
     {
         $this->userinfoScopeSupports[$userinfoScopeSupport->getScope()] = $userinfoScopeSupport;
         return $this;
     }
     /**
      * @param string $scope

1455) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfo/ScopeSupport/UserInfoScopeSupportManager.php:48    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function has(string $scope) : bool
+    protected function has(string $scope) : bool
     {
         return array_key_exists($scope, $this->userinfoScopeSupports);
     }
     /**
      * @param string $scope
      *

1456) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfo/ScopeSupport/UserInfoScopeSupportManager.php:62    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$this->has($scope)) {
+        if ($this->has($scope)) {
             throw new \InvalidArgumentException(sprintf('The userinfo scope "%s" is not supported.', $scope));
         }
         return $this->userinfoScopeSupports[$scope];
     }
     /**
      * @return UserInfoScopeSupport[]

1457) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfo/ScopeSupport/UserInfoScopeSupportManager.php:60    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function get(string $scope) : UserInfoScopeSupport
+    protected function get(string $scope) : UserInfoScopeSupport
     {
         if (!$this->has($scope)) {
             throw new \InvalidArgumentException(sprintf('The userinfo scope "%s" is not supported.', $scope));
         }
         return $this->userinfoScopeSupports[$scope];
     }

1459) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfo/UserInfo.php:63    [M] PlusEqual

--- Original
+++ New
@@ @@
         foreach ($this->userinfoScopeSupportManager->all() as $infoScopeSupport) {
-            $claimsSupported += $infoScopeSupport->getClaims();
+            $claimsSupported -= $infoScopeSupport->getClaims();
         }
         return array_unique($claimsSupported);
     }
     /**
      * @param Client      $client
      * @param UserAccount $userAccount

1460) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfo/UserInfo.php:62    [M] Foreach_

--- Original
+++ New
@@ @@
         $claimsSupported = [];
-        foreach ($this->userinfoScopeSupportManager->all() as $infoScopeSupport) {
+        foreach (array() as $infoScopeSupport) {
             $claimsSupported += $infoScopeSupport->getClaims();
         }
         return array_unique($claimsSupported);
     }
     /**
      * @param Client      $client

1461) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfo/UserInfo.php:59    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function getSupportedClaims() : array
+    protected function getSupportedClaims() : array
     {
         $claimsSupported = [];
         foreach ($this->userinfoScopeSupportManager->all() as $infoScopeSupport) {
             $claimsSupported += $infoScopeSupport->getClaims();
         }
         return array_unique($claimsSupported);

1462) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfo/UserInfo.php:79    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function getUserinfo(Client $client, UserAccount $userAccount, string $redirectUri, array $requestClaims, array $scopes, ?string $claimsLocales) : array
+    protected function getUserinfo(Client $client, UserAccount $userAccount, string $redirectUri, array $requestClaims, array $scopes, ?string $claimsLocales) : array
     {
         $requestClaims = array_merge($this->getClaimsFromClaimScope($scopes), $requestClaims);
         $claims = $this->getClaimValues($userAccount, $requestClaims, $claimsLocales);
         $claims = array_merge($claims, $this->claimSourceManager->getUserInfo($userAccount, $scopes, []));
         $claims['sub'] = $this->calculateSubjectIdentifier($client, $userAccount, $redirectUri);
         return $claims;

1463) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfo/UserInfo.php:106    [M] Foreach_

--- Original
+++ New
@@ @@
                 $scope_claims = $this->userinfoScopeSupportManager->get($scope)->getClaims();
-                foreach ($scope_claims as $scope_claim) {
+                foreach (array() as $scope_claim) {
                     $result[$scope_claim] = null;
                 }
             }
         }
         return $result;
     }

1464) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfo/UserInfo.php:103    [M] Foreach_

--- Original
+++ New
@@ @@
         $result = [];
-        foreach ($scopes as $scope) {
+        foreach (array() as $scope) {
             if ($this->userinfoScopeSupportManager->has($scope)) {
                 $scope_claims = $this->userinfoScopeSupportManager->get($scope)->getClaims();
                 foreach ($scope_claims as $scope_claim) {
                     $result[$scope_claim] = null;
                 }
             }

1465) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfo/UserInfo.php:125    [M] Identical

--- Original
+++ New
@@ @@
         $result = [];
-        if (null === $claimsLocales) {
+        if (null !== $claimsLocales) {
             $claimsLocales = [];
         } elseif (true === is_string($claimsLocales)) {
             $claimsLocales = explode(' ', $claimsLocales);
         }
         $claimsLocales[] = '';
         foreach ($claims as $claim => $config) {

1466) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfo/UserInfo.php:127    [M] TrueValue

--- Original
+++ New
@@ @@
             $claimsLocales = [];
-        } elseif (true === is_string($claimsLocales)) {
+        } elseif (false === is_string($claimsLocales)) {
             $claimsLocales = explode(' ', $claimsLocales);
         }
         $claimsLocales[] = '';
         foreach ($claims as $claim => $config) {
             foreach ($claimsLocales as $claims_locale) {
                 $claim_locale = $this->computeClaimWithLocale($claim, $claims_locale);

1467) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfo/UserInfo.php:127    [M] Identical

--- Original
+++ New
@@ @@
             $claimsLocales = [];
-        } elseif (true === is_string($claimsLocales)) {
+        } elseif (true !== is_string($claimsLocales)) {
             $claimsLocales = explode(' ', $claimsLocales);
         }
         $claimsLocales[] = '';
         foreach ($claims as $claim => $config) {
             foreach ($claimsLocales as $claims_locale) {
                 $claim_locale = $this->computeClaimWithLocale($claim, $claims_locale);

1468) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfo/UserInfo.php:135    [M] NotIdentical

--- Original
+++ New
@@ @@
                 $claim_value = $this->getUserClaim($userAccount, $claim_locale, $config);
-                if (null !== $claim_value) {
+                if (null === $claim_value) {
                     $result[$claim_locale] = $claim_value;
                     break;
                 }
             }
         }
         return $result;

1469) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfo/UserInfo.php:138    [M] Break_

--- Original
+++ New
@@ @@
                     $result[$claim_locale] = $claim_value;
-                    break;
+                    continue;
                 }
             }
         }
         return $result;
     }
     /**

1470) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfo/UserInfo.php:132    [M] Foreach_

--- Original
+++ New
@@ @@
         foreach ($claims as $claim => $config) {
-            foreach ($claimsLocales as $claims_locale) {
+            foreach (array() as $claims_locale) {
                 $claim_locale = $this->computeClaimWithLocale($claim, $claims_locale);
                 $claim_value = $this->getUserClaim($userAccount, $claim_locale, $config);
                 if (null !== $claim_value) {
                     $result[$claim_locale] = $claim_value;
                     break;
                 }

1471) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfo/UserInfo.php:131    [M] Foreach_

--- Original
+++ New
@@ @@
         $claimsLocales[] = '';
-        foreach ($claims as $claim => $config) {
+        foreach (array() as $claim => $config) {
             foreach ($claimsLocales as $claims_locale) {
                 $claim_locale = $this->computeClaimWithLocale($claim, $claims_locale);
                 $claim_value = $this->getUserClaim($userAccount, $claim_locale, $config);
                 if (null !== $claim_value) {
                     $result[$claim_locale] = $claim_value;
                     break;

1472) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfo/UserInfo.php:181    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function enablePairwiseSubject(PairwiseSubjectIdentifierAlgorithm $pairwiseAlgorithm, bool $isPairwiseSubjectDefault)
+    protected function enablePairwiseSubject(PairwiseSubjectIdentifierAlgorithm $pairwiseAlgorithm, bool $isPairwiseSubjectDefault)
     {
         $this->pairwiseAlgorithm = $pairwiseAlgorithm;
         $this->isPairwiseSubjectDefault = $isPairwiseSubjectDefault;
     }
     /**
      * @return bool

1473) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfo/UserInfo.php:192    [M] NotIdentical

--- Original
+++ New
@@ @@
     {
-        return null !== $this->pairwiseAlgorithm;
+        return null === $this->pairwiseAlgorithm;
     }
     /**
      * @return PairwiseSubjectIdentifierAlgorithm|null
      */
     public function getPairwiseSubjectIdentifierAlgorithm() : ?PairwiseSubjectIdentifierAlgorithm
     {

1474) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfo/UserInfo.php:190    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function isPairwiseSubjectIdentifierSupported() : bool
+    protected function isPairwiseSubjectIdentifierSupported() : bool
     {
         return null !== $this->pairwiseAlgorithm;
     }
     /**
      * @return PairwiseSubjectIdentifierAlgorithm|null
      */

1475) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfo/UserInfo.php:198    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function getPairwiseSubjectIdentifierAlgorithm() : ?PairwiseSubjectIdentifierAlgorithm
+    protected function getPairwiseSubjectIdentifierAlgorithm() : ?PairwiseSubjectIdentifierAlgorithm
     {
         return $this->pairwiseAlgorithm;
     }
     /**
      * @return bool
      */

1476) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfo/UserInfo.php:206    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function isPairwiseSubjectDefault() : bool
+    protected function isPairwiseSubjectDefault() : bool
     {
         return $this->isPairwiseSubjectDefault;
     }
     /**
      * @param Client      $client
      * @param UserAccount $userAccount

1477) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfo/UserInfo.php:221    [M] FalseValue

--- Original
+++ New
@@ @@
         $sub = $userAccount->getPublicId()->getValue();
-        if (false === $this->isPairwiseSubjectIdentifierSupported()) {
+        if (true === $this->isPairwiseSubjectIdentifierSupported()) {
             return $sub;
         }
         if ($client->has('subject_type') && 'pairwise' === $client->get('subject_type') || true === $this->isPairwiseSubjectDefault()) {
             $sectorIdentifierHost = $this->getSectorIdentifierHost($client, $redirectUri);
             return $this->pairwiseAlgorithm->calculateSubjectIdentifier($userAccount, $sectorIdentifierHost);
         }

1478) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfo/UserInfo.php:221    [M] Identical

--- Original
+++ New
@@ @@
         $sub = $userAccount->getPublicId()->getValue();
-        if (false === $this->isPairwiseSubjectIdentifierSupported()) {
+        if (false !== $this->isPairwiseSubjectIdentifierSupported()) {
             return $sub;
         }
         if ($client->has('subject_type') && 'pairwise' === $client->get('subject_type') || true === $this->isPairwiseSubjectDefault()) {
             $sectorIdentifierHost = $this->getSectorIdentifierHost($client, $redirectUri);
             return $this->pairwiseAlgorithm->calculateSubjectIdentifier($userAccount, $sectorIdentifierHost);
         }
