1479) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfo/UserInfo.php:224    [M] Identical

--- Original
+++ New
@@ @@
         }
-        if ($client->has('subject_type') && 'pairwise' === $client->get('subject_type') || true === $this->isPairwiseSubjectDefault()) {
+        if ($client->has('subject_type') && 'pairwise' !== $client->get('subject_type') || true === $this->isPairwiseSubjectDefault()) {
             $sectorIdentifierHost = $this->getSectorIdentifierHost($client, $redirectUri);
             return $this->pairwiseAlgorithm->calculateSubjectIdentifier($userAccount, $sectorIdentifierHost);
         }
         return $sub;
     }
     /**

1480) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfo/UserInfo.php:224    [M] LogicalAnd

--- Original
+++ New
@@ @@
         }
-        if ($client->has('subject_type') && 'pairwise' === $client->get('subject_type') || true === $this->isPairwiseSubjectDefault()) {
+        if ($client->has('subject_type') || 'pairwise' === $client->get('subject_type') || true === $this->isPairwiseSubjectDefault()) {
             $sectorIdentifierHost = $this->getSectorIdentifierHost($client, $redirectUri);
             return $this->pairwiseAlgorithm->calculateSubjectIdentifier($userAccount, $sectorIdentifierHost);
         }
         return $sub;
     }
     /**

1481) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfo/UserInfo.php:224    [M] TrueValue

--- Original
+++ New
@@ @@
         }
-        if ($client->has('subject_type') && 'pairwise' === $client->get('subject_type') || true === $this->isPairwiseSubjectDefault()) {
+        if ($client->has('subject_type') && 'pairwise' === $client->get('subject_type') || false === $this->isPairwiseSubjectDefault()) {
             $sectorIdentifierHost = $this->getSectorIdentifierHost($client, $redirectUri);
             return $this->pairwiseAlgorithm->calculateSubjectIdentifier($userAccount, $sectorIdentifierHost);
         }
         return $sub;
     }
     /**

1482) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfo/UserInfo.php:224    [M] Identical

--- Original
+++ New
@@ @@
         }
-        if ($client->has('subject_type') && 'pairwise' === $client->get('subject_type') || true === $this->isPairwiseSubjectDefault()) {
+        if ($client->has('subject_type') && 'pairwise' === $client->get('subject_type') || true !== $this->isPairwiseSubjectDefault()) {
             $sectorIdentifierHost = $this->getSectorIdentifierHost($client, $redirectUri);
             return $this->pairwiseAlgorithm->calculateSubjectIdentifier($userAccount, $sectorIdentifierHost);
         }
         return $sub;
     }
     /**

1483) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfo/UserInfo.php:224    [M] LogicalOr

--- Original
+++ New
@@ @@
         }
-        if ($client->has('subject_type') && 'pairwise' === $client->get('subject_type') || true === $this->isPairwiseSubjectDefault()) {
+        if ($client->has('subject_type') && 'pairwise' === $client->get('subject_type') && true === $this->isPairwiseSubjectDefault()) {
             $sectorIdentifierHost = $this->getSectorIdentifierHost($client, $redirectUri);
             return $this->pairwiseAlgorithm->calculateSubjectIdentifier($userAccount, $sectorIdentifierHost);
         }
         return $sub;
     }
     /**

1484) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfo/UserInfo.php:246    [M] TrueValue

--- Original
+++ New
@@ @@
         $uri = $redirectUri;
-        if (true === $client->has('sector_identifier_uri')) {
+        if (false === $client->has('sector_identifier_uri')) {
             $uri = $client->get('sector_identifier_uri');
         }
         $data = parse_url($uri);
         if (!is_array($data) || !array_key_exists('host', $data)) {
             throw new \InvalidArgumentException(sprintf('Invalid Sector Identifier Uri "%s".', $uri));
         }

1485) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfo/UserInfo.php:246    [M] Identical

--- Original
+++ New
@@ @@
         $uri = $redirectUri;
-        if (true === $client->has('sector_identifier_uri')) {
+        if (true !== $client->has('sector_identifier_uri')) {
             $uri = $client->get('sector_identifier_uri');
         }
         $data = parse_url($uri);
         if (!is_array($data) || !array_key_exists('host', $data)) {
             throw new \InvalidArgumentException(sprintf('Invalid Sector Identifier Uri "%s".', $uri));
         }

1486) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfo/UserInfo.php:251    [M] LogicalNot

--- Original
+++ New
@@ @@
         $data = parse_url($uri);
-        if (!is_array($data) || !array_key_exists('host', $data)) {
+        if (is_array($data) || !array_key_exists('host', $data)) {
             throw new \InvalidArgumentException(sprintf('Invalid Sector Identifier Uri "%s".', $uri));
         }
         return $data['host'];
     }
 }

1487) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfo/UserInfo.php:251    [M] LogicalNot

--- Original
+++ New
@@ @@
         $data = parse_url($uri);
-        if (!is_array($data) || !array_key_exists('host', $data)) {
+        if (!is_array($data) || array_key_exists('host', $data)) {
             throw new \InvalidArgumentException(sprintf('Invalid Sector Identifier Uri "%s".', $uri));
         }
         return $data['host'];
     }
 }

1488) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfo/UserInfo.php:251    [M] LogicalOr

--- Original
+++ New
@@ @@
         $data = parse_url($uri);
-        if (!is_array($data) || !array_key_exists('host', $data)) {
+        if (!is_array($data) && !array_key_exists('host', $data)) {
             throw new \InvalidArgumentException(sprintf('Invalid Sector Identifier Uri "%s".', $uri));
         }
         return $data['host'];
     }
 }

1489) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfoEndpoint/UserInfoEndpoint.php:90    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function enableSignature(JWSBuilder $jwsBuilder, JWKSet $signatureKeys)
+    protected function enableSignature(JWSBuilder $jwsBuilder, JWKSet $signatureKeys)
     {
         $this->jwsBuilder = $jwsBuilder;
         $this->signatureKeys = $signatureKeys;
     }
     /**
      * @param JWEBuilder $jweBuilder

1490) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfoEndpoint/UserInfoEndpoint.php:99    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function enableEncryption(JWEBuilder $jweBuilder)
+    protected function enableEncryption(JWEBuilder $jweBuilder)
     {
         $this->jweBuilder = $jweBuilder;
     }
     /**
      * {@inheritdoc}
      */

1491) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfoEndpoint/UserInfoEndpoint.php:125    [M] Foreach_

--- Original
+++ New
@@ @@
         $headers = ['Content-Type' => sprintf('application/%s; charset=UTF-8', $isJwt ? 'jwt' : 'json'), 'Cache-Control' => 'no-cache, no-store, max-age=0, must-revalidate, private', 'Pragma' => 'no-cache'];
-        foreach ($headers as $k => $v) {
+        foreach (array() as $k => $v) {
             $response = $response->withHeader($k, $v);
         }
         return $response;
     }
     /**
      * @param Client      $client

1493) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfoEndpoint/UserInfoEndpoint.php:142    [M] FalseValue

--- Original
+++ New
@@ @@
     {
-        $isJwt = false;
+        $isJwt = true;
         $requestedClaims = $this->getEndpointClaims($accessToken);
         $idTokenBuilder = $this->idTokenBuilderFactory->createBuilder($client, $userAccount, $accessToken->getMetadata('redirect_uri'));
         if ($client->has('userinfo_signed_response_alg') && null !== $this->jwsBuilder) {
             $isJwt = true;
             $signatureAlgorithm = $client->get('userinfo_signed_response_alg');
             $idTokenBuilder = $idTokenBuilder->withSignature($this->jwsBuilder, $this->signatureKeys, $signatureAlgorithm);

1494) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfoEndpoint/UserInfoEndpoint.php:146    [M] NotIdentical

--- Original
+++ New
@@ @@
         $idTokenBuilder = $this->idTokenBuilderFactory->createBuilder($client, $userAccount, $accessToken->getMetadata('redirect_uri'));
-        if ($client->has('userinfo_signed_response_alg') && null !== $this->jwsBuilder) {
+        if ($client->has('userinfo_signed_response_alg') && null === $this->jwsBuilder) {
             $isJwt = true;
             $signatureAlgorithm = $client->get('userinfo_signed_response_alg');
             $idTokenBuilder = $idTokenBuilder->withSignature($this->jwsBuilder, $this->signatureKeys, $signatureAlgorithm);
         }
         if ($client->has('userinfo_encrypted_response_alg') && $client->has('userinfo_encrypted_response_enc') && null !== $this->jweBuilder) {
             $isJwt = true;

1495) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfoEndpoint/UserInfoEndpoint.php:146    [M] LogicalAnd

--- Original
+++ New
@@ @@
         $idTokenBuilder = $this->idTokenBuilderFactory->createBuilder($client, $userAccount, $accessToken->getMetadata('redirect_uri'));
-        if ($client->has('userinfo_signed_response_alg') && null !== $this->jwsBuilder) {
+        if ($client->has('userinfo_signed_response_alg') || null !== $this->jwsBuilder) {
             $isJwt = true;
             $signatureAlgorithm = $client->get('userinfo_signed_response_alg');
             $idTokenBuilder = $idTokenBuilder->withSignature($this->jwsBuilder, $this->signatureKeys, $signatureAlgorithm);
         }
         if ($client->has('userinfo_encrypted_response_alg') && $client->has('userinfo_encrypted_response_enc') && null !== $this->jweBuilder) {
             $isJwt = true;

1496) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfoEndpoint/UserInfoEndpoint.php:147    [M] TrueValue

--- Original
+++ New
@@ @@
         if ($client->has('userinfo_signed_response_alg') && null !== $this->jwsBuilder) {
-            $isJwt = true;
+            $isJwt = false;
             $signatureAlgorithm = $client->get('userinfo_signed_response_alg');
             $idTokenBuilder = $idTokenBuilder->withSignature($this->jwsBuilder, $this->signatureKeys, $signatureAlgorithm);
         }
         if ($client->has('userinfo_encrypted_response_alg') && $client->has('userinfo_encrypted_response_enc') && null !== $this->jweBuilder) {
             $isJwt = true;
             $keyEncryptionAlgorithm = $client->get('userinfo_encrypted_response_alg');

1497) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfoEndpoint/UserInfoEndpoint.php:151    [M] LogicalAnd

--- Original
+++ New
@@ @@
         }
-        if ($client->has('userinfo_encrypted_response_alg') && $client->has('userinfo_encrypted_response_enc') && null !== $this->jweBuilder) {
+        if (($client->has('userinfo_encrypted_response_alg') || $client->has('userinfo_encrypted_response_enc')) && null !== $this->jweBuilder) {
             $isJwt = true;
             $keyEncryptionAlgorithm = $client->get('userinfo_encrypted_response_alg');
             $contentEncryptionAlgorithm = $client->get('userinfo_encrypted_response_enc');
             $idTokenBuilder = $idTokenBuilder->withEncryption($this->jweBuilder, $keyEncryptionAlgorithm, $contentEncryptionAlgorithm);
         }
         $idTokenBuilder = $idTokenBuilder->withAccessToken($accessToken);

1498) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfoEndpoint/UserInfoEndpoint.php:151    [M] NotIdentical

--- Original
+++ New
@@ @@
         }
-        if ($client->has('userinfo_encrypted_response_alg') && $client->has('userinfo_encrypted_response_enc') && null !== $this->jweBuilder) {
+        if ($client->has('userinfo_encrypted_response_alg') && $client->has('userinfo_encrypted_response_enc') && null === $this->jweBuilder) {
             $isJwt = true;
             $keyEncryptionAlgorithm = $client->get('userinfo_encrypted_response_alg');
             $contentEncryptionAlgorithm = $client->get('userinfo_encrypted_response_enc');
             $idTokenBuilder = $idTokenBuilder->withEncryption($this->jweBuilder, $keyEncryptionAlgorithm, $contentEncryptionAlgorithm);
         }
         $idTokenBuilder = $idTokenBuilder->withAccessToken($accessToken);

1499) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfoEndpoint/UserInfoEndpoint.php:151    [M] LogicalAnd

--- Original
+++ New
@@ @@
         }
-        if ($client->has('userinfo_encrypted_response_alg') && $client->has('userinfo_encrypted_response_enc') && null !== $this->jweBuilder) {
+        if ($client->has('userinfo_encrypted_response_alg') && $client->has('userinfo_encrypted_response_enc') || null !== $this->jweBuilder) {
             $isJwt = true;
             $keyEncryptionAlgorithm = $client->get('userinfo_encrypted_response_alg');
             $contentEncryptionAlgorithm = $client->get('userinfo_encrypted_response_enc');
             $idTokenBuilder = $idTokenBuilder->withEncryption($this->jweBuilder, $keyEncryptionAlgorithm, $contentEncryptionAlgorithm);
         }
         $idTokenBuilder = $idTokenBuilder->withAccessToken($accessToken);

1500) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfoEndpoint/UserInfoEndpoint.php:152    [M] TrueValue

--- Original
+++ New
@@ @@
         if ($client->has('userinfo_encrypted_response_alg') && $client->has('userinfo_encrypted_response_enc') && null !== $this->jweBuilder) {
-            $isJwt = true;
+            $isJwt = false;
             $keyEncryptionAlgorithm = $client->get('userinfo_encrypted_response_alg');
             $contentEncryptionAlgorithm = $client->get('userinfo_encrypted_response_enc');
             $idTokenBuilder = $idTokenBuilder->withEncryption($this->jweBuilder, $keyEncryptionAlgorithm, $contentEncryptionAlgorithm);
         }
         $idTokenBuilder = $idTokenBuilder->withAccessToken($accessToken);
         $idTokenBuilder = $idTokenBuilder->withRequestedClaims($requestedClaims);

1501) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfoEndpoint/UserInfoEndpoint.php:171    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$accessToken->hasMetadata('requested_claims')) {
+        if ($accessToken->hasMetadata('requested_claims')) {
             return [];
         }
         $requested_claims = $accessToken->getMetadata('requested_claims');
         if (true === array_key_exists('userinfo', $requested_claims)) {
             return $requested_claims['userinfo'];
         }

1502) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfoEndpoint/UserInfoEndpoint.php:176    [M] TrueValue

--- Original
+++ New
@@ @@
         $requested_claims = $accessToken->getMetadata('requested_claims');
-        if (true === array_key_exists('userinfo', $requested_claims)) {
+        if (false === array_key_exists('userinfo', $requested_claims)) {
             return $requested_claims['userinfo'];
         }
         return [];
     }
     /**
      * @param AccessToken $accessToken

1503) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfoEndpoint/UserInfoEndpoint.php:176    [M] Identical

--- Original
+++ New
@@ @@
         $requested_claims = $accessToken->getMetadata('requested_claims');
-        if (true === array_key_exists('userinfo', $requested_claims)) {
+        if (true !== array_key_exists('userinfo', $requested_claims)) {
             return $requested_claims['userinfo'];
         }
         return [];
     }
     /**
      * @param AccessToken $accessToken

1504) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfoEndpoint/UserInfoEndpoint.php:193    [M] Identical

--- Original
+++ New
@@ @@
         $clientId = $accessToken->getClientId();
-        if (null === $clientId || null === ($client = $this->clientRepository->find($clientId))) {
+        if (null !== $clientId || null === ($client = $this->clientRepository->find($clientId))) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, 'Unable to find the client.');
         }
         return $client;
     }
     /**
      * @param AccessToken $accessToken

1505) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfoEndpoint/UserInfoEndpoint.php:193    [M] Identical

--- Original
+++ New
@@ @@
         $clientId = $accessToken->getClientId();
-        if (null === $clientId || null === ($client = $this->clientRepository->find($clientId))) {
+        if (null === $clientId || null !== ($client = $this->clientRepository->find($clientId))) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, 'Unable to find the client.');
         }
         return $client;
     }
     /**
      * @param AccessToken $accessToken

1506) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfoEndpoint/UserInfoEndpoint.php:193    [M] LogicalOr

--- Original
+++ New
@@ @@
         $clientId = $accessToken->getClientId();
-        if (null === $clientId || null === ($client = $this->clientRepository->find($clientId))) {
+        if (null === $clientId && null === ($client = $this->clientRepository->find($clientId))) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, 'Unable to find the client.');
         }
         return $client;
     }
     /**
      * @param AccessToken $accessToken

1507) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfoEndpoint/UserInfoEndpoint.php:210    [M] LogicalNot

--- Original
+++ New
@@ @@
         $userAccountId = $accessToken->getResourceOwnerId();
-        if (!$userAccountId instanceof UserAccountId || null === ($userAccount = $this->userAccountRepository->find($userAccountId))) {
+        if ($userAccountId instanceof UserAccountId || null === ($userAccount = $this->userAccountRepository->find($userAccountId))) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, 'Unable to find the resource owner.');
         }
         return $userAccount;
     }
     /**
      * @param AccessToken $accessToken

1508) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfoEndpoint/UserInfoEndpoint.php:210    [M] Identical

--- Original
+++ New
@@ @@
         $userAccountId = $accessToken->getResourceOwnerId();
-        if (!$userAccountId instanceof UserAccountId || null === ($userAccount = $this->userAccountRepository->find($userAccountId))) {
+        if (!$userAccountId instanceof UserAccountId || null !== ($userAccount = $this->userAccountRepository->find($userAccountId))) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, 'Unable to find the resource owner.');
         }
         return $userAccount;
     }
     /**
      * @param AccessToken $accessToken

1509) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfoEndpoint/UserInfoEndpoint.php:210    [M] LogicalOr

--- Original
+++ New
@@ @@
         $userAccountId = $accessToken->getResourceOwnerId();
-        if (!$userAccountId instanceof UserAccountId || null === ($userAccount = $this->userAccountRepository->find($userAccountId))) {
+        if (!$userAccountId instanceof UserAccountId && null === ($userAccount = $this->userAccountRepository->find($userAccountId))) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, 'Unable to find the resource owner.');
         }
         return $userAccount;
     }
     /**
      * @param AccessToken $accessToken

1510) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfoEndpoint/UserInfoEndpoint.php:224    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$accessToken->hasMetadata('redirect_uri')) {
+        if ($accessToken->hasMetadata('redirect_uri')) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_TOKEN, 'The access token has not been issued through the authorization endpoint and cannot be used.');
         }
     }
     /**
      * @param AccessToken $accessToken
      *

1511) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/OpenIdConnect/UserInfoEndpoint/UserInfoEndpoint.php:236    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$accessToken->hasScope('openid')) {
+        if ($accessToken->hasScope('openid')) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_TOKEN, 'The access token does not contain the "openid" scope.');
         }
     }
 }

1519) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/RefreshTokenGrant/RefreshToken.php:133    [M] LogicalNot

--- Original
+++ New
@@ @@
         $data = $data->with('expires_in', $this->getExpiresIn());
-        if (!empty($this->getScopes())) {
+        if (empty($this->getScopes())) {
             $data = $data->with('scope', implode(' ', $this->getScopes()));
         }
         if (!empty($this->getTokenId())) {
             $data = $data->with('refresh_token', $this->getTokenId());
         }
         return $data->all();

1520) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/RefreshTokenGrant/RefreshToken.php:136    [M] LogicalNot

--- Original
+++ New
@@ @@
         }
-        if (!empty($this->getTokenId())) {
+        if (empty($this->getTokenId())) {
             $data = $data->with('refresh_token', $this->getTokenId());
         }
         return $data->all();
     }
     /**
      * {@inheritdoc}

1522) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/ClientAssertionJwt.php:78    [M] OneZeroInteger

--- Original
+++ New
@@ @@
      */
-    public function __construct(JwsCompactSerializer $jwsSerializer, JWSVerifier $jwsVerifier, ClaimCheckerManager $claimCheckerManager, int $secretLifetime = 0)
+    public function __construct(JwsCompactSerializer $jwsSerializer, JWSVerifier $jwsVerifier, ClaimCheckerManager $claimCheckerManager, int $secretLifetime = 1)
     {
         if ($secretLifetime < 0) {
             throw new \InvalidArgumentException('The secret lifetime must be at least 0 (= unlimited).');
         }
         $this->jwsSerializer = $jwsSerializer;
         $this->jwsVerifier = $jwsVerifier;

1528) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/ClientAssertionJwt.php:116    [M] Identical

--- Original
+++ New
@@ @@
     {
-        return null === $this->jweDecrypter ? [] : $this->jweDecrypter->getContentEncryptionAlgorithmManager()->list();
+        return null !== $this->jweDecrypter ? [] : $this->jweDecrypter->getContentEncryptionAlgorithmManager()->list();
     }
     /**
      * @return string[]
      */
     public function getSupportedKeyEncryptionAlgorithms() : array
     {

1530) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/ClientAssertionJwt.php:124    [M] Identical

--- Original
+++ New
@@ @@
     {
-        return null === $this->jweDecrypter ? [] : $this->jweDecrypter->getKeyEncryptionAlgorithmManager()->list();
+        return null !== $this->jweDecrypter ? [] : $this->jweDecrypter->getKeyEncryptionAlgorithmManager()->list();
     }
     /**
      * {@inheritdoc}
      */
     public function getSchemesParameters() : array
     {

1533) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/ClientAssertionJwt.php:141    [M] LogicalNot

--- Original
+++ New
@@ @@
         $parameters = $request->getParsedBody() ?? [];
-        if (!array_key_exists('client_assertion_type', $parameters)) {
+        if (array_key_exists('client_assertion_type', $parameters)) {
             return null;
         }
         $clientAssertionType = $parameters['client_assertion_type'];
         //We verify the client assertion type in the request
         if ('urn:ietf:params:oauth:client-assertion-type:jwt-bearer' !== $clientAssertionType) {
             return null;

1534) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/ClientAssertionJwt.php:147    [M] NotIdentical

--- Original
+++ New
@@ @@
         //We verify the client assertion type in the request
-        if ('urn:ietf:params:oauth:client-assertion-type:jwt-bearer' !== $clientAssertionType) {
+        if ('urn:ietf:params:oauth:client-assertion-type:jwt-bearer' === $clientAssertionType) {
             return null;
         }
         try {
             if (!array_key_exists('client_assertion', $parameters)) {
                 throw new \InvalidArgumentException('Parameter "client_assertion" is missing.');
             }

1535) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/ClientAssertionJwt.php:152    [M] LogicalNot

--- Original
+++ New
@@ @@
         try {
-            if (!array_key_exists('client_assertion', $parameters)) {
+            if (array_key_exists('client_assertion', $parameters)) {
                 throw new \InvalidArgumentException('Parameter "client_assertion" is missing.');
             }
             $client_assertion = $parameters['client_assertion'];
             $client_assertion = $this->tryToDecryptClientAssertion($client_assertion);
             $jws = $this->jwsSerializer->unserialize($client_assertion);
             if (1 !== $jws->countSignatures()) {

1536) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/ClientAssertionJwt.php:158    [M] OneZeroInteger

--- Original
+++ New
@@ @@
             $jws = $this->jwsSerializer->unserialize($client_assertion);
-            if (1 !== $jws->countSignatures()) {
+            if (0 !== $jws->countSignatures()) {
                 throw new \InvalidArgumentException('The assertion must have only one signature.');
             }
             $claims = json_decode($jws->getPayload(), true);
             $claims = $this->claimCheckerManager->check($claims);
             $diff = array_diff(['iss', 'sub', 'aud', 'jti', 'exp'], array_keys($claims));
             if (!empty($diff)) {

1537) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/ClientAssertionJwt.php:158    [M] NotIdentical

--- Original
+++ New
@@ @@
             $jws = $this->jwsSerializer->unserialize($client_assertion);
-            if (1 !== $jws->countSignatures()) {
+            if (1 === $jws->countSignatures()) {
                 throw new \InvalidArgumentException('The assertion must have only one signature.');
             }
             $claims = json_decode($jws->getPayload(), true);
             $claims = $this->claimCheckerManager->check($claims);
             $diff = array_diff(['iss', 'sub', 'aud', 'jti', 'exp'], array_keys($claims));
             if (!empty($diff)) {

1539) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/ClientAssertionJwt.php:165    [M] LogicalNot

--- Original
+++ New
@@ @@
             $diff = array_diff(['iss', 'sub', 'aud', 'jti', 'exp'], array_keys($claims));
-            if (!empty($diff)) {
+            if (empty($diff)) {
                 throw new \InvalidArgumentException(sprintf('The following claim(s) is/are mandatory: "%s".', implode(', ', array_values($diff))));
             }
             if ($claims['sub'] !== $claims['iss']) {
                 throw new \InvalidArgumentException('The claims "sub" and "iss" must contain the client public ID.');
             }
         } catch (\Exception $e) {

1540) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/ClientAssertionJwt.php:168    [M] NotIdentical

--- Original
+++ New
@@ @@
             }
-            if ($claims['sub'] !== $claims['iss']) {
+            if ($claims['sub'] === $claims['iss']) {
                 throw new \InvalidArgumentException('The claims "sub" and "iss" must contain the client public ID.');
             }
         } catch (\Exception $e) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, $e->getMessage());
         }
         $clientCredentials = $jws;
