1554) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/ClientAssertionJwt.php:242    [M] Identical

--- Original
+++ New
@@ @@
     {
-        if ('client_secret_jwt' === $commandParameters->get('token_endpoint_auth_method')) {
+        if ('client_secret_jwt' !== $commandParameters->get('token_endpoint_auth_method')) {
             $validatedParameters = $validatedParameters->with('client_secret', $this->createClientSecret());
             $validatedParameters = $validatedParameters->with('client_secret_expires_at', 0 === $this->secretLifetime ? 0 : time() + $this->secretLifetime);
         } elseif ('private_key_jwt' === $commandParameters->get('token_endpoint_auth_method')) {
             if (!($commandParameters->has('jwks') xor $commandParameters->has('jwks_uri'))) {
                 throw new \InvalidArgumentException('The parameter "jwks" or "jwks_uri" must be set.');
             }

1555) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/ClientAssertionJwt.php:244    [M] OneZeroInteger

--- Original
+++ New
@@ @@
             $validatedParameters = $validatedParameters->with('client_secret', $this->createClientSecret());
-            $validatedParameters = $validatedParameters->with('client_secret_expires_at', 0 === $this->secretLifetime ? 0 : time() + $this->secretLifetime);
+            $validatedParameters = $validatedParameters->with('client_secret_expires_at', 1 === $this->secretLifetime ? 0 : time() + $this->secretLifetime);
         } elseif ('private_key_jwt' === $commandParameters->get('token_endpoint_auth_method')) {
             if (!($commandParameters->has('jwks') xor $commandParameters->has('jwks_uri'))) {
                 throw new \InvalidArgumentException('The parameter "jwks" or "jwks_uri" must be set.');
             }
             if ($commandParameters->has('jwks')) {
                 $jwks = JWKSet::createFromKeyData($commandParameters->get('jwks'));

1556) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/ClientAssertionJwt.php:244    [M] Identical

--- Original
+++ New
@@ @@
             $validatedParameters = $validatedParameters->with('client_secret', $this->createClientSecret());
-            $validatedParameters = $validatedParameters->with('client_secret_expires_at', 0 === $this->secretLifetime ? 0 : time() + $this->secretLifetime);
+            $validatedParameters = $validatedParameters->with('client_secret_expires_at', 0 !== $this->secretLifetime ? 0 : time() + $this->secretLifetime);
         } elseif ('private_key_jwt' === $commandParameters->get('token_endpoint_auth_method')) {
             if (!($commandParameters->has('jwks') xor $commandParameters->has('jwks_uri'))) {
                 throw new \InvalidArgumentException('The parameter "jwks" or "jwks_uri" must be set.');
             }
             if ($commandParameters->has('jwks')) {
                 $jwks = JWKSet::createFromKeyData($commandParameters->get('jwks'));

1557) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/ClientAssertionJwt.php:244    [M] OneZeroInteger

--- Original
+++ New
@@ @@
             $validatedParameters = $validatedParameters->with('client_secret', $this->createClientSecret());
-            $validatedParameters = $validatedParameters->with('client_secret_expires_at', 0 === $this->secretLifetime ? 0 : time() + $this->secretLifetime);
+            $validatedParameters = $validatedParameters->with('client_secret_expires_at', 0 === $this->secretLifetime ? 1 : time() + $this->secretLifetime);
         } elseif ('private_key_jwt' === $commandParameters->get('token_endpoint_auth_method')) {
             if (!($commandParameters->has('jwks') xor $commandParameters->has('jwks_uri'))) {
                 throw new \InvalidArgumentException('The parameter "jwks" or "jwks_uri" must be set.');
             }
             if ($commandParameters->has('jwks')) {
                 $jwks = JWKSet::createFromKeyData($commandParameters->get('jwks'));

1558) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/ClientAssertionJwt.php:244    [M] Plus

--- Original
+++ New
@@ @@
             $validatedParameters = $validatedParameters->with('client_secret', $this->createClientSecret());
-            $validatedParameters = $validatedParameters->with('client_secret_expires_at', 0 === $this->secretLifetime ? 0 : time() + $this->secretLifetime);
+            $validatedParameters = $validatedParameters->with('client_secret_expires_at', 0 === $this->secretLifetime ? 0 : time() - $this->secretLifetime);
         } elseif ('private_key_jwt' === $commandParameters->get('token_endpoint_auth_method')) {
             if (!($commandParameters->has('jwks') xor $commandParameters->has('jwks_uri'))) {
                 throw new \InvalidArgumentException('The parameter "jwks" or "jwks_uri" must be set.');
             }
             if ($commandParameters->has('jwks')) {
                 $jwks = JWKSet::createFromKeyData($commandParameters->get('jwks'));

1559) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/ClientAssertionJwt.php:245    [M] Identical

--- Original
+++ New
@@ @@
             $validatedParameters = $validatedParameters->with('client_secret_expires_at', 0 === $this->secretLifetime ? 0 : time() + $this->secretLifetime);
-        } elseif ('private_key_jwt' === $commandParameters->get('token_endpoint_auth_method')) {
+        } elseif ('private_key_jwt' !== $commandParameters->get('token_endpoint_auth_method')) {
             if (!($commandParameters->has('jwks') xor $commandParameters->has('jwks_uri'))) {
                 throw new \InvalidArgumentException('The parameter "jwks" or "jwks_uri" must be set.');
             }
             if ($commandParameters->has('jwks')) {
                 $jwks = JWKSet::createFromKeyData($commandParameters->get('jwks'));
                 if (!$jwks instanceof JWKSet) {

1560) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/ClientAssertionJwt.php:246    [M] LogicalNot

--- Original
+++ New
@@ @@
         } elseif ('private_key_jwt' === $commandParameters->get('token_endpoint_auth_method')) {
-            if (!($commandParameters->has('jwks') xor $commandParameters->has('jwks_uri'))) {
+            if ($commandParameters->has('jwks') xor $commandParameters->has('jwks_uri')) {
                 throw new \InvalidArgumentException('The parameter "jwks" or "jwks_uri" must be set.');
             }
             if ($commandParameters->has('jwks')) {
                 $jwks = JWKSet::createFromKeyData($commandParameters->get('jwks'));
                 if (!$jwks instanceof JWKSet) {
                     throw new \InvalidArgumentException('The parameter "jwks" must be a valid JWKSet object.');

1561) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/ClientAssertionJwt.php:251    [M] LogicalNot

--- Original
+++ New
@@ @@
                 $jwks = JWKSet::createFromKeyData($commandParameters->get('jwks'));
-                if (!$jwks instanceof JWKSet) {
+                if ($jwks instanceof JWKSet) {
                     throw new \InvalidArgumentException('The parameter "jwks" must be a valid JWKSet object.');
                 }
                 $validatedParameters = $validatedParameters->with('jwks', $commandParameters->get('jwks'));
             }
             /* else { FIXME
                    $jwks = JWKFactory::createFromJKU($commandParameters->get('jwks_uri'));

1562) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/ClientAssertionJwt.php:240    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function checkClientConfiguration(DataBag $commandParameters, DataBag $validatedParameters) : DataBag
+    protected function checkClientConfiguration(DataBag $commandParameters, DataBag $validatedParameters) : DataBag
     {
         if ('client_secret_jwt' === $commandParameters->get('token_endpoint_auth_method')) {
             $validatedParameters = $validatedParameters->with('client_secret', $this->createClientSecret());
             $validatedParameters = $validatedParameters->with('client_secret_expires_at', 0 === $this->secretLifetime ? 0 : time() + $this->secretLifetime);
         } elseif ('private_key_jwt' === $commandParameters->get('token_endpoint_auth_method')) {
             if (!($commandParameters->has('jwks') xor $commandParameters->has('jwks_uri'))) {

1563) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/ClientSecretBasic.php:39    [M] OneZeroInteger

--- Original
+++ New
@@ @@
      */
-    public function __construct(string $realm, int $secretLifetime = 0)
+    public function __construct(string $realm, int $secretLifetime = 1)
     {
         if ($secretLifetime < 0) {
             throw new \InvalidArgumentException('The secret lifetime must be at least 0 (= unlimited).');
         }
         $this->realm = $realm;
         $this->secretLifetime = $secretLifetime;

1564) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/ClientSecretPost.php:33    [M] OneZeroInteger

--- Original
+++ New
@@ @@
      */
-    public function __construct(int $secretLifetime = 0)
+    public function __construct(int $secretLifetime = 1)
     {
         if ($secretLifetime < 0) {
             throw new \InvalidArgumentException('The secret lifetime must be at least 0 (= unlimited).');
         }
         $this->secretLifetime = $secretLifetime;
     }

1565) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/TokenEndpointAuthenticationMethodManager.php:41    [M] Foreach_

--- Original
+++ New
@@ @@
         $this->tokenEndpointAuthenticationMethods[] = $tokenEndpointAuthenticationMethod;
-        foreach ($tokenEndpointAuthenticationMethod->getSupportedAuthenticationMethods() as $method_name) {
+        foreach (array() as $method_name) {
             $this->tokenEndpointAuthenticationMethodNames[$method_name] = $tokenEndpointAuthenticationMethod;
         }
         return $this;
     }
     /**
      * @return string[]

1566) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/TokenEndpointAuthenticationMethodManager.php:38    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function add(TokenEndpointAuthenticationMethod $tokenEndpointAuthenticationMethod) : self
+    protected function add(TokenEndpointAuthenticationMethod $tokenEndpointAuthenticationMethod) : self
     {
         $this->tokenEndpointAuthenticationMethods[] = $tokenEndpointAuthenticationMethod;
         foreach ($tokenEndpointAuthenticationMethod->getSupportedAuthenticationMethods() as $method_name) {
             $this->tokenEndpointAuthenticationMethodNames[$method_name] = $tokenEndpointAuthenticationMethod;
         }
         return $this;

1568) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/TokenEndpointAuthenticationMethodManager.php:61    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function has(string $tokenEndpointAuthenticationMethod) : bool
+    protected function has(string $tokenEndpointAuthenticationMethod) : bool
     {
         return array_key_exists($tokenEndpointAuthenticationMethod, $this->tokenEndpointAuthenticationMethodNames);
     }
     /**
      * @param string $tokenEndpointAuthenticationMethod
      *

1569) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/TokenEndpointAuthenticationMethodManager.php:73    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function get(string $tokenEndpointAuthenticationMethod) : TokenEndpointAuthenticationMethod
+    protected function get(string $tokenEndpointAuthenticationMethod) : TokenEndpointAuthenticationMethod
     {
         Assertion::true($this->has($tokenEndpointAuthenticationMethod), sprintf('The token endpoint authentication method "%s" is not supported. Please use one of the following values: %s', $tokenEndpointAuthenticationMethod, implode(', ', $this->all())));
         return $this->tokenEndpointAuthenticationMethodNames[$tokenEndpointAuthenticationMethod];
     }
     /**
      * @return TokenEndpointAuthenticationMethod[]

1570) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/TokenEndpointAuthenticationMethodManager.php:83    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function getTokenEndpointAuthenticationMethods() : array
+    protected function getTokenEndpointAuthenticationMethods() : array
     {
         return array_values($this->tokenEndpointAuthenticationMethods);
     }
     /**
      * @param ServerRequestInterface            $request
      * @param TokenEndpointAuthenticationMethod $authenticationMethod

1571) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/TokenEndpointAuthenticationMethodManager.php:103    [M] NotIdentical

--- Original
+++ New
@@ @@
             $temp = $method->findClientId($request, $clientCredentials);
-            if (null !== $temp) {
+            if (null === $temp) {
                 if (null !== $clientId) {
                     if (!$method instanceof None && !$authenticationMethod instanceof None) {
                         $authenticationMethod = null;
                         throw new OAuth2Exception(400, ['error' => OAuth2Exception::ERROR_INVALID_REQUEST, 'error_description' => 'Only one authentication method may be used to authenticate the client.']);
                     } else {
                         if (!$method instanceof None) {

1572) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/TokenEndpointAuthenticationMethodManager.php:104    [M] NotIdentical

--- Original
+++ New
@@ @@
             if (null !== $temp) {
-                if (null !== $clientId) {
+                if (null === $clientId) {
                     if (!$method instanceof None && !$authenticationMethod instanceof None) {
                         $authenticationMethod = null;
                         throw new OAuth2Exception(400, ['error' => OAuth2Exception::ERROR_INVALID_REQUEST, 'error_description' => 'Only one authentication method may be used to authenticate the client.']);
                     } else {
                         if (!$method instanceof None) {
                             $authenticationMethod = $method;

1573) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/TokenEndpointAuthenticationMethodManager.php:105    [M] LogicalNot

--- Original
+++ New
@@ @@
                 if (null !== $clientId) {
-                    if (!$method instanceof None && !$authenticationMethod instanceof None) {
+                    if ($method instanceof None && !$authenticationMethod instanceof None) {
                         $authenticationMethod = null;
                         throw new OAuth2Exception(400, ['error' => OAuth2Exception::ERROR_INVALID_REQUEST, 'error_description' => 'Only one authentication method may be used to authenticate the client.']);
                     } else {
                         if (!$method instanceof None) {
                             $authenticationMethod = $method;
                         }

1574) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/TokenEndpointAuthenticationMethodManager.php:105    [M] LogicalNot

--- Original
+++ New
@@ @@
                 if (null !== $clientId) {
-                    if (!$method instanceof None && !$authenticationMethod instanceof None) {
+                    if (!$method instanceof None && $authenticationMethod instanceof None) {
                         $authenticationMethod = null;
                         throw new OAuth2Exception(400, ['error' => OAuth2Exception::ERROR_INVALID_REQUEST, 'error_description' => 'Only one authentication method may be used to authenticate the client.']);
                     } else {
                         if (!$method instanceof None) {
                             $authenticationMethod = $method;
                         }

1575) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/TokenEndpointAuthenticationMethodManager.php:105    [M] LogicalAnd

--- Original
+++ New
@@ @@
                 if (null !== $clientId) {
-                    if (!$method instanceof None && !$authenticationMethod instanceof None) {
+                    if (!$method instanceof None || !$authenticationMethod instanceof None) {
                         $authenticationMethod = null;
                         throw new OAuth2Exception(400, ['error' => OAuth2Exception::ERROR_INVALID_REQUEST, 'error_description' => 'Only one authentication method may be used to authenticate the client.']);
                     } else {
                         if (!$method instanceof None) {
                             $authenticationMethod = $method;
                         }

1576) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/TokenEndpointAuthenticationMethodManager.php:111    [M] LogicalNot

--- Original
+++ New
@@ @@
                     } else {
-                        if (!$method instanceof None) {
+                        if ($method instanceof None) {
                             $authenticationMethod = $method;
                         }
                     }
                 } else {
                     $clientId = $temp;
                     $authenticationMethod = $method;

1577) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/TokenEndpointAuthenticationMethodManager.php:101    [M] Foreach_

--- Original
+++ New
@@ @@
         $clientCredentials = null;
-        foreach ($this->getTokenEndpointAuthenticationMethods() as $method) {
+        foreach (array() as $method) {
             $temp = $method->findClientId($request, $clientCredentials);
             if (null !== $temp) {
                 if (null !== $clientId) {
                     if (!$method instanceof None && !$authenticationMethod instanceof None) {
                         $authenticationMethod = null;
                         throw new OAuth2Exception(400, ['error' => OAuth2Exception::ERROR_INVALID_REQUEST, 'error_description' => 'Only one authentication method may be used to authenticate the client.']);

1578) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/TokenEndpointAuthenticationMethodManager.php:97    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function findClientInformationInTheRequest(ServerRequestInterface $request, TokenEndpointAuthenticationMethod &$authenticationMethod = null, &$clientCredentials = null)
+    protected function findClientInformationInTheRequest(ServerRequestInterface $request, TokenEndpointAuthenticationMethod &$authenticationMethod = null, &$clientCredentials = null)
     {
         $clientId = null;
         $clientCredentials = null;
         foreach ($this->getTokenEndpointAuthenticationMethods() as $method) {
             $temp = $method->findClientId($request, $clientCredentials);
             if (null !== $temp) {

1579) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/TokenEndpointAuthenticationMethodManager.php:135    [M] TrueValue

--- Original
+++ New
@@ @@
     {
-        if (true === $client->isDeleted()) {
+        if (false === $client->isDeleted()) {
             return false;
         }
         if (in_array($client->get('token_endpoint_auth_method'), $authenticationMethod->getSupportedAuthenticationMethods())) {
             if (false === $client->areClientCredentialsExpired()) {
                 return $authenticationMethod->isClientAuthenticated($client, $clientCredentials, $request);
             }

1580) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/TokenEndpointAuthenticationMethodManager.php:135    [M] Identical

--- Original
+++ New
@@ @@
     {
-        if (true === $client->isDeleted()) {
+        if (true !== $client->isDeleted()) {
             return false;
         }
         if (in_array($client->get('token_endpoint_auth_method'), $authenticationMethod->getSupportedAuthenticationMethods())) {
             if (false === $client->areClientCredentialsExpired()) {
                 return $authenticationMethod->isClientAuthenticated($client, $clientCredentials, $request);
             }

1581) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/TokenEndpointAuthenticationMethodManager.php:136    [M] FalseValue

--- Original
+++ New
@@ @@
         if (true === $client->isDeleted()) {
-            return false;
+            return true;
         }
         if (in_array($client->get('token_endpoint_auth_method'), $authenticationMethod->getSupportedAuthenticationMethods())) {
             if (false === $client->areClientCredentialsExpired()) {
                 return $authenticationMethod->isClientAuthenticated($client, $clientCredentials, $request);
             }
         }

1582) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/TokenEndpointAuthenticationMethodManager.php:139    [M] FalseValue

--- Original
+++ New
@@ @@
         if (in_array($client->get('token_endpoint_auth_method'), $authenticationMethod->getSupportedAuthenticationMethods())) {
-            if (false === $client->areClientCredentialsExpired()) {
+            if (true === $client->areClientCredentialsExpired()) {
                 return $authenticationMethod->isClientAuthenticated($client, $clientCredentials, $request);
             }
         }
         return false;
     }
 }

1583) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/TokenEndpointAuthenticationMethodManager.php:139    [M] Identical

--- Original
+++ New
@@ @@
         if (in_array($client->get('token_endpoint_auth_method'), $authenticationMethod->getSupportedAuthenticationMethods())) {
-            if (false === $client->areClientCredentialsExpired()) {
+            if (false !== $client->areClientCredentialsExpired()) {
                 return $authenticationMethod->isClientAuthenticated($client, $clientCredentials, $request);
             }
         }
         return false;
     }
 }

1585) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/AuthenticationMethod/TokenEndpointAuthenticationMethodManager.php:133    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function isClientAuthenticated(ServerRequestInterface $request, Client $client, TokenEndpointAuthenticationMethod $authenticationMethod, $clientCredentials) : bool
+    protected function isClientAuthenticated(ServerRequestInterface $request, Client $client, TokenEndpointAuthenticationMethod $authenticationMethod, $clientCredentials) : bool
     {
         if (true === $client->isDeleted()) {
             return false;
         }
         if (in_array($client->get('token_endpoint_auth_method'), $authenticationMethod->getSupportedAuthenticationMethods())) {
             if (false === $client->areClientCredentialsExpired()) {

1593) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/GrantTypeData.php:213    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function withScopes(array $scopes) : self
+    protected function withScopes(array $scopes) : self
     {
         $clone = clone $this;
         $clone->scopes = $scopes;
         return $clone;
     }
     /**

1594) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/GrantTypeData.php:226    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function withScope(string $scope) : self
+    protected function withScope(string $scope) : self
     {
         if ($this->hasScope($scope)) {
             return $this;
         }
         $clone = clone $this;
         $clone->scopes[] = $scope;

1600) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/Processor/ProcessorManager.php:38    [M] NotIdentical

--- Original
+++ New
@@ @@
     {
-        if (null !== $scopeRepository) {
+        if (null === $scopeRepository) {
             $this->processors[] = new ScopeProcessor($scopeRepository, $scopePolicyManager);
         }
         $this->processors[] = new TokenTypeProcessor();
     }
     /**
      * @param ServerRequestInterface $request

1601) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/Processor/ProcessorManager.php:55    [M] OneZeroInteger

--- Original
+++ New
@@ @@
     {
-        $grantTypeData = call_user_func($this->callableForNextRule(0), $request, $grantTypeData, $grantType);
+        $grantTypeData = call_user_func($this->callableForNextRule(1), $request, $grantTypeData, $grantType);
         return $grantType->grant($request, $grantTypeData);
     }
     /**
      * @param int $index
      *
      * @return \Closure

1602) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/Processor/ProcessorManager.php:53    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function handle(ServerRequestInterface $request, GrantTypeData $grantTypeData, GrantType $grantType) : GrantTypeData
+    protected function handle(ServerRequestInterface $request, GrantTypeData $grantTypeData, GrantType $grantType) : GrantTypeData
     {
         $grantTypeData = call_user_func($this->callableForNextRule(0), $request, $grantTypeData, $grantType);
         return $grantType->grant($request, $grantTypeData);
     }
     /**
      * @param int $index

1603) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/Processor/ProcessorManager.php:67    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!isset($this->processors[$index])) {
+        if (isset($this->processors[$index])) {
             return function (ServerRequestInterface $request, GrantTypeData $grantTypeData, GrantType $grantType) : GrantTypeData {
                 return $grantTypeData;
             };
         }
         $processor = $this->processors[$index];
         return function (ServerRequestInterface $request, GrantTypeData $grantTypeData, GrantType $grantType) use($processor, $index) : GrantTypeData {

1604) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/Processor/ProcessorManager.php:75    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         return function (ServerRequestInterface $request, GrantTypeData $grantTypeData, GrantType $grantType) use($processor, $index) : GrantTypeData {
-            return $processor($request, $grantTypeData, $grantType, $this->callableForNextRule($index + 1));
+            return $processor($request, $grantTypeData, $grantType, $this->callableForNextRule($index + 0));
         };
     }
 }

1605) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/Processor/ProcessorManager.php:75    [M] Plus

--- Original
+++ New
@@ @@
         return function (ServerRequestInterface $request, GrantTypeData $grantTypeData, GrantType $grantType) use($processor, $index) : GrantTypeData {
-            return $processor($request, $grantTypeData, $grantType, $this->callableForNextRule($index + 1));
+            return $processor($request, $grantTypeData, $grantType, $this->callableForNextRule($index - 1));
         };
     }
 }

1606) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/Processor/ScopeProcessor.php:62    [M] LogicalNot

--- Original
+++ New
@@ @@
         $params = $request->getParsedBody() ?? [];
-        if (!array_key_exists('scope', $params)) {
+        if (array_key_exists('scope', $params)) {
             $scope = $grantTypeData->getAvailableScopes() ?? [];
         } else {
             $scopeParameter = $params['scope'];
             $scope = $this->scopeRepository->convertToArray($scopeParameter);
         }
         //Modify the scope according to the scope policy
