1607) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/Processor/ScopeProcessor.php:71    [M] NotIdentical

--- Original
+++ New
@@ @@
         try {
-            if (null !== $this->scopePolicyManager) {
+            if (null === $this->scopePolicyManager) {
                 $scope = $this->scopePolicyManager->apply($scope, $grantTypeData->getClient());
             }
         } catch (\InvalidArgumentException $e) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_SCOPE, $e->getMessage());
         }
         $availableScope = is_array($grantTypeData->getAvailableScopes()) ? $grantTypeData->getAvailableScopes() : $this->scopeRepository->getAvailableScopesForClient($grantTypeData->getClient());

1608) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/Processor/ScopeProcessor.php:81    [M] LogicalNot

--- Original
+++ New
@@ @@
         //Check if scope requested are within the available scope
-        if (!$this->scopeRepository->areRequestedScopesAvailable($scope, $availableScope)) {
+        if ($this->scopeRepository->areRequestedScopesAvailable($scope, $availableScope)) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_SCOPE, sprintf('An unsupported scope was requested. Available scopes are %s.', implode(', ', $availableScope)));
         }
         $grantTypeData = $grantTypeData->withScopes($scope);
         return $grantTypeData;
         //return $next($request, $grantTypeData, $grantType);
     }

1609) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/Processor/TokenTypeProcessor.php:40    [M] LogicalNot

--- Original
+++ New
@@ @@
         $tokenType = $request->getAttribute('token_type');
-        if (!$grantTypeData->getClient()->isTokenTypeAllowed($tokenType->name())) {
+        if ($grantTypeData->getClient()->isTokenTypeAllowed($tokenType->name())) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, sprintf('The token type "%s" is not allowed for the client.', $tokenType->name()));
         }
         $info = $tokenType->getInformation();
         foreach ($info as $k => $v) {
             $grantTypeData = $grantTypeData->withParameter($k, $v);
         }

1610) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/Processor/TokenTypeProcessor.php:45    [M] Foreach_

--- Original
+++ New
@@ @@
         $info = $tokenType->getInformation();
-        foreach ($info as $k => $v) {
+        foreach (array() as $k => $v) {
             $grantTypeData = $grantTypeData->withParameter($k, $v);
         }
         return $next($request, $grantTypeData, $grantType);
     }
 }

1611) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/TokenEndpoint.php:104    [M] Identical

--- Original
+++ New
@@ @@
         $grantTypeData = $grantType->prepareTokenResponse($request, $grantTypeData);
-        if (null === $grantTypeData->getClient() || $grantTypeData->getClient()->isDeleted()) {
+        if (null !== $grantTypeData->getClient() || $grantTypeData->getClient()->isDeleted()) {
             throw new OAuth2Exception(401, OAuth2Exception::ERROR_INVALID_CLIENT, 'Client authentication failed.');
         }
         // This occurs now because the client may be found during the preparation process
         $this->checkGrantType($grantTypeData->getClient(), $grantType->getGrantType());
         $grantTypeData = $this->processorManager->handle($request, $grantTypeData, $grantType);
         $accessToken = $this->issueAccessToken($grantTypeData);

1612) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/TokenEndpoint.php:104    [M] LogicalOr

--- Original
+++ New
@@ @@
         $grantTypeData = $grantType->prepareTokenResponse($request, $grantTypeData);
-        if (null === $grantTypeData->getClient() || $grantTypeData->getClient()->isDeleted()) {
+        if (null === $grantTypeData->getClient() && $grantTypeData->getClient()->isDeleted()) {
             throw new OAuth2Exception(401, OAuth2Exception::ERROR_INVALID_CLIENT, 'Client authentication failed.');
         }
         // This occurs now because the client may be found during the preparation process
         $this->checkGrantType($grantTypeData->getClient(), $grantType->getGrantType());
         $grantTypeData = $this->processorManager->handle($request, $grantTypeData, $grantType);
         $accessToken = $this->issueAccessToken($grantTypeData);

1616) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/TokenEndpoint.php:144    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!$client->isGrantTypeAllowed($grantType)) {
+        if ($client->isGrantTypeAllowed($grantType)) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_UNAUTHORIZED_CLIENT, sprintf('The grant type "%s" is unauthorized for this client.', $grantType));
         }
     }
     /**
      * @param GrantTypeData $grantTypeData
      *

1617) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/TokenEndpoint.php:157    [M] NotIdentical

--- Original
+++ New
@@ @@
         $parameters = $grantTypeData->getParameters();
-        if (in_array('offline_access', $grantTypeData->getScopes()) && null !== $this->refreshTokenRepository) {
+        if (in_array('offline_access', $grantTypeData->getScopes()) && null === $this->refreshTokenRepository) {
             $refreshToken = $this->refreshTokenRepository->create($grantTypeData->getClient()->getPublicId(), $grantTypeData->getParameters(), $grantTypeData->getMetadatas(), $grantTypeData->getScopes(), null, null);
             $parameters = $parameters->with('refresh_token', $refreshToken->getTokenId());
         } else {
             $refreshToken = null;
         }
         $accessToken = $this->accessTokenRepository->create($grantTypeData->getResourceOwnerId(), $grantTypeData->getClient()->getPublicId(), $parameters, $grantTypeData->getMetadatas(), $grantTypeData->getScopes(), null, null);

1618) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/TokenEndpoint.php:157    [M] LogicalAnd

--- Original
+++ New
@@ @@
         $parameters = $grantTypeData->getParameters();
-        if (in_array('offline_access', $grantTypeData->getScopes()) && null !== $this->refreshTokenRepository) {
+        if (in_array('offline_access', $grantTypeData->getScopes()) || null !== $this->refreshTokenRepository) {
             $refreshToken = $this->refreshTokenRepository->create($grantTypeData->getClient()->getPublicId(), $grantTypeData->getParameters(), $grantTypeData->getMetadatas(), $grantTypeData->getScopes(), null, null);
             $parameters = $parameters->with('refresh_token', $refreshToken->getTokenId());
         } else {
             $refreshToken = null;
         }
         $accessToken = $this->accessTokenRepository->create($grantTypeData->getResourceOwnerId(), $grantTypeData->getClient()->getPublicId(), $parameters, $grantTypeData->getMetadatas(), $grantTypeData->getScopes(), null, null);

1619) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/TokenEndpoint.php:181    [M] NotIdentical

--- Original
+++ New
@@ @@
         $accessToken = $this->accessTokenRepository->create($grantTypeData->getResourceOwnerId(), $grantTypeData->getClient()->getPublicId(), $parameters, $grantTypeData->getMetadatas(), $grantTypeData->getScopes(), null, null);
-        if (null !== $refreshToken) {
+        if (null === $refreshToken) {
             $refreshToken = $refreshToken->addAccessToken($accessToken->getTokenId());
             $this->refreshTokenRepository->save($refreshToken);
         }
         $this->accessTokenRepository->save($accessToken);
         return $accessToken;
     }

1620) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/TokenEndpoint.php:200    [M] Identical

--- Original
+++ New
@@ @@
         $resourceOwner = $this->clientRepository->find(ClientId::create($resourceOwnerId->getValue()));
-        if (null === $resourceOwner) {
+        if (null !== $resourceOwner) {
             $resourceOwner = $this->userAccountRepository->find(UserAccountId::create($resourceOwnerId->getValue()));
         }
         if (null === $resourceOwner) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, 'Unable to find the associated resource owner.');
         }
         return $resourceOwner;

1621) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/TokenEndpoint.php:204    [M] Identical

--- Original
+++ New
@@ @@
         }
-        if (null === $resourceOwner) {
+        if (null !== $resourceOwner) {
             throw new OAuth2Exception(400, OAuth2Exception::ERROR_INVALID_REQUEST, 'Unable to find the associated resource owner.');
         }
         return $resourceOwner;
     }
 }

1622) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/TokenEndpointExtensionManager.php:32    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function add(TokenEndpointExtension $accessTokenParameterExtension) : self
+    protected function add(TokenEndpointExtension $accessTokenParameterExtension) : self
     {
         $this->extensions[] = $accessTokenParameterExtension;
         return $this;
     }
     /**
      * @param Client        $client

1623) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/TokenEndpointExtensionManager.php:48    [M] OneZeroInteger

--- Original
+++ New
@@ @@
     {
-        return call_user_func($this->callableForNextExtension(0), $client, $resourceOwner, $accessToken);
+        return call_user_func($this->callableForNextExtension(1), $client, $resourceOwner, $accessToken);
     }
     /**
      * @param int $index
      *
      * @return \Closure
      */

1624) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/TokenEndpointExtensionManager.php:46    [M] PublicVisibility

--- Original
+++ New
@@ @@
      */
-    public function process(Client $client, ResourceOwner $resourceOwner, AccessToken $accessToken) : array
+    protected function process(Client $client, ResourceOwner $resourceOwner, AccessToken $accessToken) : array
     {
         return call_user_func($this->callableForNextExtension(0), $client, $resourceOwner, $accessToken);
     }
     /**
      * @param int $index
      *

1625) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/TokenEndpointExtensionManager.php:58    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
-        if (!array_key_exists($index, $this->extensions)) {
+        if (array_key_exists($index, $this->extensions)) {
             return function (Client $client, ResourceOwner $resourceOwner, AccessToken $accessToken) : array {
                 return $accessToken->getResponseData();
             };
         }
         $extension = $this->extensions[$index];
         return function (Client $client, ResourceOwner $resourceOwner, AccessToken $accessToken) use($extension, $index) : array {

1626) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/TokenEndpointExtensionManager.php:66    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         return function (Client $client, ResourceOwner $resourceOwner, AccessToken $accessToken) use($extension, $index) : array {
-            return $extension->process($client, $resourceOwner, $accessToken, $this->callableForNextExtension($index + 1));
+            return $extension->process($client, $resourceOwner, $accessToken, $this->callableForNextExtension($index + 0));
         };
     }
 }

1627) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenEndpoint/TokenEndpointExtensionManager.php:66    [M] Plus

--- Original
+++ New
@@ @@
         return function (Client $client, ResourceOwner $resourceOwner, AccessToken $accessToken) use($extension, $index) : array {
-            return $extension->process($client, $resourceOwner, $accessToken, $this->callableForNextExtension($index + 1));
+            return $extension->process($client, $resourceOwner, $accessToken, $this->callableForNextExtension($index - 1));
         };
     }
 }

1628) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenIntrospectionEndpoint/TokenIntrospectionEndpoint.php:74    [M] FalseValue

--- Original
+++ New
@@ @@
             }
-            $responseContent = ['active' => false];
+            $responseContent = ['active' => true];
             $responseStatucCode = 200;
         } catch (OAuth2Exception $e) {
             $responseContent = $e->getData();
             $responseStatucCode = $e->getCode();
         }
         $response = $this->responseFactory->createResponse($responseStatucCode);

1629) /mnt/c/Users/Spomky/Documents/Travaux/oauth2-framework/src/Component/Server/TokenType/TokenTypeManager.php:36    [M] FalseValue

--- Original
+++ New
@@ @@
      */
-    public function add(TokenType $tokenType, bool $default = false) : self
+    public function add(TokenType $tokenType, bool $default = true) : self
     {
         $this->tokenTypes[$tokenType->name()] = $tokenType;
         if (null === $this->defaultTokenType || true === $default) {
             $this->defaultTokenType = $tokenType->name();
         }
         return $this;
